             PGM
             DCL        VAR(&AREA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SYSN) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&AREA)
             RTVNETA    SYSNAME(&SYSN)

             IF         COND(&SYSN *EQ 'P02') THEN(DO)
                IF      COND(&AREA *NE 'P' *AND +
                             &AREA *NE 'M' *AND +
                             &AREA *NE 'L')      THEN(+
                CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('P'))
             ENDDO

             IF         COND(&SYSN *EQ 'S7808446') THEN(+
                CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('T'))

             IF         COND(&SYSN *EQ 'H03') THEN(+
                CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('H'))

             IF         COND(&SYSN *EQ 'THCO') THEN(+
                CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('K'))

             CALL       PGM(ARE003R)

             CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE(&AREA)
             ENDPGM
