             PGM
             DCL        VAR(&TDATE) TYPE(*CHAR) LEN(6)

             CALL  PGM(ARE008RS)

             RTVDTAARA  DTAARA(DALIB/ACCTLDTAT (7 6)) RTNVAR(&TDATE)
             CALL  PGM(ARE008R)  PARM(&TDATE)
             ENDPGM
