     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARE055P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CSF                                  */
     /*     4.FUNCTION     營業退款過入財會處理作業               */
     /*     5.DATE-WRITTEN  93/10/13                                */
     /*     6.DATE-UPDATE                                           */
     /*                                                             */
     /***************************************************************/
           PGM
           DCL        VAR(&TYPE)    TYPE(*CHAR) LEN(1)
           DCL        VAR(&P#IN03)  TYPE(*CHAR) LEN(1)
           DCL        VAR(&P#IN12)  TYPE(*CHAR) LEN(1)
           DCL        VAR(&P#RTDP)  TYPE(*CHAR) LEN(1)
           DCL        VAR(&P#USTP)  TYPE(*CHAR) LEN(2)
           DCL        VAR(&P#RTDS)  TYPE(*DEC)  LEN(8 0)
           DCL        VAR(&P#RTDE)  TYPE(*DEC)  LEN(8 0)
           DCL        VAR(&C#RTDS)  TYPE(*CHAR) LEN(8)
           DCL        VAR(&C#YY)    TYPE(*CHAR) LEN(2)
           DCL        VAR(&FILE)    TYPE(*CHAR) LEN(10)
           DCL        VAR(&P#CODE)  TYPE(*CHAR) LEN(1)

 START:    CALL    PGM(ARE055RS) PARM(&P#IN03 &P#RTDP &P#RTDS &P#RTDE &P#USTP +
                                      &P#CODE)
           IF         COND(&P#IN03 *EQ '1') THEN(GOTO ENDCLPGM)

           CHGVAR     VAR(&C#RTDS)  VALUE(&P#RTDS)
           CHGDTAARA  DTAARA(*LDA (300 8))   VALUE(&C#RTDS)
           CHGDTAARA  DTAARA(*LDA (308 1))   VALUE(&P#CODE)
           RTVDTAARA  DTAARA(*LDA (302 2))   RTNVAR(&C#YY)
           CHGVAR     VAR(&FILE)    VALUE('GL' *CAT &P#RTDP *CAT 'R' +
                          *CAT &C#YY)
           CHKOBJ     OBJ(&FILE) OBJTYPE(*FILE) AUT(*CHANGE)
           MONMSG     MSGID(CPF0000) EXEC(RETURN)
           OVRDBF     FILE(GLTRAN)  TOFILE(&FILE)
      /*   OVRDBF     FILE(GLTRAX)  TOFILE(S02CSF/GLTRAX)     */
           OVRDBF     FILE(ARRETN)  TOFILE(ARRETN) SHARE(*YES)

           IF         COND(&P#RTDP  *NE  'P')   THEN(        +
           OPNQRYF    FILE(ARRETN) OPTION(*ALL) QRYSLT('     +
                      (ANFL01 *EQ "Y")                 *AND  +
                      (ANFL02 *EQ "Y")                 *AND  +
                      (RTNO   *EQ "' || &P#RTDP || '") *AND  +
                      (ANUSTP *EQ "' || &P#USTP || '")')     +
                      MAPFLD((RTNO   '%SST(ANRTNO 1 1)'))    +
                      KEYFLD((ANRTNO) (ANITEM)))

           ELSE

           IF         COND((&P#RTDP  *EQ 'P')          *AND  +
                           (&P#USTP  *EQ 'A1'))  THEN(       +
           OPNQRYF    FILE(ARRETN) OPTION(*ALL) QRYSLT('     +
                      (ANFL01 *EQ "Y")                 *AND  +
                      (ANFL02 *EQ "Y")                 *AND  +
                      ((RTNO   *EQ "P")                 *OR  +
                       (RTNO   *EQ "M")                 *OR  +
                       (RTNO   *EQ "T"))               *AND  +
                      (ANUSTP *EQ "' || &P#USTP || '")')     +
                      MAPFLD((RTNO   '%SST(ANRTNO 1 1)'))    +
                      KEYFLD((ANRTNO) (ANITEM)))

           ELSE

           IF         COND((&P#USTP  *EQ 'A2')         *OR  +
                           (&P#USTP  *EQ 'A3'))  THEN(      +
           OPNQRYF    FILE(ARRETN) OPTION(*ALL) QRYSLT('     +
                      (ANFL01 *EQ "Y")                 *AND  +
                      (ANFL02 *EQ "Y")                 *AND  +
                      ((RTNO   *EQ "T")                 *OR  +
                       (RTNO   *EQ "M"))               *AND  +
                      (ANUSTP *EQ "' || &P#USTP || '")')     +
                      MAPFLD((RTNO   '%SST(ANRTNO 1 1)'))    +
                      KEYFLD((ANRTNO) (ANITEM)))

           ELSE

           IF         COND((&P#USTP  *EQ 'A4'))  THEN(       +
           OPNQRYF    FILE(ARRETN) OPTION(*ALL) QRYSLT('     +
                      (ANFL01 *EQ "Y")                 *AND  +
                      (ANFL02 *EQ "Y")                 *AND  +
                      ((RTNO   *EQ "P")                 *OR  +
                       (RTNO   *EQ "H")                 *OR  +
                       (RTNO   *EQ "M"))               *AND  +
                      (ANUSTP *EQ "' || &P#USTP || '")')     +
                      MAPFLD((RTNO   '%SST(ANRTNO 1 1)'))    +
                      KEYFLD((ANRTNO) (ANITEM)))

           CALL       ARE055R  PARM(&P#IN12)
           CLOF       OPNID(ARRETN)
           DLTOVR     FILE(*ALL)
           IF         COND(&P#IN12 *EQ '1') THEN(GOTO CMDLBL(START))

 ENDCLPGM: ENDPGM
