     /****************************************************************/
     /*                                                              */
     /*               >>   PROGRAM INTRODUCTION   <<                 */
     /*                                                              */
     /*            1.PROGRAM-ID    ARE049PF                          */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            3.AUTHOR        S02CSF                            */
     /*            4.FUNCTION     新版承購客戶沖銷作業（修正程式)  */
     /*            5.DATE-WRITTEN  92/08/28                          */
     /*            6.DATE-MODIFY                                     */
     /*                                                              */
     /****************************************************************/
            PGM
            DCL        VAR(&INT)    TYPE(*CHAR)  LEN(1)
            DCL        VAR(&DSPID)  TYPE(*CHAR)  LEN(10)

            RTVJOBA    JOB(&DSPID)   TYPE(&INT)
            IF         COND(&INT  *EQ '0') THEN(GOTO CMDLBL(BATCH))

            SBMJOB     CMD(CALL PGM(ARLIB/ARE049PF)) JOB(ARE049PF) +
                       JOBD(ARJOBD)
            RETURN

 BATCH:
            OVRDBF     FILE(ARCVDT) TOFILE(DALIB/ARCVDT) +
                       SHARE(*YES)
            OPNQRYF    FILE(ARCVDT) OPTION(*ALL)
            CALL       PGM(ARLIB/ARE049RF)
            CLOF       OPNID(ARCVDT)
            DLTOVR     FILE(*ALL)

            ENDPGM
