        /******************************************************/
        /*                                                    */
        /*        >>   PROGRAM INTRODUCTION  <<               */
        /*        1.PROGRAM-ID     ARE095P                    */
        /*        2.PROGRAM-TYPE   CLP                        */
        /*        3.AUTHOR         S02LBU                     */
        /*        4.FUNCTION    營業外銷報關資料維護    */
        /*        5.DATE-WRITTEN   98/01/21                   */
        /*        6.DATE-MODIFY                               */
        /*                                                    */
        /******************************************************/
            PGM
            DCL        VAR(&P#IN03)   TYPE(*CHAR) LEN(1)
            DCL        VAR(&P#IN12)   TYPE(*CHAR) LEN(1)
            DCL        VAR(&W#DATS)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&W#DATE)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&W#ORNO)   TYPE(*CHAR) LEN(6)

            CALL       PGM(ARE095R)

            ENDPGM
