     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP050P2                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02YSH                                  */
     /*     4.FUNCTION     進倉履約折讓自動處理作業-開立處理    */
     /*     5.DATE-WRITTEN  91/02/22                                */
     /*     6.UPDATE  DATE 104/07/03 S00WCJ (0407A)                 */
     /*                    原程式為ARE050P2，增加ALCOBJ檢核   */
     /*                    將程式更名為ARE050P5，並增加篩選     */
     /*                    資料時只抓USRPRF的資料               */
     /*                    109/06/02 S00WCJ (0906A)                 */
     /*                     增加處理廠區參數傳入及篩選            */
     /*                                                             */
     /***************************************************************/
/*0906A*/    PGM        PARM(&P#CUNO &P#YYMM &P#CONT &P#ARE1)

             DCL        VAR(&P#CUNO)  TYPE(*CHAR)  LEN(6)
             DCL        VAR(&P#YYMM)  TYPE(*CHAR)  LEN(6)
             DCL        VAR(&P#CONT)  TYPE(*CHAR)  LEN(3)
             DCL        VAR(&C#CUNS)  TYPE(*CHAR)  LEN(6)
             DCL        VAR(&C#CUNE)  TYPE(*CHAR)  LEN(6)
/*0906A*/    DCL        VAR(&P#ARE1)  TYPE(*CHAR)  LEN(1)
/*0906A*/    DCL        VAR(&C#ARES)  TYPE(*CHAR)  LEN(1)
/*0906A*/    DCL        VAR(&C#AREE)  TYPE(*CHAR)  LEN(1)

             CHGDTAARA  DTAARA(*LDA (401 6)) VALUE(&P#CUNO)
             CHGDTAARA  DTAARA(*LDA (407 6)) VALUE(&P#YYMM)
             CHGDTAARA  DTAARA(*LDA (413 3)) VALUE(&P#CONT)

             IF         COND(&P#CUNO *EQ '      ') THEN(DO)
             CHGVAR     VAR(&C#CUNS) VALUE('      ')
             CHGVAR     VAR(&C#CUNE) VALUE('999999')
             ENDDO
             ELSE (DO)
             CHGVAR     VAR(&C#CUNS) VALUE(&P#CUNO)
             CHGVAR     VAR(&C#CUNE) VALUE(&P#CUNO)
             ENDDO

/*0906A*/    IF         COND(&P#ARE1 *EQ ' ')   THEN(DO)
/*0906A*/        CHGVAR      VAR(&C#ARES)   VALUE(' ')
/*0906A*/        CHGVAR      VAR(&C#AREE)   VALUE('9')
/*0906A*/    ENDDO
/*0906A*/    ELSE (DO)
/*0906A*/        CHGVAR      VAR(&C#ARES)   VALUE(&P#ARE1)
/*0906A*/        CHGVAR      VAR(&C#AREE)   VALUE(&P#ARE1)
/*0906A*/    ENDDO

 /*0407A*/ /*  RTVDTAARA  (*LDA (         */
             OVRDBF     FILE(DISMST)  TOFILE(DISMST)  SHARE(*YES)
        /*   ADDLIBLE   S02YSH                                           */
        /*   MONMSG     MSGID(CPF0000)                                   */
        /*   OVRDBF     FILE(DISMST)  TOFILE(S02YSH/DISMSTX) SHARE(*YES) */
        /*   OVRDBF     FILE(DISDTL)  TOFILE(S02YSH/DISDTLX)             */
        /*   OVRDBF     FILE(INVMST)  TOFILE(S02YSH/INVMST9103)          */
        /*   OVRDBF     FILE(INVDTL)  TOFILE(S02YSH/INVDTL9103)          */
        /*   OVRDBF     FILE(TRNDTL)  TOFILE(S02YSH/TRNDTL9103)          */
        /*   OVRDBF     FILE(GENSEQ)  TOFILE(S02YSH/GENSEQ9103)          */
             OVRPRTF    FILE(ARE050T) TOFILE(ARE050T) PAGESIZE(*N +
                          132) CPI(10) HOLD(*YES) USRDTA('折讓開立')
/*0906A*/    OPNQRYF    FILE(DISMST)  OPTION(*ALL) QRYSLT('+
                        (DMCUNO *GE "' || &C#CUNS || '") *AND +
                        (DMCUNO *LE "' || &C#CUNE || '") *AND +
                        (YYMM *EQ "' || &P#YYMM || '") *AND +
                        (CONT *EQ "' || &P#CONT || '") *AND +
                        (DMAREA *GE "' || &C#ARES || '") *AND +
                        (DMAREA *LE "' || &C#AREE || '") *AND +
                        (DMCOD2 *NE " ") *AND +
                        (DMCOD3 *EQ " ")') +
                        MAPFLD((YYMM  DMYYMM *CHAR 6) +
                               (CONT DMCONT  *CHAR 3)) +
                        KEYFLD((DMCUNO) (DMORNO))

  /*      CPYFRMQRYF    FROMOPNID(DISMST) TOFILE(S00WCJ/MST) +
              MBROPT(*REPLACE)  CRTFILE(*YES)   */

             CALL       PGM(ARE050R2)
             CLOF       OPNID(DISMST)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
