     /****************************************************************/
     /*                                                              */
     /*            *****   PROGRAM INTRODUCTION   *****              */
     /*                                                              */
     /*            1.PROGRAM-ID    ARE006P1                          */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            3.AUTHOR        S00WCJ                            */
     /*            4.FUNCTION     折讓退回維護作業                 */
     /*                           (取消確認回寫台北ARDSDT)         */
     /*            5.DATE-WRITTEN  107/11/27 2018AR00030             */
     /*                                                              */
     /****************************************************************/
             PGM        PARM(&W#TXNO &W#POMD)

             DCL        VAR(&W#TXNO)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&W#POMD)  TYPE(*CHAR) LEN(3)

    /*讀取台北ARDSDT*/

             DLTF       FILE(QTEMP/TPDDM)
             MONMSG     MSGID(CPF0000)

             CRTDUPOBJ  OBJ(TPDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                        TOLIB(QTEMP)  NEWOBJ(TPDDM)

          IF         COND(&W#POMD *EQ 'INE') THEN(DO)
             CHGDDMF    FILE(QTEMP/TPDDM) RMTFILE(*NONSTD +
                        'DALIB/INETRN') LVLCHK(*NO)
             OVRDBF     FILE(INETRN)  TOFILE(QTEMP/TPDDM)
          ENDDO

          IF         COND(&W#POMD *EQ 'ARD') THEN(DO)
             CHGDDMF    FILE(QTEMP/TPDDM) RMTFILE(*NONSTD +
                        'DALIB/ARDSDTL4') LVLCHK(*NO)
             OVRDBF     FILE(ARDSDTL4)  TOFILE(QTEMP/TPDDM)
          ENDDO

             CALL       PGM(ARE006R1)   PARM(&W#TXNO &W#POMD)
             DLTOVR     FILE(*ALL)
             ENDPGM
