             PGM
             DCL        VAR(&TDATE)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DEPART) TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(DALIB/ACCTLDTAT (7 6)) RTNVAR(&TDATE)
             RTVDTAARA  DTAARA(*LDA (1001 1)) RTNVAR(&DEPART)
             IF COND(&DEPART *EQ 'B') THEN(CALL ARE008RS)
             ADDLIBLE   ACLIB
             MONMSG     CPF0000
             CALL  PGM(ARE008R)  PARM(&TDATE)
             ENDPGM
