     /****************************************************************/
     /*                                                              */
     /*            *****   PROGRAM INTRODUCTION   *****              */
     /*                                                              */
     /*            1.PROGRAM-ID    ARE006P                           */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            3.AUTHOR        S00WCJ                            */
     /*            4.FUNCTION     折讓退回維護作業                 */
     /*                           (讀取台北折讓單發票資料)         */
     /*            5.DATE-WRITTEN  107/11/27 2018AR00030             */
     /*                                                              */
     /****************************************************************/
             PGM
             DCL        VAR(&W#RNAME) TYPE(*CHAR) LEN(20)
             DCL        VAR(&P#LOC)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&P#IVNO)  TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&P#LOC)

             IF         COND(&P#LOC *EQ 'U') THEN(DO)
               CHGVAR       VAR(&W#RNAME) VALUE('P02')
               DLTF       FILE(QTEMP/INVDTPL3)
               MONMSG     MSGID(CPF0000)
               CRTDDMF    FILE(QTEMP/INVDTPL3) RMTFILE(DALIB/INVDTLL3)  +
                          RMTLOCNAME(&W#RNAME *SNA)

               OVRDBF     FILE(INVDTPL3) TOFILE(QTEMP/INVDTPL3) +
                             SECURE(*YES)
             ENDDO

             CALL       PGM(ARE006R)
             DLTOVR     FILE(*ALL)
             ENDPGM
