     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARM999P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     應收授信系統－維護人員主畫面           */
     /*     5.DATE-WRITTEN  88/03/03                                */
     /*                                                             */
     /*  說明：本畫面的程式為應收授信系統維護人員專用。           */
     /*        程式皆為維護資料完整及系統正常運作之各種情形。     */
     /*                                                             */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&W#USER)  TYPE(*CHAR)  LEN(10)
             DCLF       FILE(ARM999S)

             RTVNETA    SYSNAME(&S#SYSN)
             CHGDTAARA  DTAARA(*LDA (851 8)) VALUE(&S#SYSN)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&S#COMP)
             RTVDTAARA  DTAARA(*LDA (1001 10)) RTNVAR(&W#USER)
             RTVDTAARA  DTAARA(*LDA (1011 10)) RTNVAR(&S#DEVI)

 INPUT:
             SNDRCVF
             CHGVAR     VAR(&S#MSG1) VALUE(' ')

             IF         COND(&IN03 *EQ '1' *OR &IN12 *EQ '1') +
                        THEN(RETURN)

             IF         COND(&S#ITEM *EQ 1) THEN(WRKMSG QPGMR)
             IF         COND(&S#ITEM *EQ 2) THEN(WRKOUTQ QEZJOBLOG)
             IF         COND(&S#ITEM *EQ 3) THEN(CALL ARP055P)
             IF         COND(&S#ITEM *EQ 4) THEN(CALL CCP304P)
             IF         COND(&S#ITEM *EQ 5) THEN(CALL ARP054P)
             IF         COND(&S#ITEM *EQ 6) THEN(CALL ARE035R)
             IF         COND(&S#ITEM *EQ 7) THEN(CALL ARP068P)

             IF         COND(&S#ITEM *EQ 8) THEN(CALL ARP052P)

             IF         COND(&S#ITEM *EQ 70) THEN(CALL PRTMENU)
             IF         COND(&S#ITEM *EQ 80) THEN(RETURN)
             IF         COND(&S#ITEM *EQ 90) THEN(SIGNOFF)

             GOTO       INPUT
             ENDPGM
