             PGM
             DCLF       FILE(ARMNU10S)
             RTVJOBA    JOB(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
 RDSPLY:     SNDRCVF    RCDFMT(AR00F1)
             IF         COND(&OPTION *EQ 1) THEN(CALL PGM(ARMNU11))
             IF         COND(&OPTION *EQ 2) THEN(CALL PGM(ARMNU12))
             IF         COND(&OPTION *EQ 3) THEN(CALL PGM(ARMNU13))
             IF         COND(&OPTION *EQ 4) THEN(CALL PGM(ARMNU14))
             IF         COND(&OPTION *EQ 5) THEN(CALL PGM(ARMNU15))
             IF         COND(&OPTION *EQ 6) THEN(CALL PGM(ARMNU16))
             IF         COND(&OPTION *EQ 70) THEN(CALL PGM(PRTMENU))
             IF         COND(&OPTION *EQ 80) THEN(RETURN)
             IF         COND(&OPTION *EQ 90) THEN(SIGNOFF)
             GOTO       CMDLBL(RDSPLY)
ENDCLPGM:    ENDPGM
