             PGM
             DCLF       FILE(ARMNU00S)
             RTVJOBA    JOB(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
 RDSPLY:     SNDRCVF    RCDFMT(AR00F1)
             IF         COND(&OPTION *EQ 1) THEN(CALL PGM(ARMNU01))
             IF         COND(&OPTION *EQ 2) THEN(CALL PGM(ARMNU02))
             IF         COND(&OPTION *EQ 3) THEN(CALL PGM(ARMNU03))
             IF         COND(&OPTION *EQ 4) THEN(CALL PGM(ARMNU04))
             IF         COND(&OPTION *EQ 5) THEN(CALL PGM(ARMNU05))
             IF         COND(&OPTION *EQ 6) THEN(CALL PGM(ARMNU06))
             IF         COND(&OPTION *EQ 70) THEN(CALL PGM(PRTMENU))
             IF         COND(&OPTION *EQ 80) THEN(RETURN)
             IF         COND(&OPTION *EQ 90) THEN(SIGNOFF)
             GOTO       CMDLBL(RDSPLY)
ENDCLPGM:    ENDPGM
