      /*  　繳款沖銷檔RCADTL處理程式--> ARLIB/RCADTL-T&K   */
             PGM        PARM(&P#AREA)

             DCL        VAR(&P#AREA)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&COUNTER) TYPE(*DEC)  LEN(1 0)
             CHGVAR     VAR(&COUNTER) VALUE(0)


             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('RCADTL' || &P#AREA)
             OVRDBF     FILE(RCADTLP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(RCADTL) TOFILE(DALIB/RCADTL) SHARE(*YES)
             OPNQRYF    FILE(RCADTL) OPTION(*ALL) +
                        QRYSLT('RAFLAG *NE " "')
             CALL       PGM(ARLIB/ARP025RA)
             CLOF       OPNID(RCADTL)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
