      /*  　發票明細檔INVDTL拉出註記異動記錄（依各廠） */

             PGM        PARM(&P#AREA)
             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('INVDTL' || &P#AREA)
             OVRDBF     FILE(INVDTLP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(INVDTL) TOFILE(DALIB/INVDTL) SHARE(*YES)
             OPNQRYF    FILE((DALIB/INVDTL)) OPTION(*ALL) +
                        QRYSLT('IVFLAG *NE " "')
             OVRPRTF    FILE(QPRINT) TOFILE(QPRINT) PAGESIZE(*N 198) +
                        CPI(15)
             CALL       PGM(ARLIB/ARP022RA)
             CLOF       OPNID(INVDTL)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
