     /****************************************************************/
     /**                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                 */
     /*                                                              */
     /*            1.PROGRAM-ID    ARP090P2                          */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            3.AUTHOR        S02YSH                            */
     /*            4.FUNCTION     兌現預估調整處理(ARR090F)        */
     /*            5.DATE-WRITTEN  91/03/08                          */
     /*            6.DATE-MODIFY                                     */
     /*                                                              */
     /****************************************************************/
             PGM        (&P#PROD  &P#SLC1)
             DCL        VAR(&P#PROD)  TYPE(*CHAR)  LEN(1) /*產品別*/
             DCL        VAR(&P#SLC1)  TYPE(*CHAR)  LEN(1) /*調整別*/

             OVRDBF     FILE(ARINRV)  TOFILE(ARINRV) SHARE(*YES)
       /*鋼筋*/
             IF         COND(&P#PROD *EQ '2') THEN(DO)
                 IF        COND(&P#SLC1 *EQ '1') THEN(DO) /*客戶別*/
                     OPNQRYF  FILE(ARINRV) QRYSLT('+
                              (ORNO *NE "H")') +
                              KEYFLD((ARCUNO) (ARIVNO)) +
                              MAPFLD((ORNO '%SST(ARORNO 1 1)' *CHAR 1))
                     CALL     PGM(ARP090R2A)
                 ENDDO
                 ELSE (DO) /*業務別*/
                     OPNQRYF  FILE(ARINRV) QRYSLT('+
                              (ORNO *NE "H")') +
                              KEYFLD((ARSAL2) (ARIVNO)) +
                              MAPFLD((ORNO '%SST(ARORNO 1 1)' *CHAR 1))
                     CALL     PGM(ARP090R2B)
                 ENDDO
             ENDDO
       /*型鋼鋼板*/
             IF         COND(&P#PROD *EQ '3') THEN(DO)
                 IF        COND(&P#SLC1 *EQ '1') THEN(DO) /*客戶別*/
                     OPNQRYF  FILE(ARINRV) QRYSLT('+
                              (ORNO *EQ "H")') +
                              KEYFLD((ARCUNO) (ARIVNO)) +
                              MAPFLD((ORNO '%SST(ARORNO 1 1)' *CHAR 1))
                     CALL     PGM(ARP090R2A)
                 ENDDO
                 ELSE (DO) /*業務別*/
                     OPNQRYF  FILE(ARINRV) QRYSLT('+
                              (ORNO *EQ "H")') +
                              KEYFLD((ARSAL2) (ARIVNO)) +
                              MAPFLD((ORNO '%SST(ARORNO 1 1)' *CHAR 1))
                     CALL     PGM(ARP090R2B)
                 ENDDO
             ENDDO

       /*全部*/
             IF         COND(&P#PROD *EQ '4') THEN(DO)
                 IF        COND(&P#SLC1 *EQ '1') THEN(DO) /*客戶別*/
                     OPNQRYF  FILE(ARINRV) +
                              KEYFLD((ARCUNO) (ARIVNO))
                     CALL     PGM(ARP090R2A)
                 ENDDO
                 ELSE (DO) /*業務別*/
                     OPNQRYF  FILE(ARINRV) +
                              KEYFLD((ARSAL2) (ARIVNO))
                     CALL     PGM(ARP090R2B)
                 ENDDO
             ENDDO

             CLOF       OPNID(ARINRV)
             DLTOVR     FILE(*ALL)

ENDCLPGM:    ENDPGM
