             PGM
             DCL        VAR(&P#IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P#IN12) TYPE(*CHAR) LEN(1)


  START:     CALL       PGM(ARP083RS) PARM(&P#IN03)
             IF         COND(&P#IN03 *EQ '1') THEN(RETURN)

             OVRDBF     FILE(ARINVMX)   TOFILE(DALIB/ARINVMX)
             OVRDBF     FILE(ARINVML2)  TOFILE(DALIB/ARINVML2)
             OVRDBF     FILE(ARINVM)    TOFILE(DALIB/ARINVM)
             CALL       PGM(ARP083R)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (322 1)) RTNVAR(&P#IN12)
             IF         COND(&P#IN12 *EQ '1')  THEN(GOTO CMDLBL(START))

          ENDPGM
