             PGM
             DCL        VAR(&INT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)    TYPE(*CHAR) LEN(10)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             DLTF     FILE(QTEMP/KSDDMX)
             MONMSG   CPF0000
             CRTDUPOBJ  OBJ(KSDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(KSDDMX)
             CHGDDMF    FILE(QTEMP/KSDDMX) RMTFILE(DALIB/ARCUDT)
             CPYF       FROMFILE(DALIB/ARCUDT) TOFILE(QTEMP/KSDDMX) +
                          MBROPT(*REPLACE) CRTFILE(*NO) FMTOPT(*NOCHK)
             MONMSG   CPF0000

             DLTF     FILE(QTEMP/TYDDMX)
             MONMSG   CPF0000
             CRTDUPOBJ  OBJ(TYDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(TYDDMX)
             CHGDDMF    FILE(QTEMP/TYDDMX) RMTFILE(DALIB/ARCUDT)
             CPYF       FROMFILE(DALIB/ARCUDT) TOFILE(QTEMP/TYDDMX) +
                          MBROPT(*REPLACE) CRTFILE(*NO) FMTOPT(*NOCHK)
             MONMSG   CPF0000

             DLTF     FILE(QTEMP/MLDDMX)
             MONMSG   CPF0000
             CRTDUPOBJ  OBJ(MLDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(MLDDMX)
             CHGDDMF    FILE(QTEMP/MLDDMX) RMTFILE(DALIB/ARCUDT)
             CPYF       FROMFILE(DALIB/ARCUDT) TOFILE(QTEMP/MLDDMX) +
                          MBROPT(*REPLACE) CRTFILE(*NO) FMTOPT(*NOCHK)
             MONMSG   CPF0000

ENDPGM
