      /*  　繳款明細檔RCVDTL處理程式--> ARLIB/RCVDTL-T&K   */
             PGM        PARM(&P#AREA)

             DCL        VAR(&P#AREA)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&COUNTER) TYPE(*DEC)  LEN(1 0)
             CHGVAR     VAR(&COUNTER) VALUE(0)


             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('RCVDTL' || &P#AREA)
             OVRDBF     FILE(RCVDTLP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(RCVDTL) TOFILE(DALIB/RCVDTL) SHARE(*YES)
             OPNQRYF    FILE(RCVDTL) OPTION(*ALL) +
                        QRYSLT('RVFLAG *NE " "')
             CALL       PGM(ARLIB/ARP024RA)
             CLOF       OPNID(RCVDTL)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
