     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP075P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02YSH                                  */
     /*     4.FUNCTION     訂單已開立預收發票檢核程式             */
     /*     5.DATE-WRITTEN  90/01/04                                */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&P#CTNO &P#CODE)

             DCL        VAR(&P#CTNO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&P#CODE) TYPE(*CHAR) LEN(1)

             OVRDBF     FILE(INVMST) TOFILE(DALIB/INVMST) SHARE(*YES)
             OPNQRYF    FILE(INVMST) QRYSLT(' +
                        (INORNO *EQ "' || &P#CTNO || '") *AND +
                        (INTYPE *EQ "2") *AND +
                        (INDECD *NE "D")')

             CALL       PGM(ARP075R)
             CLOF       OPNID(INVMST)
             DLTOVR     *ALL

             RTVDTAARA  DTAARA(*LDA (301 1)) RTNVAR(&P#CODE)

             ENDPGM
