      /*  　銷貨明細檔TRNDTL處理程式--> ARLIB/TRNDTL-T&K   */
             PGM
             DCL        VAR(&COUNTER) TYPE(*DEC)  LEN(1 0)
             CHGVAR     VAR(&COUNTER) VALUE(0)
             GOTO       PASS
 LOOP:       ALCOBJ     OBJ((DALIB/TRNDTL *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&COUNTER) VALUE(&COUNTER  + 1)
             IF   COND(&COUNTER *GE 9) THEN(GOTO CMDLBL(ENDCLPGM))
             DLYJOB     DLY(60)
             GOTO       CMDLBL(LOOP)
             ENDDO
        /*   DTALIB/TRNDTL --> ARLIB/TRNDTL-T&K............... */
 PASS:       CHGDTAARA  DTAARA(*LDA (21 1)) VALUE('T')
             OVRDBF     FILE(TRNDTLP) TOFILE(ARLIB/TRNDTLP)
             OVRDBF     FILE(TRNDTL) TOFILE(DALIB/TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) OPTION(*ALL) +
                          QRYSLT('TXFLAG *NE " "')
             CALL       PGM(ARLIB/ARP023RA)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)
     /*      DLCOBJ     OBJ((DALIB/TRNDTL *FILE *EXCL))  */
 ENDCLPGM:   ENDPGM
