             PGM
             DCL        VAR(&TDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDA) TYPE(*CHAR) LEN(6)
             CHGVAR     VAR(&YMDA) VALUE('820514')
             RTVDTAARA  DTAARA(DALIB/ACCTLDTAT (7 6)) RTNVAR(&TDATE)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&YMDA)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&TDATE)
             OVRDBF     FILE(HSVOUR) TOFILE(DALIB/HSVOUR) SHARE(*YES)
             OPNQRYF    FILE((HSVOUR)) OPTION(*ALL) QRYSLT('((S4TRCD +
                          *EQ "11") *OR (S4TRCD *EQ "1E") *OR +
                          (S4TRCD *EQ "1G")) *AND S4CDE2 *EQ " " +
                          *AND S4FLAG *NE "D" *AND S4ENTD *LE ' || +
                          &YMDA) KEYFLD((S4AREA) (S4VNO1) (S4VNO2) +
                          (S4SQIT) (S4ORNO) (S4NAME))
             OVRDBF     FILE(SAMAST) TOFILE(SAMAST)
             OVRPRTF    FILE(PRINT) TOFILE(QPRINT) HOLD(*NO) +
                          SAVE(*NO) USRDTA('Ｈ收過錯')
             OVRPRTF    FILE(PRINT1) TOFILE(QPRINT) HOLD(*NO) +
                          SAVE(*NO) USRDTA('Ｈ收過入')
             OVRDBF     FILE(TRNDTL) TOFILE(DALIB/TRNDTLB)
             CALL       PGM(ARLIB/ARP001RB)
             CLOF       OPNID(HSVOUR)
             DLTOVR     FILE(*ALL)
             ENDPGM
