        /*  ¥x¥_  DALIB/ARSTAT--> ARLIB/ARSTATP  (TEMP-FILE) */
             PGM
             DCL        VAR(&COUNTER) TYPE(*DEC)  LEN(1 0)
             CHGVAR     VAR(&COUNTER) VALUE(0)


        /*   DTALIB/RCADTL --> ARLIB/RCADTL-T&K............... */
             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE('P')
             OVRDBF     FILE(ARSTAT) TOFILE(ARSTAT) SHARE(*YES)
             OVRDBF     FILE(ARSTATP) TOFILE(ARLIB/ARSTATP)
             OPNQRYF    FILE((ARSTAT)) OPTION(*ALL) +
                          QRYSLT('ARFLAG *NE " "')
             OVRPRTF    FILE(QPRINT) TOFILE(QPRINT) PAGESIZE(*N 198) +
                          CPI(15)
             CALL       PGM(ARLIB/ARP026RA)
             MONMSG     MSGID(CPF0000)
             CLOF       OPNID(ARSTAT)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
