     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP020PH                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     應收系統主要檔案即時上傳作業（高雄）   */
     /*     5.DATE-WRITTEN  87/02/24                                */
     /*     6.UPDATE  DATE  99/05/05 2010AR476 S00WCJ (9905A)       */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&INT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)

             RTVJOBA    TYPE(&INT) USER(&USER)
             IF         COND(&INT *EQ '1') THEN(DO)
             SBMJOB     JOB(ARP020PK) JOBD(ARJOBD) +
                        RQSDTA('CALL ARP020PK') LOG(0 4 *SECLVL) +
                        LOGCLPGM(*YES)
    /*9905A  START */
        /*   CHGDTAARA  DTAARA(*LDA (801 70)) +
                        VALUE('即時上傳高雄發票等資料已匯入排程中。') */
             CHGDTAARA  DTAARA(*LDA (601 70)) +
                        VALUE('即時上傳高雄發票等資料已匯入排程中。')
    /*9905A  END */
             RETURN
             ENDDO

  BATCH:
             CALL       PGM(ARP021PK)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(ARP022PK)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(ARP023PK)
             MONMSG     MSGID(CPF0000)

             SNDMSG     MSG('即時上傳高雄銷貨發票相關資料執行完畢') +
                        TOUSR(&USER)

             ENDPGM
