             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&YMD)  TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&YMDA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AREA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARP001RS) PARM(&IN03 &YMD &AREA)
             IF         COND(&IN03 *EQ '1') THEN(GOTO ENDCLPGM)
             CHGVAR     VAR(&YMDA)    VALUE(&YMD)
             CHGDTAARA  DTAARA(*LDA (1 8)) VALUE(&YMDA)
             CHGDTAARA  DTAARA(*LDA (9 1)) VALUE(&AREA)
             SBMJOB     CMD(CALL PGM(ARP001P)) JOB(ARP001P) +
                          JOBD(ARJOBD) OUTQ(&OUTQ)
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 8)) RTNVAR(&YMDA)
             RTVDTAARA  DTAARA(*LDA (9 1)) RTNVAR(&AREA)
             OVRDBF     FILE(SAVOUR) TOFILE(SAVOUR) SHARE(*YES)
             OPNQRYF    FILE((SAVOUR)) OPTION(*ALL) QRYSLT('   +
                             ((S4TRCD *EQ "11")                +
                          *OR (S4TRCD *EQ "1E"))               +
                          *AND S4CDE2 *EQ " "                  +
                          *AND S4FLAG *NE "D"                  +
                          *AND S4DATE *LE ' || &YMDA)          +
                          KEYFLD((S4VREA) (S4VRNO) (S4VRTM)    +
                          (S4ORNO) (S4PDNM))
             OVRDBF     FILE(SALMAST) TOFILE(SAMAST)
             OVRPRTF    FILE(PRINT) TOFILE(QPRINT) OUTQ(&OUTQ)
             OVRPRTF    FILE(PRINT1) TOFILE(QPRINT) OUTQ(&OUTQ)
             CALL       PGM(ARLIB/ARP001R)
             CLOF       OPNID(SAVOUR)
             DLTOVR     FILE(*ALL)
 ENDCLPGM:   ENDPGM
