     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP056P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     隨車發票開立字軌溢位警告使用者         */
     /*     5.DATE-WRITTEN  87/01/10                                */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&INT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&WHOAMI) TYPE(*CHAR) LEN(10)


             RTVJOBA    TYPE(&INT) USER(&WHOAMI)
             IF         COND(&INT *EQ '1')  THEN(RETURN)

             SNDMSG     MSG('進行發票開立作業時發生字軌已用完之情形+
                            ，請查核!!!!') +
                        TOUSR(&WHOAMI)
             ENDPGM
