      /*  　預收貨款CPRBAL處理程式--> ARLIB/CPRBAL-T&K     */
             PGM
        /*   DTALIB/CPRBAL --> ARLIB/BALF-T&K............... */
 PASS:
             OVRDBF     FILE(BALFT) TOFILE(ARLIB/BALFT)
             OVRDBF     FILE(CPRBAL) TOFILE(DALIB/CPRBAL)
             CALL       PGM(ARLIB/ARP027RB)
             CLRPFM     ARLIB/BALFT
             DLTOVR     FILE(*ALL)
 ENDCLPGM:   ENDPGM
