             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&D#CONT) TYPE(*CHAR) LEN(4)
             DCLF       FILE(ARP087SA)

             RTVJOBA    TYPE(&INT)
             RTVDTAARA  DTAARA(*LDA (1001 10)) RTNVAR(&S#USER)
             RTVDTAARA  DTAARA(*LDA (1011 10)) RTNVAR(&S#DEVI)


 START:      SNDRCVF    RCDFMT(AR087F1)
             IF         COND((&IN03 *EQ '1') *OR (&IN12 *EQ '1')) +
                        THEN(RETURN)

             OVRDBF     FILE(ARCVMS) TOFILE(DALIB/ARCVDT) SHARE(*YES)
             OPNQRYF    FILE(ARCVMS) OPTION(*ALL) QRYSLT('+
                        (ASBIH1 *EQ "' || &S#BHID ||'")')
             CALL       PGM(ARP087RA)
             CLOF       OPNID(ARCVMS)
             DLTOVR     FILE(*ALL)
             RTVDTAARA  DTAARA(*LDA (301 4)) RTNVAR(&D#CONT)
             CHGVAR     VAR(&S#ERR) VALUE(+
                        '批號' || &S#BHID || ',+
                         共清除' || &D#CONT || '筆, +
                         請修正後重新下載!')
             GOTO       CMDLBL(START)
  END:    ENDPGM
