     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP060P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     移至廠區處理作業                       */
     /*     5.DATE-WRITTEN  87/06/12                                */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&INT)     TYPE(*CHAR)  LEN(1)
             DCL        VAR(&OUTQ)    TYPE(*CHAR)  LEN(10)
             DCLF       FILE(ARP060S)

             RTVDTAARA  DTAARA(*LDA ( 951 35)) RTNVAR(&S#COMP)
             RTVDTAARA  DTAARA(*LDA (1011 10)) RTNVAR(&S#DEVI)
 INPUT:
             SNDRCVF    RCDFMT(AR060F1)
             IF         COND(&IN03 *EQ '1' *OR &IN12 *EQ '1') THEN(+
                        RETURN)

             IF         COND(&S#SELT *EQ 'T') THEN(T01)

             IF         COND(&S#SELT *EQ 'H') THEN(ML400)

             IF         COND(&S#SELT *EQ 'K') THEN(KS400)

             GOTO       INPUT
             ENDPGM
