     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP069PA                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     銷貨帳款每日應收統計結論處理－廠區     */
     /*     5.DATE-WRITTEN  88/07/29                                */
     /*                                                             */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&DATA)

             DCL        VAR(&DATA)    TYPE(*CHAR) LEN(28)

             ADDLIBLE   ARLIB
             MONMSG     CPF0000

             ADDLIBLE   DALIB
             MONMSG     CPF0000

             CALL       PGM(ARP069R)

      /*     RGZPFM     FILE(DALIB/ARSTRM)   */
      /*     MONMSG     CPF0000              */

             CHGDTAARA  DTAARA(ARLIB/ARXCTLDTA) VALUE(&DATA)


             ENDPGM
