     /****************************************************************/
     /**                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                 */
     /*                                                              */
     /*            1.PROGRAM-ID    ARP090P2                          */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            3.AUTHOR        S02YSH                            */
     /*            4.FUNCTION     兌現預估調整處理(ARR090F)        */
     /*            5.DATE-WRITTEN  91/03/08                          */
     /*            6.DATE-MODIFY                                     */
     /*                                                              */
     /****************************************************************/
             PGM        (&P#DATS  &P#DATE)
             DCL        VAR(&P#DATS)  TYPE(*CHAR)  LEN(6)
             DCL        VAR(&P#DATE)  TYPE(*CHAR)  LEN(6)

             CHGDTAARA  DTAARA(*LDA (450 6)) VALUE(&P#DATS)
             CHGDTAARA  DTAARA(*LDA (456 6)) VALUE(&P#DATE)

             OVRDBF     FILE(TRNDTL)   TOFILE(DALIB/TRNDTL) SHARE(*YES)
             OVRDBF     FILE(HSCONT)   TOFILE(DALIB/HSCONT)
             OVRDBF     FILE(ARP090X)  TOFILE(ARP090X)
             OPNQRYF    FILE(TRNDTL) QRYSLT('+
                            (TXCODE *EQ "SA04") *AND +
                            (TXIVNO *EQ "          ")') +
                        KEYFLD((TXDATE) (TXNO))
             CALL       PGM(ARP090R3A)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)

             OVRDBF     FILE(INVMST)   TOFILE(DALIB/INVMST) SHARE(*YES)
             OVRDBF     FILE(HSCONT)   TOFILE(DALIB/HSCONT)
             OVRDBF     FILE(ARP090X)  TOFILE(ARP090X)
             OPNQRYF    FILE(INVMST) QRYSLT('+
                            (INNBAL *NE 0) *AND +
                            (INDECD *NE "D")') +
                        KEYFLD((ININDT) (INNO))
             CALL       PGM(ARP090R3B)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)

ENDCLPGM:    ENDPGM
