     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP057P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     外銷發票開立作業（重開上月最後一日）   */
     /*     5.DATE-WRITTEN  87/03/04                                */
     /*     6.UPDATE  DATE  99/08/30  2010AR517  S00WCJ (9908A)     */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&IN03)  TYPE(*LGL)  LEN(1)
    /*9908A  DCL        VAR(&YMDA)  TYPE(*CHAR) LEN(6)   */
    /*9908A*/DCL        VAR(&YMDA)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&AREA)  TYPE(*CHAR) LEN(1)
    /*9908A  DCL        VAR(&YMD)   TYPE(*DEC)  LEN(6 0)  */
    /*9908A*/DCL        VAR(&YMD)   TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&OUTQ)  TYPE(*CHAR) LEN(10)

             CALL       PGM(ARP057RS) PARM(&IN03 &YMD &AREA)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             CHGVAR     VAR(&YMDA)    VALUE(&YMD)
    /*9908A  CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&YMDA)  */
    /*9908A*/CHGDTAARA  DTAARA(*LDA (11 8)) VALUE(&YMDA)
             CHGDTAARA  DTAARA(*LDA (7 1)) VALUE(&AREA)
             RTVJOBA    OUTQ(&OUTQ)

             SBMJOB     CMD(CALL PGM(ARP004P)) JOB(ARP057P) +
                        JOBD(ARJOBD) OUTQ(&OUTQ)
             ENDPGM
