             PGM
             DCL        VAR(&INT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03)  TYPE(*LGL)  LEN(1)
             DCL        VAR(&YDATE) TYPE(*CHAR) LEN(8)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARP031RS) PARM(&IN03 &YDATE)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (5 8)) VALUE(&YDATE)
       /*    SBMJOB     JOB(ARP031P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARP031P') */
       /*    RETURN                              */
             ENDDO
             RTVDTAARA  DTAARA(*LDA (5 8))   RTNVAR(&YDATE)
             CALL       PGM(ARP031RC)
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             OPNQRYF    FILE((INVMST)) QRYSLT('               INNBAL +
                          *NE 0     *AND  INTYPE *NE "9"   *AND  +
                          INDECD *NE "D"') +
                          KEYFLD((INCUNO) (INORNO) (INNO))
             CALL       PGM(ARP031R)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
