      /*  　發票主檔INVMST拉出註記異動記錄（依各廠） */

             PGM        PARM(&P#AREA)
             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('INVMST' || &P#AREA)
             OVRDBF     FILE(INVMSTP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(INVMST) TOFILE(DALIB/INVMST) SHARE(*YES)
             OPNQRYF    FILE((INVMST)) OPTION(*ALL) +
                        QRYSLT('INFLAG *NE " "')
             OVRPRTF    FILE(QPRINT) TOFILE(QPRINT) PAGESIZE(*N 198) +
                        CPI(15)
             CALL       PGM(ARLIB/ARP021RA)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
