     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP020PN                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     應收系統主要檔案即時上傳作業（大業）   */
     /*     5.DATE-WRITTEN  112/04/12                               */
     /*     6.UPDATE  DATE                                          */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)

             RTVJOBA    TYPE(&INT) USER(&USER)
             IF         COND(&INT *EQ '1') THEN(DO)
             SBMJOB     JOB(ARP020PN) JOBD(ARJOBD) +
                        RQSDTA('CALL ARP020PN') LOG(0 4 *SECLVL) +
                        LOGCLPGM(*YES)
             CHGDTAARA  DTAARA(*LDA (601 70)) +
                        VALUE('即時上傳大業發票等資料已匯入排程中。')
             RETURN
             ENDDO

  BATCH:
             CALL       PGM(ARP021PN)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(ARP022PN)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(ARP023PN)
             MONMSG     MSGID(CPF0000)

             SNDMSG     MSG('即時上傳大業銷貨發票相關資料執行完畢') +
                        TOUSR(&USER)

             ENDPGM
