      /*  　銷貨明細檔TRNDTL拉出註記異動記錄（依各廠）*/

             PGM        PARM(&P#AREA)
             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('TRNDTL' || &P#AREA)
             OVRDBF     FILE(TRNDTLP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(TRNDTL) TOFILE(DALIB/TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) OPTION(*ALL) +
                        QRYSLT('TXFLAG *NE " "')
             CALL       PGM(ARLIB/ARP023RA)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
