             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WNO)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&WITEM) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&WITEMX) TYPE(*CHAR) LEN(2)
             DCL        VAR(&ARA2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
 START:
             CALL       PGM(ARP035RS) PARM(&IN03 &WNO &WITEM &ARA2)
             IF         COND(&IN03 *EQ '1') THEN(GOTO ENDCLPGM)
             ENDDO
        /*  建立　DDMF & DTAARA ............................ */
             DLTF       FILE(QTEMP/DDMP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&ARA2 *EQ 'T') THEN(DO)
             CRTDUPOBJ  OBJ(TYDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMP)
             ENDDO
             ELSE IF    COND(&ARA2 *EQ 'K') THEN(DO)
             CRTDUPOBJ  OBJ(KSDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMP)
             ENDDO
             ELSE IF    COND(&ARA2 *EQ 'H') THEN(DO)
             CRTDUPOBJ  OBJ(MLDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMP)
             ENDDO
        /*  抓各廠區  ARLIB/RCVDTL    ................ */
             CHGVAR     VAR(&WITEMX) VALUE(&WITEM)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&WNO)
             CHGDTAARA  DTAARA(*LDA (7 2)) VALUE(&WITEMX)
             CHGDDMF    FILE(QTEMP/DDMP) RMTFILE(DALIB/RCVDTL) +
                          LVLCHK(*NO)
             OVRDBF     FILE(RCVDW) TOFILE(QTEMP/DDMP)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(ARLIB/ARP035R)
             DLTOVR     FILE(*ALL)
             CALL       PGM(CCLIB/CCP030P)
                        GOTO START
 ENDCLPGM:   ENDPGM
