             PGM
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DATEX) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEY) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE) TYPE(*DEC) LEN(6)
             DCL        VAR(&AREA) TYPE(*CHAR) LEN(1)

             ADDLIBLE   DALIB
             MONMSG     MSGID(CPF0000)

             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             RTVSYSVAL  SYSVAL(QDATE) RTNVAR(&DATEX)
             RTVDTAARA  DTAARA(*LDA (1021 1))   RTNVAR(&AREA)

             CHGVAR     VAR(&AREA) VALUE('P')
             CHGVAR     VAR(&DATE) VALUE(&DATEX)
             CHGVAR     VAR(&DATEY) VALUE('840326')
             OVRDBF     FILE(RCVDTL) TOFILE(RCVDTL) SHARE(*YES)
             OPNQRYF    FILE((RCVDTL)) OPTION(*ALL) QRYSLT('(DUDT +
                          *LE "' || &DATEX || '" *AND DUDT *GT "' +
                          || &DATEY || '" *AND RVFLAG *NE "D" *AND +
                          RVACNO *EQ "1131" *AND RVNTCD *EQ " " +
                          *AND   RVAREA *EQ "' || &AREA || '"   +
                          *AND RVVNO2 *EQ "       " *AND RVNTNO *NE +
                          "          " )') KEYFLD((RVSBID) (RVSANO) +
                          (RVPBID)) MAPFLD((DATE RVDUDT *CHAR 8) +
                          (DUDT '%SST(DATE 3 6)' *CHAR 6))
             OVRPRTF    FILE(QPRINT1) TOFILE(QPRINT) PAGESIZE(*N +
                          198) CPI(15) OVRFLW(55) +
                          USRDTA('兌現明細') IGCDTA(*YES)
             OVRPRTF    FILE(QPRINT2) TOFILE(QPRINT) PAGESIZE(*N +
                          198) CPI(15) OVRFLW(55) +
                          USRDTA('未兌現表') IGCDTA(*YES)
             CALL       PGM(ARP034R)
             CLOF       OPNID(RCVDTL)
             DLTOVR     FILE(*ALL)

            /*        繳款兌現　　　　　　　　　*/

             OVRDBF     FILE(RCVDTZ) TOFILE(RCVDTL)
             OVRDBF     FILE(RCVDTL) TOFILE(RCVDTL) SHARE(*YES)
             OPNQRYF    FILE(RCVDTL) +
                        OPTION(*ALL) +
                        QRYSLT('%SST(RVRESV 12 1) *EQ "#" *AND +
                                RVNTCD *EQ "1"') +
                        KEYFLD(RVCUNO)
             CALL       PGM(ARP034R1)
             CLOF       OPNID(RCVDTL)
             DLTOVR     FILE(*ALL)
             ENDPGM
