        /******************************************************/
        /*                                                    */
        /*        >>   PROGRAM INTRODUCTION  <<               */
        /*        1.PROGRAM-ID     ARP110P1                   */
        /*        2.PROGRAM-TYPE   CLP                        */
        /*        3.AUTHOR         S00WCJ                     */
        /*        4.FUNCTION    銷折與銷退資料重新下載處理*/
        /*        5.DATE-WRITTEN   103/03/06                  */
        /*        6.DATE-MODIFY                               */
        /*                                                    */
        /******************************************************/
            PGM
            DCL        VAR(&C#COD1)   TYPE(*CHAR) LEN(1)
            DCL        VAR(&C#DAT1)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&C#DAT2)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&D#DAT1)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&D#DAT2)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&OUTQ)     TYPE(*CHAR) LEN(10)
            DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
            DCL        VAR(&DSPID)    TYPE(*CHAR) LEN(10)
            DCL        VAR(&S#USER)   TYPE(*CHAR) LEN(10)
            DCL        VAR(&P#IN03)   TYPE(*CHAR) LEN(1)

            RTVJOBA    JOB(&DSPID) USER(&S#USER) OUTQ(&OUTQ) +
                       TYPE(&TYPE)
            IF         COND(&TYPE *EQ '0') THEN(GOTO CMDLBL(BATCH))

            CALL       PGM(ARP110RS1) PARM(&P#IN03)
            IF         COND(&P#IN03 *EQ '1') THEN(RETURN)

      /*    SBMJOB     CMD(CALL PGM(ARP110P)) JOB(ARP110P) +
                       JOBD(ARJOBD)  */
   /*       SNDBRKMSG  MSG('<<資料下載已開始處理請稍待，......>>') +
                       TOMSGQ(%SST(*LDA 1011 10)) MSGTYPE(*INFO)  */
   /*       RETURN        */

 BATCH:
            RTVDTAARA  DTAARA(*LDA (300 1)) RTNVAR(&C#COD1)
            RTVDTAARA  DTAARA(*LDA (301 8)) RTNVAR(&C#DAT1)
            RTVDTAARA  DTAARA(*LDA (309 8)) RTNVAR(&C#DAT2)
            CHGVAR     VAR(&D#DAT1)  VALUE(&C#DAT1)
            CHGVAR     VAR(&D#DAT2)  VALUE(&C#DAT2)
            CHGVAR     VAR(&D#DAT1)  VALUE(&D#DAT1 + 19110000)
            CHGVAR     VAR(&D#DAT2)  VALUE(&D#DAT2 + 19110000)
            CHGVAR     VAR(&C#DAT1)  VALUE(&D#DAT1)
            CHGVAR     VAR(&C#DAT2)  VALUE(&D#DAT2)

     /* STEP 1 : 下載DISLOG檔內的銷貨資料 */

            IF         COND(&C#COD1  *NE ' ') THEN(DO)
            CLRPFM     ARDIDW
            OVRDBF     FILE(DISLOG) TOFILE(ARLIB/DISLOG) SHARE(*YES)
            OPNQRYF    FILE((DISLOG)) QRYSLT('         +
                       (DATE   *GE "' || &C#DAT1 || '")    *AND +
                       (DATE   *LE "' || &C#DAT2 || '")')       +
                       MAPFLD((DATE  ISINDT *CHAR 8))

   /*    CPYFRMQRYF    FROMOPNID(DISLOG) TOFILE(S00WCJ/ARDT) +
             MBROPT(*REPLACE)  CRTFILE(*YES)     */

            CALL       ARP110RA
            CLOF       OPNID(DISLOG)
            DLTOVR     *ALL
            ENDDO

            SNDBRKMSG  MSG('<< 資料下載以處理完成.........>>')  +
                       TOMSGQ(%SST(*LDA 1011 10)) MSGTYPE(*INFO)
            ENDPGM
