     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP138P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     INEDTL電子發票明細檔傳輸P-->廠區   */
     /*     5.DATE-WRITTEN  107/12/06 2018AR00031                   */
     /*     6.UPDATE  DATE                                          */
     /*                                                             */
     /*                                                             */
     /***************************************************************/

             PGM
             DCL        VAR(&COUNTER) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOC)  TYPE(*CHAR) LEN(1)

             CHGJOB     LOGCLPGM(*YES)

             MONMSG     MSGID(CPF0000)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
        IF   COND(&INT *EQ '0') THEN(GOTO CMDLBL(BATCH))
 START:
             CHGVAR     VAR(&LOC)     VALUE('P')
             CHGDTAARA  DTAARA(*LDA (5 1))  VALUE(&LOC)
             SBMJOB     JOB(ARP138P) JOBD(ARJOBD) JOBQ(QCTL) +
                           RQSDTA('CALL ARLIB/ARP138P')
             GOTO       CMDLBL(ENDCLPGM)
 BATCH:
             CHGVAR     VAR(&COUNTER) VALUE(0)
 LOOP:
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&COUNTER) VALUE(&COUNTER  + 1)
             IF   COND(&COUNTER *GE 5) THEN(GOTO CMDLBL(ENDCLPGM))
             DLYJOB     DLY(60)
             GOTO       CMDLBL(LOOP)
             ENDDO
        /*                                          */
             RTVDTAARA  DTAARA(*LDA (5 1))  RTNVAR(&LOC)
        /*  台北  DALIB/INEDTL--> DALIB/INEDTLT    */
     /*      OVRDBF     FILE(INEDTL) TOFILE(S00WCJ/INEDTL) SHARE(*YES) */
             OVRDBF     FILE(INEDTL) TOFILE(DALIB/INEDTL) SHARE(*YES)
             OVRDBF     FILE(INEDTLT) TOFILE(ARLIB/INEDTLT)
     /*      OVRDBF     FILE(INEDTLT) TOFILE(S00WCJ/INEDTLT)  */

             OPNQRYF    FILE(INEDTL) OPTION(*ALL) +
                          QRYSLT('(EDFLAG *NE " " *AND +
                                   EDSTCL *NE " ")')

             CALL       PGM(ARLIB/ARP138RA)
             CLOF       OPNID(INEDTL)
             DLTOVR     FILE(*ALL)

             DLTF       FILE(QTEMP/DDMK)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(KSDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMK)
             DLTF       FILE(QTEMP/DDMU)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(U01DDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMU)
             DLTF       FILE(QTEMP/DDMH)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(MLDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMH)

        /*  台北　送廠區資料*/

 /*         台北 ARLIB/INEDTLT 送　新桃 DALIB/INEDTL      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'U')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('U')
      /*     CHGDDMF    FILE(QTEMP/DDMU) RMTFILE(S00WCJ/INEDTL) +
                          LVLCHK(*NO)    */
             CHGDDMF    FILE(QTEMP/DDMU) RMTFILE(DALIB/INEDTL) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INEDTLT) TOFILE(ARLIB/INEDTLT) SHARE(*YES)
        /*   OVRDBF     FILE(INEDTLT) TOFILE(S00WCJ/INEDTLT) SHARE(*YES) */

             OPNQRYF    FILE(INEDTLT) OPTION(*ALL) +
                          QRYSLT('EDAREA *EQ "U"') +
                                KEYFLD((EDNO) (EDSENR))

             OVRDBF     FILE(INEDTL) TOFILE(QTEMP/DDMU)
             CALL       PGM(ARLIB/ARP138RC)
             CLOF       OPNID(INEDTLT)
             DLTOVR     FILE(*ALL)
             ENDDO

        /*  台北 ARLIB/INEDTLT 送　苗栗 DALIB/INEDTL      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'H')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('H')
    /*       CHGDDMF    FILE(QTEMP/DDMH) RMTFILE(S00WCJ/INEDTL) +
                          LVLCHK(*NO)     */
             CHGDDMF    FILE(QTEMP/DDMH) RMTFILE(DALIB/INEDTL) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INEDTLT) TOFILE(ARLIB/INEDTLT) SHARE(*YES)
    /*       OVRDBF     FILE(INEDTLT) TOFILE(S00WCJ/INEDTLT) SHARE(*YES) */
             OPNQRYF    FILE(INEDTLT) OPTION(*ALL) +
                          QRYSLT('EDAREA *EQ "H"')       +
                                KEYFLD((EDNO) (EDSENR))
             OVRDBF     FILE(INEDTL) TOFILE(QTEMP/DDMH)
             CALL       PGM(ARLIB/ARP138RC)
             CLOF       OPNID(INEDTLT)
             DLTOVR     FILE(*ALL)
             ENDDO


        /*  台北 ARLIB/INEDTLT 送　高雄 DALIB/INEDTL      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'K')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('K')
    /*       CHGDDMF    FILE(QTEMP/DDMK) RMTFILE(S00WCJ/INEDTL) +
                          LVLCHK(*NO)   */
             CHGDDMF    FILE(QTEMP/DDMK) RMTFILE(DALIB/INEDTL) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INEDTLT) TOFILE(ARLIB/INEDTLT) SHARE(*YES)
    /*       OVRDBF     FILE(INEDTLT) TOFILE(S00WCJ/INEDTLT) SHARE(*YES) */
             OPNQRYF    FILE(INEDTLT) OPTION(*ALL) +
                          QRYSLT('EDAREA *EQ "K"') +
                                KEYFLD((EDNO) (EDSENR))
             OVRDBF     FILE(INEDTL) TOFILE(QTEMP/DDMK)
             CALL       PGM(ARLIB/ARP138RC)
             CLOF       OPNID(INEDTLT)
             DLTOVR     FILE(*ALL)
             ENDDO

 ENDCLPGM:   ENDPGM
