     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP133PA                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     INEMST電子發票主檔介面檔傳輸         */
     /*     5.DATE-WRITTEN  107/07/02 2018AR1162                    */
     /*     6.UPDATE  DATE                                          */
     /*                                                             */
     /*                                                             */
     /***************************************************************/

             PGM        PARM(&P#AREA)
             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('INEMST' || &P#AREA)
             OVRDBF     FILE(INEMSTP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(INEMST) TOFILE(DALIB/INEMST) SHARE(*YES)
             OPNQRYF    FILE((INEMST)) OPTION(*ALL) +
                        QRYSLT('EMFLAG *NE " "')
             CALL       PGM(ARLIB/ARP133RA)
             CLOF       OPNID(INEMST)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
