     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP132PA                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     INEDTL電子發票明細介面檔傳輸         */
     /*     5.DATE-WRITTEN  107/06/19 2018AR1162                    */
     /*     6.UPDATE  DATE                                          */
     /*                                                             */
     /*                                                             */
     /***************************************************************/

             PGM        PARM(&P#AREA)
             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             CHGVAR     VAR(&W#OUTF) VALUE('INEDTL' || &P#AREA)
             OVRDBF     FILE(INEDTLP) TOFILE(ARLIB/&W#OUTF)
             OVRDBF     FILE(INEDTL) TOFILE(DALIB/INEDTL) SHARE(*YES)
             OPNQRYF    FILE((INEDTL)) OPTION(*ALL) +
                        QRYSLT('EDFLAG *NE " "')
             CALL       PGM(ARLIB/ARP132RA)
             CLOF       OPNID(INEDTL)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
