        /******************************************************/
        /*                                                    */
        /*        >>   PROGRAM INTRODUCTION  <<               */
        /*        1.PROGRAM-ID     ARP110P                    */
        /*        2.PROGRAM-TYPE   CLP                        */
        /*        3.AUTHOR         S02CSF                     */
        /*        4.FUNCTION    祇布籔綪砯戈穝更矪瞶*/
        /*        5.DATE-WRITTEN   93/09/02                   */
        /*        6.DATE-MODIFY                               */
        /*                                                    */
        /******************************************************/
            PGM
            DCL        VAR(&C#COD1)   TYPE(*CHAR) LEN(1)
            DCL        VAR(&C#DAT1)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&C#DAT2)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&D#DAT1)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&D#DAT2)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&C#COD2)   TYPE(*CHAR) LEN(1)
            DCL        VAR(&C#DAT3)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&C#DAT4)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&D#DAT3)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&D#DAT4)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&C#COD3)   TYPE(*CHAR) LEN(1)
            DCL        VAR(&C#DAT5)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&C#DAT6)   TYPE(*CHAR) LEN(8)
            DCL        VAR(&D#DAT5)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&D#DAT6)   TYPE(*DEC)  LEN(8 0)
            DCL        VAR(&OUTQ)     TYPE(*CHAR) LEN(10)
            DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
            DCL        VAR(&DSPID)    TYPE(*CHAR) LEN(10)
            DCL        VAR(&S#USER)   TYPE(*CHAR) LEN(10)
            DCL        VAR(&P#IN03)   TYPE(*CHAR) LEN(1)

            RTVJOBA    JOB(&DSPID) USER(&S#USER) OUTQ(&OUTQ) +
                       TYPE(&TYPE)
            IF         COND(&TYPE *EQ '0') THEN(GOTO CMDLBL(BATCH))

            CALL       PGM(ARP110RS) PARM(&P#IN03)
            IF         COND(&P#IN03 *EQ '1') THEN(RETURN)

            SBMJOB     CMD(CALL PGM(ARP110P)) JOB(ARP110P) +
                       JOBD(ARJOBD)
            SNDBRKMSG  MSG('<<戈更秨﹍矪瞶叫祔......>>') +
                       TOMSGQ(%SST(*LDA 1011 10)) MSGTYPE(*INFO)
            RETURN

 BATCH:
            RTVDTAARA  DTAARA(*LDA (300 1)) RTNVAR(&C#COD1)
            RTVDTAARA  DTAARA(*LDA (301 8)) RTNVAR(&C#DAT1)
            RTVDTAARA  DTAARA(*LDA (309 8)) RTNVAR(&C#DAT2)
            RTVDTAARA  DTAARA(*LDA (317 1)) RTNVAR(&C#COD2)
            RTVDTAARA  DTAARA(*LDA (318 8)) RTNVAR(&C#DAT3)
            RTVDTAARA  DTAARA(*LDA (326 8)) RTNVAR(&C#DAT4)
            RTVDTAARA  DTAARA(*LDA (334 1)) RTNVAR(&C#COD3)
            RTVDTAARA  DTAARA(*LDA (335 8)) RTNVAR(&C#DAT5)
            RTVDTAARA  DTAARA(*LDA (343 8)) RTNVAR(&C#DAT6)
            CHGVAR     VAR(&D#DAT1)  VALUE(&C#DAT1)
            CHGVAR     VAR(&D#DAT2)  VALUE(&C#DAT2)
            CHGVAR     VAR(&D#DAT1)  VALUE(&D#DAT1 + 19110000)
            CHGVAR     VAR(&D#DAT2)  VALUE(&D#DAT2 + 19110000)
            CHGVAR     VAR(&C#DAT1)  VALUE(&D#DAT1)
            CHGVAR     VAR(&C#DAT2)  VALUE(&D#DAT2)
            CHGVAR     VAR(&D#DAT3)  VALUE(&C#DAT3)
            CHGVAR     VAR(&D#DAT4)  VALUE(&C#DAT4)
            CHGVAR     VAR(&D#DAT3)  VALUE(&D#DAT3 + 19110000)
            CHGVAR     VAR(&D#DAT4)  VALUE(&D#DAT4 + 19110000)
            CHGVAR     VAR(&C#DAT3)  VALUE(&D#DAT3)
            CHGVAR     VAR(&C#DAT4)  VALUE(&D#DAT4)
            CHGVAR     VAR(&D#DAT5)  VALUE(&C#DAT5)
            CHGVAR     VAR(&D#DAT6)  VALUE(&C#DAT6)
            CHGVAR     VAR(&D#DAT5)  VALUE(&D#DAT5 + 19110000)
            CHGVAR     VAR(&D#DAT6)  VALUE(&D#DAT6 + 19110000)
            CHGVAR     VAR(&C#DAT5)  VALUE(&D#DAT5)
            CHGVAR     VAR(&C#DAT6)  VALUE(&D#DAT6)

     /* STEP 1 : 更TNDLOG郎ず綪砯戈 */

            IF         COND(&C#COD1  *NE ' ') THEN(DO)
            CLRPFM     ARTXDW
            OVRDBF     FILE(TNDLOG) TOFILE(ARLIB/TNDLOG) SHARE(*YES)
            OPNQRYF    FILE((TNDLOG)) QRYSLT('         +
                       (DATE   *GE "' || &C#DAT1 || '")    *AND +
                       (DATE   *LE "' || &C#DAT2 || '")')       +
                       MAPFLD((DATE  TWDATE *CHAR 8))
            CALL       ARP110R
            CLOF       OPNID(TNDLOG)
            DLTOVR     *ALL
            ENDDO

     /* STEP 2 : 更INMLOG郎ず祇布戈 */

            IF         COND(&C#COD2  *NE ' ') THEN(DO)
            CLRPFM     ARINDW
            OVRDBF     FILE(INMLOG) TOFILE(ARLIB/INMLOG) SHARE(*YES)
            OPNQRYF    FILE((INMLOG)) QRYSLT('         +
                       (INDT   *GE "' || &C#DAT3 || '")    *AND +
                       (INDT   *LE "' || &C#DAT4 || '")')       +
                       MAPFLD((INDT  IMINDT *CHAR 8))
            CALL       ARP110R1
            CLOF       OPNID(INMLOG)
            DLTOVR     *ALL
            ENDDO

     /* STEP 3 : 更INDLOG郎ず祇布戈 */

            IF         COND(&C#COD3  *NE ' ') THEN(DO)
            CLRPFM     ARIVDW
            OVRDBF     FILE(INDLOG) TOFILE(ARLIB/INDLOG) SHARE(*YES)
            OPNQRYF    FILE((INDLOG)) QRYSLT('         +
                       (ACDT   *GE "' || &C#DAT5 || '")    *AND +
                       (ACDT   *LE "' || &C#DAT6 || '")')       +
                       MAPFLD((ACDT  IDACDT *CHAR 8))
            CALL       ARP110R2
            CLOF       OPNID(INDLOG)
            DLTOVR     *ALL
            ENDDO

            SNDBRKMSG  MSG('<< 戈更矪瞶ЧΘ.........>>')  +
                       TOMSGQ(%SST(*LDA 1011 10)) MSGTYPE(*INFO)
            ENDPGM
