     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP140P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION      INENRB電子發票分支機構配號檔傳輸    */
     /*                      P-->廠區                             */
     /*     5.DATE-WRITTEN  107/12/10 2018AR00031                   */
     /*     6.UPDATE  DATE  108/05/10 S00WCJ (0805A)                */
     /*                     110/12/20 2021AR00047 S00WCJ (1012A)    */
     /*                     增加傳輸至I廠                       */
     /*                                                             */
     /*                                                             */
     /***************************************************************/

             PGM
             DCL        VAR(&COUNTER) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOC)  TYPE(*CHAR) LEN(1)
  /*0805A*/  DCL        VAR(&USER)    TYPE(*CHAR) LEN(10)

             CHGJOB     LOGCLPGM(*YES)

             MONMSG     MSGID(CPF0000)
  /*0805A*/  RTVJOBA    OUTQ(&OUTQ) TYPE(&INT) USER(&USER)
        IF   COND(&INT *EQ '0') THEN(GOTO CMDLBL(BATCH))
 START:
             CHGVAR     VAR(&LOC)     VALUE('P')
             CHGDTAARA  DTAARA(*LDA (5 1))  VALUE(&LOC)
             SBMJOB     JOB(ARP142P) JOBD(ARJOBD) JOBQ(ARJOBQA) +
                           RQSDTA('CALL ARLIB/ARP142P')
             GOTO       CMDLBL(ENDCLPGM)
 BATCH:
  /*0805A*/  CHGDTAARA  DTAARA(*LDA (1001 10)) VALUE(&USER)
             CHGVAR     VAR(&COUNTER) VALUE(0)
 LOOP:
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&COUNTER) VALUE(&COUNTER  + 1)
             IF   COND(&COUNTER *GE 5) THEN(GOTO CMDLBL(ENDCLPGM))
             DLYJOB     DLY(60)
             GOTO       CMDLBL(LOOP)
             ENDDO
        /*                                          */
             RTVDTAARA  DTAARA(*LDA (5 1))  RTNVAR(&LOC)
        /*  台北  DALIB/INETRN--> DALIB/INETRNP    */
             OVRDBF     FILE(INENRB) TOFILE(DALIB/INENRB) SHARE(*YES)
     /*      OVRDBF     FILE(INENRB) TOFILE(S00WCJ/INENRB) SHARE(*YES) */
             OVRDBF     FILE(INENRBT) TOFILE(ARLIB/INENRBT)
     /*      OVRDBF     FILE(INENRBT) TOFILE(S00WCJ/INENRBT)  */

             OPNQRYF    FILE(INENRB) OPTION(*ALL) +
                          QRYSLT('(NBFLAG *NE " " *AND +
                                   NBSTCL *NE " ")')

             CALL       PGM(ARLIB/ARP142RA)
             CLOF       OPNID(INENRB)
             DLTOVR     FILE(*ALL)

             DLTF       FILE(QTEMP/DDMK)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(KSDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMK)
             DLTF       FILE(QTEMP/DDMU)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(U01DDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMU)
             DLTF       FILE(QTEMP/DDMH)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(MLDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMH)
/*1012A*/    DLTF       FILE(QTEMP/DDMI)
/*1012A*/    MONMSG     MSGID(CPF0000)
/*1012A*/    CRTDUPOBJ  OBJ(I01DDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMI)

        /*  台北　送廠區資料*/

 /*         台北 ARLIB/INENRBT 送　新桃 DALIB/INENRB      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'U')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('U')
      /*     CHGDDMF    FILE(QTEMP/DDMU) RMTFILE(S00WCJ/INENRB) +
                          LVLCHK(*NO)    */
             CHGDDMF    FILE(QTEMP/DDMU) RMTFILE(DALIB/INENRB) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INENRBT) TOFILE(ARLIB/INENRBT) SHARE(*YES)
      /*     OVRDBF     FILE(INENRBT) TOFILE(S00WCJ/INENRBT) SHARE(*YES) */

             OPNQRYF    FILE(INENRBT) OPTION(*ALL) +
                          QRYSLT('NBFACT *EQ "U"') +
                                KEYFLD((NBYEMH) (NBFACT))

             OVRDBF     FILE(INENRB) TOFILE(QTEMP/DDMU)
             CALL       PGM(ARLIB/ARP142RC)
             CLOF       OPNID(INENRBT)
             DLTOVR     FILE(*ALL)
             ENDDO

 /*1012A    台北 ARLIB/INENRBT 送　桃園加工 DALIB/INENRB      */
/*1012A*/    IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'I')) THEN(DO)
/*1012A*/    CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('I')
      /*     CHGDDMF    FILE(QTEMP/DDMI) RMTFILE(S00WCJ/INENRB) +
                          LVLCHK(*NO)    */
/*1012A*/    CHGDDMF    FILE(QTEMP/DDMI) RMTFILE(DALIB/INENRB) +
                          LVLCHK(*NO)
/*1012A*/    OVRDBF     FILE(INENRBT) TOFILE(ARLIB/INENRBT) SHARE(*YES)
      /*     OVRDBF     FILE(INENRBT) TOFILE(S00WCJ/INENRBT) SHARE(*YES) */

/*1012A*/    OPNQRYF    FILE(INENRBT) OPTION(*ALL) +
                          QRYSLT('NBFACT *EQ "I"') +
                                KEYFLD((NBYEMH) (NBFACT))

/*1012A*/    OVRDBF     FILE(INENRB) TOFILE(QTEMP/DDMI)
/*1012A*/    CALL       PGM(ARLIB/ARP142RC)
/*1012A*/    CLOF       OPNID(INENRBT)
/*1012A*/    DLTOVR     FILE(*ALL)
/*1012A*/    ENDDO

        /*  台北 ARLIB/INENRBT 送　苗栗 DALIB/INENRB      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'H')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('H')
   /*        CHGDDMF    FILE(QTEMP/DDMH) RMTFILE(S00WCJ/INENRB) +
                          LVLCHK(*NO)   */
             CHGDDMF    FILE(QTEMP/DDMH) RMTFILE(DALIB/INENRB) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INENRBT) TOFILE(ARLIB/INENRBT) SHARE(*YES)
   /*        OVRDBF     FILE(INENRBT) TOFILE(S00WCJ/INENRBT) SHARE(*YES) */
             OPNQRYF    FILE(INENRBT) OPTION(*ALL) +
                          QRYSLT('NBFACT *EQ "H"')       +
                                KEYFLD((NBYEMH) (NBFACT))
             OVRDBF     FILE(INENRB) TOFILE(QTEMP/DDMH)
             CALL       PGM(ARLIB/ARP142RC)
             CLOF       OPNID(INENRBT)
             DLTOVR     FILE(*ALL)
             ENDDO


        /*  台北 ARLIB/INETRNP 送　高雄 DALIB/INETRN      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'K')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('K')
    /*       CHGDDMF    FILE(QTEMP/DDMK) RMTFILE(S00WCJ/INENRB) +
                          LVLCHK(*NO)    */
             CHGDDMF    FILE(QTEMP/DDMK) RMTFILE(DALIB/INENRB) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INENRBT) TOFILE(ARLIB/INENRBT) SHARE(*YES)
    /*       OVRDBF     FILE(INENRBT) TOFILE(S00WCJ/INENRBT) SHARE(*YES) */
             OPNQRYF    FILE(INENRBT) OPTION(*ALL) +
                          QRYSLT('NBFACT *EQ "K"') +
                                KEYFLD((NBYEMH) (NBFACT))
             OVRDBF     FILE(INENRB) TOFILE(QTEMP/DDMK)
             CALL       PGM(ARLIB/ARP142RC)
             CLOF       OPNID(INENRBT)
             DLTOVR     FILE(*ALL)
             ENDDO

 ENDCLPGM:   ENDPGM
