     /****************************************************************/
     /*                                                              */
     /*               >>   PROGRAM INTRODUCTION   <<                 */
     /*                                                              */
     /*            1.PROGRAM-NAME  ARP199P                           */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            4.FUNCTION    FUCO INVOICE PRINT - CALL PC  INTER */
     /****************************************************************/
             PGM
             DCL        VAR(&USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&CMD)   TYPE(*CHAR) LEN(32)
             DCL        VAR(&CMD1)  TYPE(*CHAR) LEN(42)
      BATCH:
             RTVDTAARA  DTAARA(*LDA (1001 10))  RTNVAR(&USER)
             STRPCO     PCTA(*NO)
             MONMSG CPF0000

 CHGVAR     VAR(&CMD)  VALUE('C:\INVOICE\FUCOINVOICEPRINT.EXE ')
             CHGVAR     VAR(&CMD1) VALUE(&CMD || &USER || ' ')
             STRPCCMD   PCCMD(&CMD1) PAUSE(*NO)
           ENDPGM
