     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP139P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     INEDIN電子發票作廢檔傳輸P-->廠區   */
     /*     5.DATE-WRITTEN  107/12/07 2018AR00031                   */
     /*     6.UPDATE  DATE  108/05/10 S00WCJ (0805A)                */
     /*                                                             */
     /*                                                             */
     /***************************************************************/

             PGM
             DCL        VAR(&COUNTER) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOC)  TYPE(*CHAR) LEN(1)
  /*0805A*/  DCL        VAR(&USER)    TYPE(*CHAR) LEN(10)

             CHGJOB     LOGCLPGM(*YES)

             MONMSG     MSGID(CPF0000)
  /*0805A*/  RTVJOBA    OUTQ(&OUTQ) TYPE(&INT) USER(&USER)
        IF   COND(&INT *EQ '0') THEN(GOTO CMDLBL(BATCH))
 START:
             CHGVAR     VAR(&LOC)     VALUE('P')
             CHGDTAARA  DTAARA(*LDA (5 1))  VALUE(&LOC)
             SBMJOB     JOB(ARP139P) JOBD(ARJOBD) JOBQ(QCTL) +
                           RQSDTA('CALL ARLIB/ARP139P')
             GOTO       CMDLBL(ENDCLPGM)
 BATCH:
  /*0805A*/  CHGDTAARA  DTAARA(*LDA (1001 10)) VALUE(&USER)
             CHGVAR     VAR(&COUNTER) VALUE(0)
 LOOP:
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&COUNTER) VALUE(&COUNTER  + 1)
             IF   COND(&COUNTER *GE 5) THEN(GOTO CMDLBL(ENDCLPGM))
             DLYJOB     DLY(60)
             GOTO       CMDLBL(LOOP)
             ENDDO
        /*                                          */
             RTVDTAARA  DTAARA(*LDA (5 1))  RTNVAR(&LOC)
        /*  台北  DALIB/INEDIN--> DALIB/INEDINT    */
     /*      OVRDBF     FILE(INEDIN) TOFILE(S00WCJ/INEDIN) SHARE(*YES) */
             OVRDBF     FILE(INEDIN) TOFILE(DALIB/INEDIN) SHARE(*YES)
             OVRDBF     FILE(INEDINT) TOFILE(ARLIB/INEDINT)
     /*      OVRDBF     FILE(INEDINT) TOFILE(S00WCJ/INEDINT)  */

             OPNQRYF    FILE(INEDIN) OPTION(*ALL) +
                          QRYSLT('(DNFLAG *NE " " *AND +
                                   DNSTCL *NE " ")')

             CALL       PGM(ARLIB/ARP139RA)
             CLOF       OPNID(INEDIN)
             DLTOVR     FILE(*ALL)

             DLTF       FILE(QTEMP/DDMK)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(KSDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMK)
             DLTF       FILE(QTEMP/DDMU)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(U01DDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMU)
             DLTF       FILE(QTEMP/DDMH)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(MLDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DDMH)

        /*  台北　送廠區資料*/

 /*         台北 ARLIB/INEDINT 送　新桃 DALIB/INEDIN      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'U')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('U')
     /*      CHGDDMF    FILE(QTEMP/DDMU) RMTFILE(S00WCJ/INEDIN) +
                          LVLCHK(*NO)    */
             CHGDDMF    FILE(QTEMP/DDMU) RMTFILE(DALIB/INEDIN) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INEDINT) TOFILE(ARLIB/INEDINT) SHARE(*YES)
     /*      OVRDBF     FILE(INEDINT) TOFILE(S00WCJ/INEDINT) SHARE(*YES) */

             OPNQRYF    FILE(INEDINT) OPTION(*ALL) +
                          QRYSLT('DNAREA *EQ "U"') +
                                KEYFLD((DNNO))

             OVRDBF     FILE(INEDIN) TOFILE(QTEMP/DDMU)
             CALL       PGM(ARLIB/ARP139RC)
             CLOF       OPNID(INEDINT)
             DLTOVR     FILE(*ALL)
             ENDDO

        /*  台北 ARLIB/INEDINT 送　苗栗 DALIB/INEDIN      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'H')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('H')
    /*       CHGDDMF    FILE(QTEMP/DDMH) RMTFILE(S00WCJ/INEDIN) +
                          LVLCHK(*NO)     */
             CHGDDMF    FILE(QTEMP/DDMH) RMTFILE(DALIB/INEDIN) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INEDINT) TOFILE(ARLIB/INEDINT) SHARE(*YES)
    /*       OVRDBF     FILE(INEDINT) TOFILE(S00WCJ/INEDINT) SHARE(*YES) */
             OPNQRYF    FILE(INEDINT) OPTION(*ALL) +
                          QRYSLT('DNAREA *EQ "H"')       +
                                KEYFLD((DNNO))
             OVRDBF     FILE(INEDIN) TOFILE(QTEMP/DDMH)
             CALL       PGM(ARLIB/ARP139RC)
             CLOF       OPNID(INEDINT)
             DLTOVR     FILE(*ALL)
             ENDDO


        /*  台北 ARLIB/INEDINT 送　高雄 DALIB/INEDIN      */
             IF         COND((&LOC *EQ 'P') *OR (&LOC *EQ ' ') *OR +
                          (&LOC *EQ 'K')) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (6 1)) VALUE('K')
      /*     CHGDDMF    FILE(QTEMP/DDMK) RMTFILE(S00WCJ/INEDIN) +
                          LVLCHK(*NO)    */
             CHGDDMF    FILE(QTEMP/DDMK) RMTFILE(DALIB/INEDIN) +
                          LVLCHK(*NO)
             OVRDBF     FILE(INEDINT) TOFILE(ARLIB/INEDINT) SHARE(*YES)
      /*     OVRDBF     FILE(INEDINT) TOFILE(S00WCJ/INEDINT) SHARE(*YES) */
             OPNQRYF    FILE(INEDINT) OPTION(*ALL) +
                          QRYSLT('DNAREA *EQ "K"') +
                                KEYFLD((DNNO))
             OVRDBF     FILE(INEDIN) TOFILE(QTEMP/DDMK)
             CALL       PGM(ARLIB/ARP139RC)
             CLOF       OPNID(INEDINT)
             DLTOVR     FILE(*ALL)
             ENDDO

 ENDCLPGM:   ENDPGM
