     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP114P2                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CSF                                  */
     /*     4.FUNCTION     發票作廢記錄明細檔傳輸作業－台北送廠區 */
     /*     5.DATE-WRITTEN  94/01/06                                */
     /*     6.DATE-UPDATE                                           */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&P#AREA)

             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

    /*       CLRPFM     DELDTLX            */
    /*       MONMSG     MSGID(CPF0000)     */
             OVRDBF     FILE(DELDTL)  TOFILE(DALIB/DELDTL)
             OVRDBF     FILE(DELDTLX) TOFILE(ARLIB/DELDTLX) SHARE(*YES)
             OPNQRYF    FILE((DELDTLX)) OPTION(*ALL) QRYSLT('       +
                        (DYFLAG *NE " ")           *AND             +
                        (WTNO   *EQ "' || &P#AREA || '")')          +
                        KEYFLD((DYIVNO) (DYWTNO) (DYITEM))          +
                        MAPFLD((WTNO '%SST(DYWTNO 1 1)'))
             CALL       PGM(ARLIB/ARP114R2)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
