     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP112PFA                               */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CSF                                  */
     /*     4.FUNCTION     營業退款檔製票資料傳輸作業             */
     /*     5.DATE-WRITTEN  93/11/08                                */
     /*     6.DATE-UPDATE                                           */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&P#AREA)

             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CLRPFM     ARRETNX
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(ARRETN)  TOFILE(DALIB/ARRETN)
             OVRDBF     FILE(ARRETNX) TOFILE(ARLIB/ARRETNX) SHARE(*YES)
             IF         COND(&P#AREA *EQ 'T')  THEN(DO)
             OPNQRYF    FILE((ARRETNX)) OPTION(*ALL) QRYSLT('       +
                        (RTNO   *EQ "' || &P#AREA || '" )')         +
                        MAPFLD((RTNO   '%SST(AXRTNO 1 1)' *CHAR 1)) +
                        KEYFLD((AXRTNO) (AXITEM))
             ENDDO
             CALL       PGM(ARLIB/ARP112RFA)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
