/*                                                                        */
             PGM        PARM(&KIND  &PRIN)

             DCL        VAR(&KIND) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PRIN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)   TYPE(*CHAR) LEN(10)

             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT) USER(&USER)

             SNDMSG     MSG(&KIND)  TOUSR(&USER)
             SNDMSG     MSG(&PRIN)  TOUSR(&USER)

             ENDPGM
