     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP114PA                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CSF                                  */
     /*     4.FUNCTION     發票作廢記錄明細檔傳輸作業－廠區異動   */
     /*     5.DATE-WRITTEN  94/01/06                                */
     /*     6.DATE-UPDATE                                           */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&P#AREA)

             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

             CLRPFM     DELDTLX
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(DELDTLX) TOFILE(ARLIB/DELDTLX)
             OVRDBF     FILE(DELDTL)  TOFILE(DALIB/DELDTL) SHARE(*YES)
             OPNQRYF    FILE((DELDTL)) OPTION(*ALL) QRYSLT('    +
                        (DLFLAG *NE " ")           *AND         +
                        (WTNO   *EQ "' || &P#AREA || '")')      +
                        KEYFLD((DLWTNO) (DLITEM))               +
                        MAPFLD((WTNO '%SST(DLWTNO 1 1)'))
             CALL       PGM(ARLIB/ARP114RA)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
