     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARP113P2                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CSF                                  */
     /*     4.FUNCTION     發票作廢記錄主檔傳輸作業－台北送廠區   */
     /*     5.DATE-WRITTEN  94/01/06                                */
     /*     6.DATE-UPDATE                                           */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&P#AREA)

             DCL        VAR(&P#AREA)  TYPE(*CHAR)  LEN(1)
             DCL        VAR(&W#OUTF)  TYPE(*CHAR)  LEN(10)

    /*       CLRPFM     DELMSTX   */
    /*       MONMSG     MSGID(CPF0000)   */
             OVRDBF     FILE(DELMST)  TOFILE(DALIB/DELMST)
             OVRDBF     FILE(DELMSTX) TOFILE(ARLIB/DELMSTX) SHARE(*YES)
             OPNQRYF    FILE((DELMSTX)) OPTION(*ALL) QRYSLT('       +
                        (DXAREA *EQ "' || &P#AREA || '" )')         +
                        KEYFLD((DXINNO) )
             CALL       PGM(ARLIB/ARP113R2)
             DLTOVR     FILE(*ALL)

 ENDCLPGM:   ENDPGM
