             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&W0101)  TYPE(*DEC)  LEN(6)
             DCL        VAR(&W0101C) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TXAR)   TYPE(*CHAR) LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR007RS) PARM(&IN03 &W0101)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGVAR     VAR(&W0101C) VALUE(&W0101)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&W0101C)
             SBMJOB     JOB(ARR007PT) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR007PT')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 6)) RTNVAR(&W0101C)
             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&TXAR)
             CHGVAR     VAR(&W0101) VALUE(&W0101C)
             OVRDBF     FILE(INVCUT) TOFILE(INVCUT) SHARE(*YES)
             OPNQRYF    FILE((INVCUT)) OPTION(*ALL) QRYSLT('     +
                          CUDECD *EQ " "                       & +
                          CUAREA *EQ "M"                       & +
                          CUINDT *EQ ' || &W0101C || ' ')  +
                          KEYFLD((CUNO))
             OVRPRTF    FILE(QPRINT) PAGESIZE(33 80) LPI(6) CPI(10) +
                          OVRFLW(33) FORMTYPE('祇布') +
                          USRDTA('い祇布')
             CALL       PGM(ARR007R)
             CLOF       OPNID(INVCUT)
             DLTOVR     FILE(*ALL)
             /*         */
             OVRDBF     FILE(INVCUT) TOFILE(INVCUT) SHARE(*YES)
             OPNQRYF    FILE((INVCUT)) OPTION(*ALL) QRYSLT('     +
                          CUDECD *EQ " "                       & +
                          CUAREA *EQ "P"                       & +
                          CUINDT *EQ ' || &W0101C || ' ')  +
                          KEYFLD((CUNO))
             OVRPRTF    FILE(QPRINT) PAGESIZE(33 80) LPI(6) CPI(10) +
                          OVRFLW(33) FORMTYPE('祇布') +
                          USRDTA('祇布')
             CALL       PGM(ARR007R)
             CLOF       OPNID(INVCUT)
             DLTOVR     FILE(*ALL)
             /*         */
             OVRDBF     FILE(INVMST) TOFILE(DALIB/INVMST97)
             OVRDBF     FILE(INVCUT) TOFILE(INVCUT) SHARE(*YES)
             OPNQRYF    FILE((INVCUT)) OPTION(*ALL) QRYSLT('     +
                          CUDECD *EQ " "                       & +
                          CUAREA *EQ "T"                       & +
                          CUINDT *EQ ' || &W0101C || ' ')  +
                          KEYFLD((CUNO))
             OVRPRTF    FILE(QPRINT) PAGESIZE(33 80) LPI(6) CPI(10) +
                          OVRFLW(33) FORMTYPE('祇布') +
                          USRDTA('堕祇布')
             CALL       PGM(ARR007R)
             CLOF       OPNID(INVCUT)
             DLTOVR     FILE(*ALL)
             /*         */
             OVRDBF     FILE(INVCUT) TOFILE(INVCUT) SHARE(*YES)
             OPNQRYF    FILE((INVCUT)) OPTION(*ALL) QRYSLT('     +
                          CUDECD *EQ " "                       & +
                          CUAREA *EQ "K"                       & +
                          CUINDT *EQ ' || &W0101C || ' ')  +
                          KEYFLD((CUNO))
             OVRPRTF    FILE(QPRINT) DEV(PRT18) PAGESIZE(33 80) +
                          HOLD(*YES) SAVE(*YES) +
                          OVRFLW(33) FORMTYPE('祇布') +
                          USRDTA('蔼动祇布')
             CALL       PGM(ARR007R)
             CLOF       OPNID(INVCUT)
             DLTOVR     FILE(*ALL)
             /*         */
             OVRDBF     FILE(INVCUT) TOFILE(INVCUT) SHARE(*YES)
             OPNQRYF    FILE((INVCUT)) OPTION(*ALL) QRYSLT('     +
                          CUDECD *EQ " "                       & +
                          CUAREA *EQ "H"                       & +
                          CUINDT *EQ ' || &W0101C || ' ')  +
                          KEYFLD((CUNO))
             OVRPRTF    FILE(QPRINT) PAGESIZE(33 80) LPI(6) CPI(10) +
                          OVRFLW(33) FORMTYPE('祇布') +
                          USRDTA('葵祇布')
             CALL       PGM(ARR007R)
             CLOF       OPNID(INVCUT)
             DLTOVR     FILE(*ALL)
             ENDPGM
