             PGM
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&AREA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&S)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&E)    TYPE(*CHAR) LEN(6)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR046RS) PARM(&IN03 &S &E)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&S)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&E)
             SBMJOB     JOB(ARR046P) JOBD(CCJOBD)            +
                          OUTQ(&OUTQ) RQSDTA('CALL ARR046P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 6))   RTNVAR(&S)
             RTVDTAARA  DTAARA(*LDA (7 6))   RTNVAR(&E)
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             OPNQRYF    FILE((INVMST)) QRYSLT('         +
                             INCUNO *GE "' || &S || '"  +
                        *AND INCUNO *LE "' || &E || '"  +
                        *AND INTYPE *EQ "2"              +
                        *AND INDECD *EQ " "')            +
                     KEYFLD((INCUNO) (ININDT) (INNO))
             OVRPRTF    FILE(QPRINT) PAGESIZE(*N 132) CPI(10)
             CALL       PGM(ARR046R)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
