           /******************************************************/
           /*                                                    */
           /*   PROGRAM   ID        :   ARR033R                  */
           /*   PROGRAM   FUNCTION  :  銷退或折讓證明單列印    */
           /*   AUTHER              :   NANCY                    */
           /*   CREATE    DATE      :   81/09/30                 */
           /*   MAINTAIN  DATE      :                            */
           /*   RELATION  PROGRAM   :   ARR033P,ARR033R,ARR033S  */
           /*   NOTE                :                            */
           /*   UPDATE  DATE        : 101/02/02 S00WCJ (0102A)   */
           /*                        變更印表機代號PPB0006改為*/
           /*                         PPB0010                    */
           /*                                                    */
           /******************************************************/
             PGM        PARM(&NO)
             DCL        VAR(&NO)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)

             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '0') THEN(GOTO BATCH)

 DISPLAY:
             IF         COND(&NO *EQ  ' ')   THEN(DO)
                        CALL  PGM(ARR033RS)  PARM(&NO &IN03)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             ENDDO

             SBMJOB     JOB(ARR033P) JOBD(ARJOBD) JOBQ(ARJOBQ) +
                         OUTQ(PPB0010) RQSDTA('CALL PGM(ARR033P) +
                         PARM(''' || &NO || ''')')
             RETURN

   BATCH:
             OVRPRTF    FILE(QPRINT) PAGESIZE(33 96) LPI(6) CPI(12) +
                          OVRFLW(33) HOLD(*YES) SAVE(*YES)
             CALL       PGM(ARR033R) PARM(&NO)
             DLTOVR     FILE(*ALL)
ENDCLPGM:    ENDPGM
