             PGM
             DCL        VAR(&YYA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YY)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MM)  TYPE(*DEC)  LEN(2 0)
             OVRDBF     FILE(INVMST) TOFILE(DALIB/INVMST)
             CLRPFM     FILE(CCLIB/PRSTAT)
             OVRDBF     FILE(PRSTAT) TOFILE(CCLIB/PRSTAT) SHARE(*YES)
             OVRDBF     FILE(INVDTL) TOFILE(DALIB/INVDTL) SHARE(*YES)
             OPNQRYF    FILE((INVDTL)) QRYSLT('IVACNT = ''4''  & +
                                               IVAMT  < 0      & +
                                               IVFL03 = ''E'' & +
                                               IVACDT > 811231 & +
                                               IVACDT < 820601') +
                                       KEYFLD((IVNO))
             CALL       PGM(ARR057RC)
             CLOF       OPNID(INVDTL)
             OPNQRYF    FILE((PRSTAT)) KEYFLD((PRCUNO) (PRORNO))
             CALL       PGM(ARR057R)
             CLOF       OPNID(PRSTAT)
             DLTOVR     FILE(*ALL)
             ENDPGM
