             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&DATE) TYPE(*DEC)  LEN(6)
             DCL        VAR(&DATEA) TYPE(*CHAR) LEN(6)
             DCL        VAR(&S)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&E)    TYPE(*CHAR) LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR010RS) PARM(&IN03 &DATE &S &E)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGVAR     VAR(&DATEA) VALUE(&DATE)
             CHGDTAARA  DTAARA(*LDA (1 1)) VALUE(&S)
             CHGDTAARA  DTAARA(*LDA (2 1)) VALUE(&E)
             CHGDTAARA  DTAARA(*LDA (3 6)) VALUE(&DATEA)
             SBMJOB     JOB(ARR010P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR010P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 1))   RTNVAR(&S)
             RTVDTAARA  DTAARA(*LDA (2 1))   RTNVAR(&E)
             RTVDTAARA  DTAARA(*LDA (3 6))   RTNVAR(&DATEA)
             CHGVAR     VAR(&DATE) VALUE(&DATEA)
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             OPNQRYF    FILE((INVMST)) QRYSLT('         +
                             INRVID *GE "' || &S || '"  +
                        *AND INRVID *LE "' || &E || '"  +
                        *AND ININDT *LE ' || &DATEA || ' +
                        *AND INAPNO *EQ " "             +
                        *AND INDECD *EQ " "             +
                        *AND INTYPE *NE "9"             +
                        *AND INNBAL *NE 0   ')          +
                        KEYFLD((INRVID) (INCUNO) (INNO))
             CALL       PGM(ARR010R)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
