             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             RTVJOBA    TYPE(&INT)
             IF         COND(&INT *EQ '0') THEN(GOTO BATCH)
             SBMJOB     JOB(ARR052P) JOBD(ARJOBD)  +
                          RQSDTA('CALL ARR052PX')
             RETURN

 BATCH:
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
#02:         OPNQRYF    FILE((INVMST)) QRYSLT('                  +
                          INAREA *EQ %VALUES("P" "L" "M" "T" "H" "K")  & +
                          INDECD *EQ " "                       & +
                          ININDT *GE 870101 & +
                          ININDT *LE 910701') +
                          KEYFLD((INNO))
 #03:        CLRPFM ARLIB/ARWF02
             OVRDBF     FILE(ARWF02) TOFILE(ARLIB/ARWF02)
             CALL       PGM(ARR052RX)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
          /*     */
             ENDPGM
