             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&AREAF)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&AREAT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DATE1)  TYPE(*DEC)  LEN(6)
             DCL        VAR(&DATE2)  TYPE(*DEC)  LEN(6)
             DCL        VAR(&DATE1A) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE2A) TYPE(*CHAR) LEN(6)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR051RS) PARM(&IN03 &AREAF &AREAT +
                          &DATE1 &DATE2)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGVAR     VAR(&DATE1A) VALUE(&DATE1)
             CHGVAR     VAR(&DATE2A) VALUE(&DATE2)
             CHGDTAARA  DTAARA(*LDA (1 1)) VALUE(&AREAF)
             CHGDTAARA  DTAARA(*LDA (2 1)) VALUE(&AREAT)
             CHGDTAARA  DTAARA(*LDA (3 6)) VALUE(&DATE1A)
             CHGDTAARA  DTAARA(*LDA (9 6)) VALUE(&DATE2A)
             SBMJOB     JOB(ARR051P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR051P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 1))   RTNVAR(&AREAF)
             RTVDTAARA  DTAARA(*LDA (2 1))   RTNVAR(&AREAT)
             RTVDTAARA  DTAARA(*LDA (3 6))   RTNVAR(&DATE1A)
             RTVDTAARA  DTAARA(*LDA (9 6))   RTNVAR(&DATE2A)
             OVRDBF     FILE(TRNDTL) TOFILE(TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) QRYSLT('                     +
                        %SST(TXNO 1 1) *EQ %RANGE("' || &AREAF || '" +
                          "' || &AREAT || '")                     & +
                        TXACDT *EQ %RANGE(' || &DATE1A || '         +
                                          ' || &DATE2A || ')      & +
                          TXCODE *EQ "AR06"                       & +
                          TXFL01 *NE " "')                          +
                          KEYFLD((TXFL02) (TXCUNO) (TXNO)) +
                          MAPFLD((TXFL02 '%SST(TXNO 1 5)'))
             CALL       PGM(ARR051R)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)
             ENDPGM
