             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&W0100)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&W0101)  TYPE(*DEC)  LEN(4)
             DCL        VAR(&W0101A) TYPE(*CHAR) LEN(4)
             DCL        VAR(&W0102)  TYPE(*DEC)  LEN(6)
             DCL        VAR(&W0102A) TYPE(*CHAR) LEN(6)
             DCL        VAR(&W0103)  TYPE(*DEC)  LEN(6)
             DCL        VAR(&W0103A) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR037RS) PARM(&IN03 &W0100)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 1)) VALUE(&W0100)
             SBMJOB     JOB(ARR037P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR037P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 1)) RTNVAR(&W0100)
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             IF         COND(&W0100 = 'P') THEN(GOTO CMDLBL(#02))
             OPNQRYF    FILE((INVMST)) QRYSLT('                  +
                          INRVID *EQ "' || &W0100 || '"')        +
                          KEYFLD((INRVID)(INCUNO)(INNO))
             GOTO       CMDLBL(#03)
#02:         OPNQRYF    FILE((INVMST)) QRYSLT('                  +
                          INAREA *EQ %VALUES("P" "L" "T")')      +
                          KEYFLD((INNO))
#03:         CALL       PGM(ARR035R)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
