             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&CUST1) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CUST2) TYPE(*CHAR) LEN(6)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR008RS) PARM(&IN03 &CUST1 &CUST2)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&CUST1)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&CUST2)
             SBMJOB     JOB(ARR008P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR008P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 6))   RTNVAR(&CUST1)
             RTVDTAARA  DTAARA(*LDA (7 6))   RTNVAR(&CUST2)
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             OPNQRYF    FILE((INVMST)) QRYSLT('                 +
                          INCUNO = %RANGE("' || &CUST1 || '"    +
                                          "' || &CUST2 || '") & +
                          INDECD *EQ " "                      & +
                          INTYPE *NE "9"                      & +
                          INNBAL *GT 0 ')                       +
                          KEYFLD((INCUNO)(INRVID)(INORNO)(INNO))
             CALL       PGM(ARR008R) PARM(&CUST1 &CUST2)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
