     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARR001PC                                */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     請款單發票列印                         */
     /*     5.DATE-WRITTEN  112/09/20  2023AR00042                  */
     /*                                                             */
     /***************************************************************/
             PGM        PARM(&APNO &W#BUMD)

             DCL        VAR(&INT)     TYPE(*CHAR)   LEN(1)
             DCL        VAR(&OUTQ)    TYPE(*CHAR)   LEN(10)
             DCL        VAR(&USER)    TYPE(*CHAR)   LEN(10)
             DCL        VAR(&APNO)    TYPE(*CHAR)   LEN(6)

             DCL        VAR(&W1FRDT)  TYPE(*CHAR)   LEN(8)
             DCL        VAR(&W1TODT)  TYPE(*CHAR)   LEN(8)
             DCL        VAR(&W1FRNO)  TYPE(*CHAR)   LEN(10)
             DCL        VAR(&W1TONO)  TYPE(*CHAR)   LEN(10)
             DCL        VAR(&W#AREA)  TYPE(*CHAR)   LEN(1)  /*列印廠區*/
             DCL        VAR(&W#PTMD)  TYPE(*CHAR)   LEN(1)  /*列印模式*/
             DCL        VAR(&W#BUMD)  TYPE(*CHAR)   LEN(1)  /*營業單位*/
             DCL        VAR(&PATH1)   TYPE(*CHAR)   LEN(16)
             DCL        VAR(&CMD)     TYPE(*CHAR)   LEN(26)
             DCL        VAR(&CMD1)    TYPE(*CHAR)   LEN(43)
             DCL        VAR(&CMD2)    TYPE(*CHAR)   LEN(45)
             DCL        VAR(&CMD3)    TYPE(*CHAR)   LEN(54)
             DCL        VAR(&CMD4)    TYPE(*CHAR)   LEN(63)
             DCL        VAR(&CMD5)    TYPE(*CHAR)   LEN(74)
             DCL        VAR(&CMD6)    TYPE(*CHAR)   LEN(85)
             DCL        VAR(&CMD7)    TYPE(*CHAR)   LEN(87)
             DCL        VAR(&CMD8)    TYPE(*CHAR)   LEN(89)
             DCL        VAR(&CMD9)    TYPE(*CHAR)   LEN(100)
             DCL        VAR(&CMDA)    TYPE(*CHAR)   LEN(107)

             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT) USER(&USER)

             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&W#AREA)


             CHGVAR     VAR(&PATH1)  VALUE('PRINTINVOICE.EXE')

             CHGVAR    VAR(&W1FRDT) VALUE('01000101')
             CHGVAR    VAR(&W1TODT) VALUE('01991231')

             CHGVAR    VAR(&W1FRNO) VALUE('0000000000')
             CHGVAR    VAR(&W1TONO) VALUE('ZZZZZZZZZZ')

             CHGVAR    VAR(&W#PTMD) VALUE('1')

             STRPCO     PCTA(*NO)
             MONMSG     CPF0000

             CHGVAR   VAR(&CMD)  VALUE('C:\E-INVOICE\PRINTINVOICE\')
             CHGVAR   VAR(&CMD1) VALUE(&CMD || &PATH1 || ' ')
             CHGVAR   VAR(&CMD2) VALUE(&CMD1 || &W#AREA || ' ')
             CHGVAR   VAR(&CMD3) VALUE(&CMD2 || &W1FRDT || ' ')
             CHGVAR   VAR(&CMD4) VALUE(&CMD3 || &W1TODT || ' ')
             CHGVAR   VAR(&CMD5) VALUE(&CMD4 || &W1FRNO || ' ')
             CHGVAR   VAR(&CMD6) VALUE(&CMD5 || &W1TONO || ' ')
             CHGVAR   VAR(&CMD7) VALUE(&CMD6 || &W#PTMD || ' ')
             CHGVAR   VAR(&CMD8) VALUE(&CMD7 || &W#BUMD || ' ')
             CHGVAR   VAR(&CMD9) VALUE(&CMD8 || &USER || ' ')
             CHGVAR   VAR(&CMDA) VALUE(&CMD9 || &APNO || ' ')

             STRPCCMD   PCCMD(&CMDA) PAUSE(*NO)


 ENDCLPGM:   ENDPGM
