             PGM
             DCL        VAR(&YYA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YY)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MM)  TYPE(*DEC)  LEN(2 0)
             OVRDBF     FILE(INVMST) TOFILE(DALIB/INVMST)
             OVRDBF     FILE(INVDTL) TOFILE(DALIB/INVDTL) SHARE(*YES)
             OPNQRYF    FILE((INVDTL)) QRYSLT('                  +
                                   IVACNT *EQ  %VALUES("1" "9")  +
                            *AND   IVPDCD *EQ  "808"               +
                            *AND   IVACDT > 811231                 +
                            *AND   IVACDT < 830101') +
                                   KEYFLD((IVPDCD)(IVNO))
             CALL       PGM(ARR058R)
             CLOF       OPNID(INVDTL)
             DLTOVR     FILE(*ALL)
             ENDPGM
