             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&DATEF) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&DATET) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&DATEFA) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATETA) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AREA)   TYPE(*CHAR) LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR039RS) PARM(&IN03 &DATEF &DATET)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGVAR     VAR(&DATEFA)       VALUE(&DATEF)
             CHGVAR     VAR(&DATETA)       VALUE(&DATET)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&DATEFA)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&DATETA)
             SBMJOB     JOB(ARR039PK) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR039PK')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 6))   RTNVAR(&DATEFA)
             RTVDTAARA  DTAARA(*LDA (7 6))   RTNVAR(&DATETA)
             RTVDTAARA  DTAARA(*LDA (1021 1))   RTNVAR(&AREA)
             OVRDBF     FILE(TRNDTL) TOFILE(TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) QRYSLT('                     +
                          TXTXAR       *EQ "' || &AREA || '"      & +
                          TXFLAG       *NE "D"                    & +
                          TXACDT *EQ %RANGE(' || &DATEFA || '       +
                                        ' || &DATETA || ')        & +
                          TXCODE *EQ "SA04"                       & +
                          %SST(TXPDNM 1 1) *EQ "2"')                +
                          KEYFLD((TXACDT)(TXNO) (TXACNT)(TXORNO))
             OVRPRTF    FILE(QPRINT) OUTQ(PRT20) COPIES(2) +
                          HOLD(*YES) USRDTA('傳票日報')
             CALL       PGM(ARR039R)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)
             ENDPGM
