             PGM
             DCL        VAR(&INT) TYPE(*CHAR)  LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&RVID1) TYPE(*CHAR) LEN(2)
             DCL        VAR(&RVID2) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FLAG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AREA) TYPE(*CHAR) LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR031RS) PARM(&IN03 &RVID1 &RVID2  +
                                           &AREA &FLAG &YDATE)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&RVID1)
             CHGDTAARA  DTAARA(*LDA (5 6)) VALUE(&YDATE)
             CHGDTAARA  DTAARA(*LDA (3 1)) VALUE(&FLAG)
             CHGDTAARA  DTAARA(*LDA (11 21)) VALUE(&RVID2)
             CHGDTAARA  DTAARA(*LDA (13 1)) VALUE(&AREA)
             SBMJOB     JOB(ARR031P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR031P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 2))   RTNVAR(&RVID1)
             RTVDTAARA  DTAARA(*LDA (5 6))   RTNVAR(&YDATE)
             RTVDTAARA  DTAARA(*LDA (3 1))   RTNVAR(&FLAG)
             RTVDTAARA  DTAARA(*LDA (11 2))   RTNVAR(&RVID2)
             RTVDTAARA  DTAARA(*LDA (13 1))   RTNVAR(&AREA)
             IF         COND(&FLAG *EQ "Y")  THEN(DO)
                        CALL  PGM(ARP031P)
                        ENDDO
 REPORT:
             OVRDBF     FILE(CURCPR) TOFILE(CURCPR) SHARE(*YES)
             OPNQRYF    FILE((CURCPR)) QRYSLT('                 +
                          CUDATE *EQ ' || &YDATE || '      & +
                          CURVID *GE "' || &RVID1 || '"    & +
                          CURVID *LE "' || &RVID2 || '"')    +
                          KEYFLD((CUAREA) (CURVID) (CUCUNO))
             OVRPRTF    FILE(QPRINT) USRDTA('½Ð»â´Úªí')
             CALL       PGM(ARR031R)
             CLOF       CURCPR
             DLTOVR     FILE(*ALL)
             ENDPGM
