             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&BCUNO)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&ECUNO)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&AREA)    TYPE(*CHAR) LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR045RS) PARM(&IN03 &BCUNO &ECUNO)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&BCUNO)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&ECUNO)
             SBMJOB     JOB(ARR045P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR045P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 6))   RTNVAR(&BCUNO)
             RTVDTAARA  DTAARA(*LDA (7 6))   RTNVAR(&ECUNO)
             RTVDTAARA  DTAARA(*LDA (1021 1))   RTNVAR(&AREA)
             OVRDBF     FILE(RCVDTL) TOFILE(RCVDTL) SHARE(*YES)
             OPNQRYF    FILE((RCVDTL)) QRYSLT('                 +
                          RVCUNO = %RANGE("' || &BCUNO || '"    +
                                          "' || &ECUNO || '") & +
                          RVNTCD *EQ " "                      & +
                          RVUSTP *EQ "A2"                     & +
                          RVACNO *EQ "1131"')                   +
                          KEYFLD((RVCUNO) (RVNO)(RVPBID))
             OVRPRTF    FILE(QPRINT) PAGESIZE(*N 142) CPI(12)
             CALL       PGM(ARR045R)
             CLOF       OPNID(RCVDTL)
             DLTOVR     FILE(*ALL)
             ENDPGM
