             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&DATE1) TYPE(*DEC) LEN(6)
             DCL        VAR(&DATE1A) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE2) TYPE(*DEC) LEN(6)
             DCL        VAR(&DATE2A) TYPE(*CHAR) LEN(6)
             DCL        VAR(&P#AREA) TYPE(*CHAR) LEN(1)

             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(ARR034RS) PARM(&IN03 &P#AREA &DATE1 &DATE2)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGVAR     VAR(&DATE1A) VALUE(&DATE1)
             CHGVAR     VAR(&DATE2A) VALUE(&DATE2)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&DATE1A)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&DATE2A)
             CHGDTAARA  DTAARA(*LDA (21 1)) VALUE(&P#AREA)
             SBMJOB     JOB(ARR034P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR034P')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (1 6))   RTNVAR(&DATE1A)
             RTVDTAARA  DTAARA(*LDA (7 6))   RTNVAR(&DATE2A)
             RTVDTAARA  DTAARA(*LDA (21 1))  RTNVAR(&P#AREA)
             CHGVAR     VAR(&DATE1) VALUE(&DATE1A)
             CHGVAR     VAR(&DATE2) VALUE(&DATE2A)
             OVRDBF     FILE(TRNDTL) TOFILE(TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) QRYSLT('             +
                          TXCODE *EQ "AR05"              &  +
                          TXFLAG *NE "D"                 &  +
                          %SST(TXNO 1 1) *EQ "' || &P#AREA || '" & +
                          TXDATE *EQ %RANGE(' || &DATE1A || '  +
                                            ' || &DATE2A || ') ') +
                          KEYFLD((TXDATE) (TXNO) (TXITEM))
             CALL       PGM(ARR034R)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)
             ENDPGM
