     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARR066P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02CLJ                                  */
     /*     4.FUNCTION     地磅與營業銷貨重量差異分析表           */
     /*     5.DATE-WRITTEN  86/06/29                                */
     /*                                                             */
     /*     本程式呼叫 ARP049P ARP050P 等程式                   */
     /*                                                             */
     /***************************************************************/
             PGM
             DCLF       FILE(ARR066S)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN12) TYPE(*LGL)  LEN(1)
             DCL        VAR(&AREA) TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(*LDA (951 34)) RTNVAR(&S#COMP)
             RTVDTAARA  DTAARA(*LDA (1011 10)) RTNVAR(&S#DEVI)
 INPUT:      SNDRCVF    RCDFMT(AR066F1)
             IF COND((&IN03 *EQ '1') *OR (&IN12 *EQ '1')) THEN(RETURN)
             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&AREA)
             CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE(&S#AREA)
             IF COND(&S#TYPE *EQ '1') THEN(CALL ARLIB/ARP049P)
             IF COND(&S#TYPE *EQ '2') THEN(CALL ARLIB/ARP050P)
             CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE(&AREA)
             CHGVAR     VAR(&S#MSG1) VALUE('報表已送至執行佇列中')
             GOTO       INPUT
             ENDPGM
