             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&W0101) TYPE(*CHAR) LEN(10)
             DCL        VAR(&W0102) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TXAR)  TYPE(*CHAR) LEN(1)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             OVRDBF     FILE(INVMST) TOFILE(ARLIB/INVMSTX) SHARE(*YES)
             CALL       PGM(ARR006RS) PARM(&IN03 &W0101 &W0102)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 10)) VALUE(&W0101)
             CHGDTAARA  DTAARA(*LDA (11 10)) VALUE(&W0102)
             SBMJOB     JOB(ARR006P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR006P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 10))    RTNVAR(&W0101)
             RTVDTAARA  DTAARA(*LDA (11 10))   RTNVAR(&W0102)
             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&TXAR)
             OPNQRYF    FILE((INVMST)) OPTION(*ALL) QRYSLT('     +
                          INPRTC *EQ " "                       & +
                          INAREA *EQ "' || &TXAR || '"         & +
                          INDECD *EQ " "                       & +
                          INNO *EQ %RANGE("' || &W0101 || '"  "' +
                          || &W0102 || '") ') KEYFLD((INNO))
             OVRPRTF    FILE(QPRINT) PAGESIZE(33 80) LPI(6) CPI(10) +
                          OVRFLW(33) HOLD(*YES)
             CALL       PGM(ARR006R)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
