             PGM        PARM(&W#ORNO)
             DCL        VAR(&INT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&W#ORNO)  TYPE(*CHAR) LEN(6)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             ENDDO
             OVRDBF     FILE(TRNDTL) TOFILE(TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) QRYSLT('       (TXCODE *EQ     +
                          "SA04") *and (T#ORNO    *EQ "'||            +
                          &W#ORNO||'")')                              +
                          MAPFLD((T#ORNO '%SST(TXORNO 1 6)' *CHAR 5)) +
                   KEYFLD((TXNO) (TXDATE) (TXPDNM) (TXUPRC) (TXIVNO))
             CALL       PGM(ARR065R1)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             OPNQRYF    FILE((INVMST))                                +
                        QRYSLT('(INORNO *EQ "'||&W#ORNO||'") *AND     +
                                (INDECD *NE "D")')                    +
                        KEYFLD((INNO) (ININDT))
             CALL       PGM(ARR065R2)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)
             ENDPGM
