             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&BCUNO)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&ECUNO)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&BORNO)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&EORNO)   TYPE(*CHAR) LEN(5)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
      CALL       PGM(LLR005RS) PARM(&IN03 &BCUNO &ECUNO &BORNO &EORNO)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGDTAARA  DTAARA(*LDA (1 6)) VALUE(&BCUNO)
             CHGDTAARA  DTAARA(*LDA (7 6)) VALUE(&ECUNO)
             CHGDTAARA  DTAARA(*LDA (13 5)) VALUE(&BORNO)
             CHGDTAARA  DTAARA(*LDA (18 5)) VALUE(&EORNO)
             SBMJOB     JOB(ARR030P) JOBD(CCJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL ARR030P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 6))   RTNVAR(&BCUNO)
             RTVDTAARA  DTAARA(*LDA (7 6))   RTNVAR(&ECUNO)
             RTVDTAARA  DTAARA(*LDA (13 5))  RTNVAR(&BORNO)
             RTVDTAARA  DTAARA(*LDA (18 5))  RTNVAR(&EORNO)
             OVRDBF     FILE(AFCBAL) TOFILE(AFCBAL) SHARE(*YES)
             OPNQRYF    FILE((AFCBAL)) QRYSLT('                 +
                          AFCUNO = %RANGE("' || &BCUNO || '"    "' +
                          || &ECUNO || '")') KEYFLD((AFCUNO) +
                          (AFORNO *ASCEND))
             OVRPRTF    FILE(QPRINT) PAGESIZE(*N 132) CPI(10) +
                          USRDTA('¹w¦¬§I²{')
             CALL       PGM(ARR030R)
             CLOF       OPNID(AFCBAL)
             DLTOVR     FILE(*ALL)
             ENDPGM
