     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARR133P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S02LBU                                  */
     /*     4.FUNCTION     客戶預收貨款核對明細表               */
     /*     5.DATE-WRITTEN  97/05/02                                */
     /*                                                             */
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN12)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&CUNO)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&ORNO)   TYPE(*CHAR) LEN(6)


             RTVJOBA    TYPE(&INT) OUTQ(&OUTQ)
             IF         COND(&INT *EQ '0') THEN(GOTO BATCH)

 RDSP:
             CHGVAR     VAR(&IN03)    VALUE('0')
             CHGVAR     VAR(&IN12)    VALUE('0')
             CALL       PGM(ARR133RS) PARM(&IN03 &CUNO &ORNO)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             CHGDTAARA  DTAARA(*LDA (301  6)) VALUE(&CUNO)
             CHGDTAARA  DTAARA(*LDA (307  6)) VALUE(&ORNO)

        /*   SBMJOB     JOB(ARR133P) JOBD(ARJOBD) OUTQ(&OUTQ)  +
                        RQSDTA('CALL ARR133P')     */
        /*   RETURN                                */

 BATCH:
             RTVDTAARA  DTAARA(*LDA (301  6)) RTNVAR(&CUNO)
             RTVDTAARA  DTAARA(*LDA (307  6)) RTNVAR(&ORNO)

             CLRPFM     FILE(ARLIB/ARR133F)

  /*訂單為空白*/
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             IF         COND((&ORNO *EQ '      ')   *AND +
                             (&CUNO *EQ '      '))  THEN(DO)
             OPNQRYF    FILE(INVMST) QRYSLT(' +
                              ((INTYPE *EQ "1")                 *OR   +
                               (INTYPE *EQ "2"))                *AND  +
                               (INDT   *GE "00941201")          *AND  +
                               (INDECD *NE "D")')                     +
                        MAPFLD((INDT ININDT *CHAR 8))                 +
                        KEYFLD((INCUNO)(INORNO))
             ENDDO

             IF         COND((&ORNO *EQ '      ')   *AND +
                             (&CUNO *NE '      '))  THEN(DO)
             OPNQRYF    FILE(INVMST) QRYSLT(' +
                              ((INTYPE *EQ "1")                 *OR   +
                               (INTYPE *EQ "2"))                *AND  +
                               (INCUNO *EQ "' || &CUNO || '")   *AND  +
                               (INDT   *GE "00941201")          *AND  +
                               (INDECD *NE "D")')                     +
                        MAPFLD((INDT ININDT *CHAR 8))                 +
                        KEYFLD((INCUNO)(INORNO))
             ENDDO

  /*訂單不為空白*/
             OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)
             IF         COND((&ORNO *NE '      ')   *AND +
                             (&CUNO *EQ '      '))  THEN(DO)
             OPNQRYF    FILE(INVMST) QRYSLT(' +
                              ((INTYPE *EQ "1")                 *OR   +
                               (INTYPE *EQ "2"))                *AND  +
                               (INORNO *EQ "' || &ORNO || '")   *AND  +
                               (INDT   *GE "00941201")          *AND  +
                               (INDECD *NE "D")')                     +
                        MAPFLD((INDT ININDT *CHAR 8))                 +
                        KEYFLD((INCUNO)(INORNO))
             ENDDO

             IF         COND((&ORNO *NE '      ')   *AND +
                             (&CUNO *NE '      '))  THEN(DO)
             OPNQRYF    FILE(INVMST) QRYSLT(' +
                              ((INTYPE *EQ "1")                 *OR   +
                               (INTYPE *EQ "2"))                *AND  +
                               (INORNO *EQ "' || &ORNO || '")   *AND  +
                               (INCUNO *EQ "' || &CUNO || '")   *AND  +
                               (INDT   *GE "00941201")          *AND  +
                               (INDECD *NE "D")')                     +
                        MAPFLD((INDT ININDT *CHAR 8))                 +
                        KEYFLD((INCUNO)(INORNO))
             ENDDO

             CALL       PGM(ARR133R1)
             CLOF       OPNID(INVMST)
             DLTOVR     FILE(*ALL)

             OVRDBF     FILE(ARR133F) TOFILE(ARR133F) SHARE(*YES)
             OPNQRYF    FILE(ARR133F) OPTION(*ALL) QRYSLT(' +
                               (W1TYPE *EQ "2")')                     +
                        KEYFLD((*FILE))
             CALL       PGM(ARR133R2)
             CLOF       OPNID(ARR133F)
             DLTOVR     FILE(*ALL)

             OVRPRTF    FILE(ARR133T) TOFILE(ARR133T) PAGESIZE(*N 158) +
                        CPI(12) HOLD(*YES) USRDTA('預收核對')
             OVRDBF     FILE(ARR133F) TOFILE(ARR133F) SHARE(*YES)
             OPNQRYF    FILE(ARR133F) +
                        KEYFLD((W1CUNO)(W1ORNO))
             CALL       PGM(ARR133R)
             CLOF       OPNID(ARR133F)
             DLTOVR     FILE(*ALL)

             ENDPGM
