        /*********************************************************************/
        /*                                                                   */
        /*        >>   PROGRAM INTRODUCTION  <<                              */
        /*        1.PROGRAM-ID     ARR116P                                   */
        /*        2.PROGRAM-TYPE   CLP                                       */
        /*        3.AUTHOR         S02CSF                                    */
        /*        4.FUNCTION      出貨及發票明細表─ＦＯＲ型鋼             */
        /*        5.DATE-WRITTEN   93/06/10                                  */
        /*        6.DATE-MODIFY    94/09/16                                  */
        /*                                                                   */
        /*     940916新增不同資料挑選方式                                  */
        /*********************************************************************/
             PGM
             DCL      VAR(&TYPE)   TYPE(*CHAR) LEN(1)
             DCL      VAR(&P#IN03) TYPE(*CHAR) LEN(1)
             DCL      VAR(&U#OPT1) TYPE(*CHAR) LEN(1)
             DCL      VAR(&U#APNO) TYPE(*CHAR) LEN(7)
             DCL      VAR(&U#OPT2) TYPE(*CHAR) LEN(1)
             DCL      VAR(&U#CUNO) TYPE(*CHAR) LEN(6)
             DCL      VAR(&U#ORN1) TYPE(*CHAR) LEN(6)
             DCL      VAR(&U#ORN2) TYPE(*CHAR) LEN(6)
             DCL      VAR(&U#OPT3) TYPE(*CHAR) LEN(1)
             DCL      VAR(&U#RCNO) TYPE(*CHAR) LEN(6)
             DCL      VAR(&S#DEVN) TYPE(*CHAR) LEN(10)
             DCL      VAR(&S#USER) TYPE(*CHAR) LEN(10)

             RTVJOBA  JOB(&S#DEVN) USER(&S#USER) TYPE(&TYPE)
             IF       COND(&TYPE *EQ '0') THEN(GOTO BATCH)

             CALL     PGM(ARR116RS) PARM(&P#IN03)
             IF       COND(&P#IN03 *EQ '1') THEN(RETURN)

             SBMJOB     CMD(CALL PGM(ARR116P)) JOB(ARR116P) +
                        JOBD(ARJOBD)
             RETURN
 BATCH:
             RTVDTAARA  DTAARA(*LDA (300  1)) RTNVAR(&U#OPT1)
             RTVDTAARA  DTAARA(*LDA (301  7)) RTNVAR(&U#APNO)
             RTVDTAARA  DTAARA(*LDA (308  1)) RTNVAR(&U#OPT2)
             RTVDTAARA  DTAARA(*LDA (309  6)) RTNVAR(&U#CUNO)
             RTVDTAARA  DTAARA(*LDA (315  6)) RTNVAR(&U#ORN1)
             RTVDTAARA  DTAARA(*LDA (321  6)) RTNVAR(&U#ORN2)
             RTVDTAARA  DTAARA(*LDA (327  1)) RTNVAR(&U#OPT3)
             RTVDTAARA  DTAARA(*LDA (328  6)) RTNVAR(&U#RCNO)

             IF         COND(&U#OPT1   *EQ  'Y')  THEN(DO)
             CALL       PGM(ARR116P1)
             ENDDO
             IF         COND(&U#OPT2   *EQ  'Y')  THEN(DO)
             CALL       PGM(ARR116P2)
             ENDDO
             IF         COND(&U#OPT3   *EQ  'Y')  THEN(DO)
             CALL       PGM(ARR116P3)
             ENDDO


             ENDPGM
