     /****************************************************************/
     /*                                                              */
     /*            *****   PROGRAM INTRODUCTION   *****              */
     /*                                                              */
     /*            1.PROGRAM-ID    ARR137P                           */
     /*            2.PROGRAM-TYPE  CLS                               */
     /*            3.AUTHOR        S00WCJ                            */
     /*            4.FUNCTION     發票檢核總表                 */
     /*            5.DATE-WRITTEN  100/12/15 2011AR636               */
     /*                                                              */
     /****************************************************************/
             PGM
             DCL        VAR(&INT)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DEVNM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&COMP)   TYPE(*CHAR) LEN(35)
             DCL        VAR(&DEVNM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S#AREA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&W#YYS)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&W#YYE)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&S#ERR)  TYPE(*CHAR) LEN(70)
             DCL        VAR(&W#ERR)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&W#STS)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&W#STE)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&W#AREA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&W#TYPS) TYPE(*CHAR) LEN(2)
             DCL        VAR(&W#TYPE) TYPE(*CHAR) LEN(2)
             DCLF       FILE(ARR137S)

             RTVJOBA   TYPE(&INT)
             IF         COND(&INT *EQ '0') THEN(GOTO CMDLBL(BATCH))
             RTVDTAARA  DTAARA(*LDA (1011 10)) RTNVAR(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&S#AREA)
             RTVDTAARA  DTAARA(*LDA (1021 1)) RTNVAR(&W#AREA)

 START:

             SNDRCVF    RCDFMT(TITLE)

             CHGVAR     VAR(&IN41)  VALUE('0')
             CHGVAR     VAR(&IN42)  VALUE('0')
     /*      CHGVAR     VAR(&IN43)  VALUE('0')  */
             CHGVAR     VAR(&S#ERR)  VALUE(' ')

             IF         COND(&IN03 *OR &IN12) THEN(RETURN)


                 IF      COND(&S#YYS  *EQ '0') THEN(DO)
                      CHGVAR   VAR(&S#ERR)  VALUE('訊息-欄位+
                             不可空白!')
                      CHGVAR   VAR(&IN41)   VALUE('1')
                      GOTO     CMDLBL(START)
                 ENDDO



             IF      COND(&S#YYS  *NE '0'  *AND &S#YYE  *EQ '0') THEN(DO)
                   CHGVAR  VAR(&S#YYE)   VALUE(&S#YYE)
             ENDDO


             IF       COND(&S#YYS  *GT &S#YYE)  THEN(DO)
                   CHGVAR  VAR(&S#ERR) VALUE('訊息-年度區間錯誤!')
                   CHGVAR  VAR(&IN41)  VALUE('1')
                   CHGVAR  VAR(&IN42)  VALUE('1')
                   GOTO     CMDLBL(START)
             ENDDO

   /*        IF       COND(&W#AREA *NE &S#AREA) THEN(DO)   */
   /*              CHGVAR  VAR(&S#ERR) VALUE('無法跑跨廠區之資料!!') */
    /*             CHGVAR  VAR(&IN43)  VALUE('1')  */
    /*             GOTO     CMDLBL(START)    */
    /*       ENDDO              */

             CHGVAR     VAR(&W#YYS)     VALUE(&S#YYS)
             CHGVAR     VAR(&W#YYE)     VALUE(&S#YYE)
             CHGVAR   VAR(&W#STS)  VALUE(&S#AREA *CAT &S#YYS *CAT '01')
             CHGVAR   VAR(&W#STE)  VALUE(&S#AREA *CAT &S#YYE *CAT '12')
             CHGDTAARA  DTAARA(*LDA (1 4)) VALUE(&W#YYS)
             CHGDTAARA  DTAARA(*LDA (5 4)) VALUE(&W#YYE)
             CHGDTAARA  DTAARA(*LDA (9 1)) VALUE(&S#AREA)
             CHGDTAARA  DTAARA(*LDA (10 1)) VALUE(&S#TYPE)
             CHGDTAARA  DTAARA(*LDA (11 10)) VALUE(&W#STS)
             CHGDTAARA  DTAARA(*LDA (21 10)) VALUE(&W#STE)



INPUT:

             SBMJOB     CMD(CALL PGM(ARR137P)) JOB(ARR137P) +
                          JOBD(ARJOBD)
             SNDBRKMSG  MSG('<<發票號碼檢核總表，已開始處理+
                         ,請稍待.........>>') +
                       TOMSGQ(%SST(*LDA 1011 10)) MSGTYPE(*INFO)
             RETURN


BATCH:
             RTVDTAARA  DTAARA(*LDA (1  4)) RTNVAR(&W#YYS)
             RTVDTAARA  DTAARA(*LDA (5  4)) RTNVAR(&W#YYE)
             RTVDTAARA  DTAARA(*LDA (9  1)) RTNVAR(&S#AREA)
             RTVDTAARA  DTAARA(*LDA (10 1)) RTNVAR(&S#TYPE)
             RTVDTAARA  DTAARA(*LDA (11 10)) RTNVAR(&W#STS)
             RTVDTAARA  DTAARA(*LDA (21 10)) RTNVAR(&W#STE)

          IF   COND(&S#TYPE *EQ '1') THEN(DO)
              CHGVAR     VAR(&W#TYPS)  VALUE('01')
              CHGVAR     VAR(&W#TYPE)  VALUE('01')
          ENDDO

          IF   COND(&S#TYPE *EQ '2') THEN(DO)
              CHGVAR     VAR(&W#TYPS)  VALUE('02')
              CHGVAR     VAR(&W#TYPE)  VALUE('02')
          ENDDO

          IF   COND(&S#TYPE *EQ ' ') THEN(DO)
              CHGVAR     VAR(&W#TYPS)  VALUE('01')
              CHGVAR     VAR(&W#TYPE)  VALUE('02')
          ENDDO


             OVRPRTF    FILE(ARR137T) TOFILE(ARR137T) PAGESIZE(*N +
                          132) CPI(10) HOLD(*YES) USRDTA('發票檢核')

             OVRDBF     FILE(GENSEQ)  TOFILE(GENSEQ) SHARE(*YES)

             OPNQRYF    FILE(GENSEQ) +
                        QRYSLT('(GEKIND *GE "' || &W#TYPS || '" *AND +
                                GEKIND *LE "' || &W#TYPE || '" *AND +
                                GEPRIN *GE "' || &W#STS || '" *AND +
                                GEPRIN *LE "' || &W#STE || '"  +
                                )')  +
                                KEYFLD((GEKIND) (GEPRIN))

 /*  CPYFRMQRYF   FROMOPNID(GENSEQ)  TOFILE(S00WCJ/GENT) +
          MBROPT(*REPLACE) CRTFILE(*YES)    */

             CALL       ARR137R
             CLOF       GENSEQ
             DLTOVR     *ALL

             SNDBRKMSG  MSG('<<發票號碼檢核總表已完成+
                        ,請列印.........>>') +
                      TOMSGQ(%SST(*LDA 1011 10)) MSGTYPE(*INFO)
             ENDPGM
