             PGM
             DCLF       FILE(ARS051)
             RTVJOBA    JOB(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
 RDSPLY:     SNDRCVF    RCDFMT(AR00F1)
             IF         COND(&OPTION *EQ 11) THEN(CALL PGM(ARR055P))
             IF         COND(&OPTION *EQ 12) THEN(CALL PGM(CCR008P))
             IF         COND(&OPTION *EQ 13) THEN(CALL PGM(ARR066P))
             IF         COND(&OPTION *EQ 14) THEN(CALL PGM(ARR067P))
             IF         COND(&OPTION *EQ 15) THEN(CALL PGM(ARR068P))
             IF         COND(&OPTION *EQ 16) THEN(CALL PGM(ARR069P))
             IF         COND(&OPTION *EQ 17) THEN(CALL PGM(ARR065R))
             IF         COND(&OPTION *EQ 70) THEN(CALL PGM(PRTMENU))
             IF         COND(&OPTION *EQ 80) THEN(RETURN)
             IF         COND(&OPTION *EQ 90) THEN(SIGNOFF)
             GOTO       CMDLBL(RDSPLY)
ENDCLPGM:    ENDPGM
