             PGM
             DCLF       FILE(ARS120)
             RTVJOBA    JOB(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
 RDSPLY:     SNDRCVF    RCDFMT(AR00F1)
             IF         COND(&OPTION *EQ 1) THEN(CALL PGM(ARE004R))
             IF         COND(&OPTION *EQ 2) THEN(CALL PGM(ARE005R))
             IF         COND(&OPTION *EQ 3) THEN(CALL PGM(ARE009R))
             IF         COND(&OPTION *EQ 4) THEN(CALL PGM(ARE013R))
             IF         COND(&OPTION *EQ 5) THEN(CALL PGM(ARE014R))
             IF         COND(&OPTION *EQ 6) THEN(CALL PGM(ARR041P))
             IF         COND(&OPTION *EQ 7) THEN(CALL PGM(ARR042P))
             IF         COND(&OPTION *EQ 8) THEN(CALL PGM(ARR013P))
             IF         COND(&OPTION *EQ 9) THEN(DO)
                        CHGDTAARA  DTAARA(*LDA (1 1)) VALUE('F')
                        CALL  PGM(ARE001R)
                        ENDDO
             IF         COND(&OPTION *EQ 10) THEN(CALL PGM(ARE013R1))
             IF         COND(&OPTION *EQ 11) THEN(CALL PGM(ARE028R))
             IF         COND(&OPTION *EQ 12) THEN(CALL PGM(ARE017R))

             IF         COND(&OPTION *EQ 50) THEN(CALL PGM(ARS121P))
             IF         COND(&OPTION *EQ 70) THEN(CALL PGM(PRTMENU))
             IF         COND(&OPTION *EQ 80) THEN(RETURN)
             IF         COND(&OPTION *EQ 90) THEN(SIGNOFF)
             GOTO       CMDLBL(RDSPLY)
ENDCLPGM:    ENDPGM
