             PGM
             DCLF       FILE(ARS170)
             RTVJOBA    JOB(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
 RDSPLY:     SNDRCVF    RCDFMT(AR00F1)
             IF         COND(&OPTION *EQ 1) THEN(CALL PGM(ARR014P))
             IF         COND(&OPTION *EQ 2) THEN(CALL PGM(ARR017P))
             IF         COND(&OPTION *EQ 3) THEN(CALL PGM(ARR015P))
             IF         COND(&OPTION *EQ 4) THEN(CALL PGM(ARR016P))
             IF         COND(&OPTION *EQ 5) THEN(CALL PGM(ARR018P))
             IF         COND(&OPTION *EQ 6) THEN(CALL PGM(ARR079P))
             IF         COND(&OPTION *EQ 7) THEN(CALL PGM(ARQ014R))
             IF         COND(&OPTION *EQ 8) THEN(CALL PGM(ARR036P))
             IF         COND(&OPTION *EQ 9) THEN(CALL PGM(ARR081P))
             IF         COND(&OPTION *EQ 10) THEN(CALL PGM(ARR082P))

             IF         COND(&OPTION *EQ 70) THEN(CALL PGM(PRTMENU))
             IF         COND(&OPTION *EQ 80) THEN(RETURN)
             IF         COND(&OPTION *EQ 90) THEN(SIGNOFF)
             GOTO       CMDLBL(RDSPLY)
ENDCLPGM:    ENDPGM
