     /****************************************************************/
     /*                                                              */
     /*            *****   PROGRAM INTRODUCTION   *****              */
     /*                                                              */
     /*            1.PROGRAM-ID    MTS777P                           */
     /*            2.PROGRAM-TYPE  CLP                               */
     /*            3.AUTHOR        S00TPC                            */
     /*            4.FUNCTION     跋丁籹布秨˙(IFRS˙ROC)  */
     /*            5.DATE-WRITTEN  100/11/08 1001108MT S00TPC        */
     /*                                                              */
     /****************************************************************/
     /******肚把计                                               */
     /*      &P#AREA=秨ミ紅跋                                      */
     /*      &P#YY  =                                          */
     /*      &P#TRNS=癬﹍籹布腹絏                                  */
     /*      &P#TRNE=沧ゎ籹布腹絏                                  */
     /******肚把计                                               */
     /*      礚                                                    */
     /****************************************************************/
             PGM        PARM(&P#AREA &P#YY &P#TRNS &P#TRNE)
             DCL        VAR(&P#AREA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P#YY)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&P#TRNS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P#TRNE) TYPE(*CHAR) LEN(10)

             /*IFRS籹布郎*/
             OVRDBF     FILE(GLTRANN) TOFILE(ACLIBN/('GL' || &P#AREA || 'R'))
             /*ROC 籹布郎*/
             OVRDBF     FILE(GLTRAN)  TOFILE(*LIBL/('GL' || &P#AREA || 'R'))
             /*IFRS˙ROC籹布郎*/
             CALL       PGM(ARS777R) PARM(&P#AREA &P#YY &P#TRNS &P#TRNE)
             DLTOVR     FILE(*ALL)
             ENDPGM
