             PGM
             DCLF       FILE(ARS999)
             RTVJOBA    JOB(&DEVNM)
             RTVDTAARA  DTAARA(*LDA (951 35)) RTNVAR(&COMP)
 RDSPLY:     SNDRCVF    RCDFMT(AR00F1)
             IF         COND(&OPTION *EQ 1) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('P')
             TFRCTL     PGM(ARS100P)
             ENDDO
             IF         COND(&OPTION *EQ 2) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('M')
             TFRCTL     PGM(ARS100P)
             ENDDO
             IF         COND(&OPTION *EQ 3) THEN(DO)
             CHGDTAARA  DTAARA(*LDA (1021 1)) VALUE('L')
             TFRCTL     PGM(ARS100P)
             ENDDO
             IF         COND(&OPTION *EQ 70) THEN(CALL PGM(PRTMENU))
     /*      IF         COND(&OPTION *EQ 80) THEN(RETURN)   */
             IF         COND(&OPTION *EQ 80) THEN(TFRCTL PGM(RETURNP))
             IF         COND(&OPTION *EQ 90) THEN(SIGNOFF)
             GOTO       CMDLBL(RDSPLY)
ENDCLPGM:    ENDPGM
