             PGM
             DCL        VAR(&YYA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YY)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MM)  TYPE(*DEC)  LEN(2 0)
             CHGJOB     RUNPTY(25)
             CLRPFM     FILE(CCLIB/ARSTAT)
          /* 参璸秨祇布*/
             OVRDBF     FILE(SAMAST) TOFILE(DALIB/SAMAST)
             OVRDBF     FILE(SACUST) TOFILE(DALIB/SACUST)
             OVRDBF     FILE(ARSTAT) TOFILE(CCLIB/ARSTAT)
             OVRDBF     FILE(INVDTL) TOFILE(DALIB/INVDTL) SHARE(*YES)
             OPNQRYF    FILE((INVDTL)) QRYSLT('IVACDT *LE 830930') +
                          KEYFLD((IVRESV) (IVNO)) MAPFLD((IVRESV +
                          '%SST(IVORNO 1 5)'))
             CALL       PGM(CNV013R)
             CLOF       OPNID(INVDTL)
             DLTOVR     FILE(*ALL)
          /* 参璸ゼ秨祇布*/
             OVRDBF     FILE(ARSTAT) TOFILE(CCLIB/ARSTAT)
             OVRDBF     FILE(TRNDTL) TOFILE(DALIB/TRNDTL) SHARE(*YES)
             OPNQRYF    FILE((TRNDTL)) QRYSLT('                  +
                           TXFL02  *EQ " "    *AND               +
                           TXACDT  *LE 830930 *AND               +
                          (TXCODE = "SA04" *OR TXCODE = "AR05")') +
                          KEYFLD((TXRESV)(TXNO)(TXACNT))  +
                      MAPFLD((TXRESV '%SST(TXORNO 1 5)'))
             CALL       PGM(CNV013RA)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)

             ENDPGM
