             PGM
             DCL        VAR(&YYA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YY)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MM)  TYPE(*DEC)  LEN(2 0)
             CHGJOB     RUNPTY(25)

             DLTF       FILE(QTEMP/TYDDM)
             MONMSG     CPF0000
             DLTF       FILE(QTEMP/MLDDM)
             MONMSG     CPF0000
             DLTF       FILE(QTEMP/KSDDM)
             MONMSG     CPF0000

             CRTDUPOBJ  OBJ(TYDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                        TOLIB(QTEMP)
             CRTDUPOBJ  OBJ(MLDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                        TOLIB(QTEMP)
             CRTDUPOBJ  OBJ(KSDDM) FROMLIB(QGPL) OBJTYPE(*FILE) +
                        TOLIB(QTEMP)

 TYN:     /*    TRANSFER TO TOUYAN  */
             CHGDDMF    FILE(QTEMP/TYDDM) RMTFILE(DALIB/ARSTATTM)
             CPYF       FROMFILE(CCLIB/ARSTAT) TOFILE(QTEMP/TYDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
             SBMRMTCMD  CMD('cpyf fromfile(dalib/arstattm) +
                          tofile(dalib/arstat) mbropt(*replace)') +
                          DDMFILE(QTEMP/TYDDM)
             MONMSG     MSGID(CPF0000)
          /*    TRANSFER TO KOUSHUN */

 KOR:        CHGDDMF    FILE(QTEMP/KSDDM) RMTFILE(DALIB/ARSTATTM)
             CPYF       FROMFILE(CCLIB/ARSTAT) TOFILE(QTEMP/KSDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
             SBMRMTCMD  CMD('cpyf fromfile(dalib/arstattm) +
                          tofile(dalib/arstat) mbropt(*replace)') +
                          DDMFILE(QTEMP/KSDDM)
             MONMSG     MSGID(CPF0000)
          /*    TRANSFER TO KOUSHUN */

 MIL:        CHGDDMF    FILE(QTEMP/MLDDM) RMTFILE(DALIB/ARSTATTM)
             CPYF       FROMFILE(CCLIB/ARSTAT) TOFILE(QTEMP/MLDDM) +
                          MBROPT(*REPLACE) INCCHAR(*RCD 18 *EQ 'H')
             MONMSG     MSGID(CPF0000)
             SBMRMTCMD  CMD('cpyf fromfile(dalib/arstattm) +
                          tofile(dalib/arstat) mbropt(*replace)') +
                          DDMFILE(QTEMP/MLDDM)
             MONMSG     MSGID(CPF0000)
             /*   處理授信系統  */
 GUAD:       RTVSYSVAL  SYSVAL(QYEAR) RTNVAR(&YYA)
             RTVSYSVAL  SYSVAL(QMONTH) RTNVAR(&MMA)
             CHGVAR     VAR(&YY) VALUE(&YYA)
             CHGVAR     VAR(&MM) VALUE(&MMA)
             CHGDTAARA  DTAARA(*LDA (5 2)) VALUE('01')
             CHGDTAARA  DTAARA(*LDA (11 2)) VALUE('31')
             CHGDTAARA  DTAARA(*LDA (7 2)) VALUE(&YYA)
             CHGDTAARA  DTAARA(*LDA (9 2)) VALUE(&MMA)
             IF         COND(&MM *EQ 1) THEN(DO)
                        CHGVAR  VAR(&MM)  VALUE(12)
                        CHGVAR  VAR(&YY)  VALUE(&YY - 1)
                        ENDDO
             ELSE  DO
                        CHGVAR  VAR(&MM)  VALUE(&MM - 1)
                   ENDDO
             CHGVAR     VAR(&YYA) VALUE(&YY)
             CHGVAR     VAR(&MMA) VALUE(&MM)
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&YYA)
             CHGDTAARA  DTAARA(*LDA (3 2)) VALUE(&MMA)
           /*  處理存入保證金－訂單*/
             CALL         PGM(CCLIB/CCP010P)
             MONMSG     MSGID(CPF0000)
              /* TRANSFER TO TOUYAN  */
             CHGDDMF    FILE(QTEMP/TYDDM) RMTFILE(DALIB/CGDDTL)
             CPYF       FROMFILE(DALIB/CGDDTL) TOFILE(QTEMP/TYDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
              /* TRANSFER TO KOUSHUN */

             CHGDDMF    FILE(QTEMP/KSDDM) RMTFILE(DALIB/CGDDTL)
             CPYF       FROMFILE(DALIB/CGDDTL) TOFILE(QTEMP/KSDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
              /* TRANSFER TO MIL     */

             CHGDDMF    FILE(QTEMP/MLDDM) RMTFILE(DALIB/CGDDTL)
             CPYF       FROMFILE(DALIB/CGDDTL) TOFILE(QTEMP/MLDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
           /*  處理預收貨款餘額－訂單*/
             CALL         PGM(CCLIB/CCP011P)
             MONMSG     MSGID(CPF0000)
              /* TRANSFER TO TOUYAN  */
             CHGDDMF    FILE(QTEMP/TYDDM) RMTFILE(DALIB/CPRBAL)
             CPYF       FROMFILE(DALIB/CPRBAL) TOFILE(QTEMP/TYDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
             CHGDDMF    FILE(QTEMP/TYDDM) RMTFILE(DALIB/CPRDTL)
             CPYF       FROMFILE(DALIB/CPRDTL) TOFILE(QTEMP/TYDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)

              /* TRANSFER TO KOUSHUN */
             CHGDDMF    FILE(QTEMP/KSDDM) RMTFILE(DALIB/CPRBAL)
             CPYF       FROMFILE(DALIB/CPRBAL) TOFILE(QTEMP/KSDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
             CHGDDMF    FILE(QTEMP/KSDDM) RMTFILE(DALIB/CPRDTL)
             CPYF       FROMFILE(DALIB/CPRDTL) TOFILE(QTEMP/KSDDM) +
                          MBROPT(*REPLACE)
              /* TRANSFER TO MIL     */
             CHGDDMF    FILE(QTEMP/MLDDM) RMTFILE(DALIB/CPRBAL)
             CPYF       FROMFILE(DALIB/CPRBAL) TOFILE(QTEMP/MLDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
             CHGDDMF    FILE(QTEMP/MLDDM) RMTFILE(DALIB/CPRDTL)
             CPYF       FROMFILE(DALIB/CPRDTL) TOFILE(QTEMP/MLDDM) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF0000)
           /*  處理客戶授信餘額*/
             SBMJOB     CMD(CALL PGM(CCLIB/CCP000P)) JOB(CCP000P) +
                          JOBD(CCJOBD) JOBQ(QCTL) LOG(4 0 *SECLVL) +
                          LOGCLPGM(*YES) MSGQ(*USRPRF)
             MONMSG     MSGID(CPF0000)
           /*  處理客戶出貨狀況*/
             SBMJOB     CMD(CALL PGM(CCLIB/CCP001P)) JOB(CCP001P) +
                          JOBD(CCJOBD) JOBQ(QCTL) LOG(4 0 *SECLVL) +
                          LOGCLPGM(*YES) MSGQ(*USRPRF)
             MONMSG     MSGID(CPF0000)

             ENDPGM
