             PGM
             DCL        VAR(&INT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MBR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL)  LEN(1)
             DCL        VAR(&YM)    TYPE(*DEC) LEN(4 0)
             DCL        VAR(&YMA)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&YMDA)  TYPE(*CHAR) LEN(6)
             RTVJOBA    OUTQ(&OUTQ) TYPE(&INT)
             IF         COND(&INT *EQ '1') THEN(DO)
             CALL       PGM(CNV030RS) PARM(&IN03 &YM)
             IF         COND(&IN03 *EQ '1') THEN(RETURN)
             CHGVAR     VAR(&YMA)   VALUE(&YM)
             CHGDTAARA  DTAARA(*LDA (1 4)) VALUE(&YMA)
             SBMJOB     JOB(CNV031P) JOBD(ARJOBD) OUTQ(&OUTQ) +
                          RQSDTA('CALL CNV031P')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (1 4))   RTNVAR(&YMA)
             CHGVAR     VAR(&MBR)    VALUE("L" || &YMA)
             CHGVAR     VAR(&YMDA)   VALUE(&YMA || '31')
             CLRPFM     FILE(ARLIB/ARSTWF) MBR(&MBR)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM +
                          FILE(ARLIB/ARSTWF) MBR(&MBR))
             OVRDBF     FILE(ARSTWF) TOFILE(ARLIB/ARSTWF) MBR(&MBR)
             OVRDBF     FILE(TRNDTL) TOFILE(DALIB/TRNDTL) SHARE(*YES)
             OVRDBF     FILE(INVMST) TOFILE(DALIB/INVMST)
             OPNQRYF    FILE((TRNDTL)) QRYSLT('                  +
                           TXACDT *LE ' || &YMDA || '  &          +
                          (TXCODE = "SA04" *OR TXCODE = "AR05")') +
                          KEYFLD((TXRESV)(TXNO)(TXACNT))  +
                      MAPFLD((TXRESV '%SST(TXORNO 1 5)'))
             CALL       PGM(CNV031R)
             CLOF       OPNID(TRNDTL)
             DLTOVR     FILE(*ALL)
             OVRDBF     FILE(ARSTWF) TOFILE(ARLIB/ARSTWF) MBR(&MBR)  +
                        SHARE(*YES)
             OPNQRYF    FILE((ARSTWF))                          +
                          KEYFLD((ASCUNM)(ASORNO)(ASRVID))
             CALL       PGM(ARR054R)
             CLOF       OPNID(ARSTWF)
             DLTOVR     FILE(*ALL)
             ENDPGM
