     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    CNVARBTAX                               */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     110跨年度發票作廢補寫ARBTAX        */
     /*     5.DATE-WRITTEN  111/01/06                               */
     /*                                                             */
     /***************************************************************/
            PGM        PARM(&W#CHYN)
            DCL        VAR(&W#YMD)  TYPE(*CHAR)  LEN(8)
            DCL        VAR(&W#CHYN) TYPE(*CHAR)  LEN(1)

       IF          COND(&W#CHYN *EQ 'Y')  THEN(DO)


            CHGVAR     VAR(&W#YMD)   VALUE('01110106') /*發票作廢日*/

            OVRDBF     FILE(INVMST) TOFILE(INVMST) SHARE(*YES)

            OPNQRYF    FILE((INVMST)) OPTION(*ALL) QRYSLT('       +
                         (INDEDT *EQ "' || &W#YMD || '")') +
                         KEYFLD((INNO))
             CALL       PGM(CNVARBTAXR) PARM(&W#CHYN)
            CLOF       OPNID(INVMST)
            DLTOVR     FILE(*ALL)
       ENDDO
           ENDPGM
