     /***************************************************************/
     /*                                                             */
     /*               >>   PROGRAM INTRODUCTION   <<                */
     /*                                                             */
     /*     1.PROGRAM-ID    ARE111P                                 */
     /*     2.PROGRAM-TYPE  CLP/400                                 */
     /*     3.AUTHOR        S00WCJ                                  */
     /*     4.FUNCTION     更換請款單業務員作業                   */
     /*     5.DATE-WRITTEN  112/10/26                               */
     /*     6.UPDATE  DATE                                          */
     /*                                                             */
     /***************************************************************/
         PGM        PARM(&W#PY)
             DCL        VAR(&INT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&W#PY)  TYPE(*CHAR) LEN(1)

             OVRDBF     FILE(INVMSTG1) TOFILE(S00WCJ/INVMSTG1) SHARE(*YES)


             CALL       PGM(INVMSTG1R)  PARM(&W#PY)

             DLTOVR     FILE(*ALL)

             ENDPGM
