     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    SARCVFCVTR
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION    ARDSDT類別D，補上磅單項次
     H*            5.DATE-WRITTEN  103/06/04
     H*
     H*****************************************************************
     FARDSDT  UP  E           K        DISK
     FTRNDTLLDIF  E           K        DISK
     I            DS
     I                                        1  15 TXRESV
     I                                       13  14 D#TXIT
     C*****************************************************************
     C*          Parameter List
     C*****************************************************************
     C*P#PRC='Y'執行轉換
     C           *ENTRY    PLIST
     C                     PARM           P#PRC   1        *處理碼
     C*
     C           KEY01     KLIST
     C                     KFLD           ASTXNO
     C                     KFLD           ASDATE
     C                     KFLD           ASINNO
     C                     KFLD           ASPDNM
     C                     KFLD           ASQTY1
     C                     KFLD           ASPRC1
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C*
     C           P#PRC     IFNE 'Y'
     C                     MOVEL*ON       *INLR
     C                     ENDIF
     C*只做類別D之資料
     C           ASKIND    IFEQ 'D'
     C           KEY01     CHAINTXREC                50
     C  N50                MOVELD#TXIT    ASTXIT
     C  N50                UPDATRARDSDT
     C*
     C                     ENDIF
