     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARE006R1
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     折讓退回維護確認還原，回寫P
     A*                            ARDSDT & INETRN
     A*            5.DATE-WRITTEN  107/11/26 2018AR00030
     A*            6.UPDATE  DATE
     A*
     A****************************************************************
     H        1   Y                                     1                 BR003
     FARDSDTL4UF  E           K        DISK
     FINETRN  UF  E           K        DISK
     E*************************************************************
     C           *ENTRY    PLIST
     C                     PARM           W#TXNO  8
     C                     PARM           W#POMD  3
     C***************************************************************
     C*
     C           W#POMD    IFEQ 'INE'
     C                     MOVELW#TXNO    W1TXNO 16
     C           W1TXNO    SETLLRINETRN
     C                     MOVEL*OFF      *IN56
     C           *IN56     DOWEQ*OFF
     C           W1TXNO    READERINETRN                  56
     C   56                LEAVE
     C                     DELETRINETRN
     C                     ENDDO
     C                     ENDIF
     C*
     C           W#POMD    IFEQ 'ARD'
     C           W#TXNO    SETLLRARDSDT
     C                     MOVEL*OFF      *IN56
     C           *IN56     DOWEQ*OFF
     C           W#TXNO    READERARDSDT                  56
     C   56                LEAVE
     C                     DELETRARDSDT
     C                     ENDDO
     C                     ENDIF
     C                     SETON                     LR
     C***************************************************************
