     H*****************************************************************
     H*
     H*            UPDATE  DATE  98/04/15 2009AR290 S00WCJ (9804A)
     H*                          99/08/23 2010AR517 S00WCJ (9908A)
     H*                         100/02/08 2011AR589 S00WCJ (0002A)
     H*                         104/07/17 S00WCJ (0407A)
     H*                         折讓資料依磅單分攤寫入ARDSDT
     H*                         104/08/14 2015AR951 S00WCJ (0408A)
     H*                         增加鋼種尺寸長度分攤方式
     H*                         104/09/01 S00WCJ (0409A)
     H*                          修正S1CHYN=空白之BUG
     H*                         104/10/02 S00WCJ (0410A)
     H*                          由於同一張磅單同鋼種會有二個不同產品
     H*                          代碼，計算數量、單價時，將產品代碼加
     H*                          入判斷
     H*                         104/10/05 2015AR953 S00WCJ (0409A)
     H*                          產品代碼3碼擴5碼
     H*                         104/12/09 S00WCJ (0412A)
     H*                          鋼種依尺寸分攤之折讓單，比照自動開立
     H*                          確認時直接做轉出之動作，避免請款及繳
     H*                          款後續發票金額問題
     H*                         105/02/23 S00WCJ (0502A)
     H*                          依鋼種尺寸分攤之折讓單做轉出時，以單
     H*                          據日期寫入發票明細，而非系統日
     H*                         105/10/23 S00WCJ (0510A)
     H*                          增加發票品名檢核及更改鋼筋分攤方式
     H*                         105/11/23 S00WCJ (0511A)
     H*                          增加種類3，品名不可空白
     H*                         106/05/02 2017AR10   S00WCJ (0605A)
     H*                          依尺寸分攤之折讓單，增加可輸入T1，
     H*                          並依輸入之尺寸分攤
     H*                         106/11/23 2017AR1112 S00WCJ (0611A)
     H*                          增加折讓種類欄位，確認時將資料寫入
     H*                          電子發票折讓單介面檔
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARE006S CF  E                    WORKSTN
     F                                        RRN   KSFILE SF1
9802 F                                        RRN2  KSFILE SF2
     FTRNDTL  UF  E           K        DISK                      A
     FINVMST  UF  E           K        DISK
     FINVMSTL2IF  E           K        DISK
     F            INREC                             KRENAMEINREC2
     FINVDTL  UF  E           K        DISK                      A
     FINVDTLL2IF  E           K        DISK
     F            IVREC                             KRENAMEIVREC2
0407AFINVDTLL4IF  E           K        DISK
0407AF            IVREC                             KRENAMEIVREC4
     FHIPROD  IF  E           K        DISK
     FCBCUST  IF  E           K        DISK
     FGENSEQ  UF  E           K        DISK                      A
0407AFTRNDTLLBIF  E           K        DISK
0407AF            TXREC                             KRENAMETRNDLB
0407AFARDSDTL1UF  E           K        DISK                      A
0407AFARDSDTL4UF  E           K        DISK
0407AF            RARDSDT                           KRENAMEARDSD4
0510AFARDSDTL5UF  E           K        DISK
0510AF            RARDSDT                           KRENAMEARDSD5
0510AFSRVOURL4IF  E           K        DISK
0408AFTRNDTS  UF  E           K        DISK                      A
0408AFHSVOUR  IF  E           K        DISK
0408AFHSMAST  IF  E           K        DISK
0408AFTRNDTLLGIF  E           K        DISK
0408AF            TXREC                             KRENAMETRNDLG
0611AFINETRN  O   E           K        DISK
     E*************************************************************
0510AE                    ERR     1  51 70
0611AE                    TY1     1   2 10
     I*************************************************************
0407AITRNDLB
0407AI              TXDATE                          T#DATE
0407AI              TXNO                            T#TXNO
0408AI              TXITEM                          T#ITEM
0407AI              TXCUNO                          T#CUNO
0407AI              TXCUNM                          T#CUNM
0407AI              TXORNO                          T#ORNO
0407AI              TXIVNO                          T#IVNO
0407AI              TXPDNM                          T#PDNM
0407AI              TXUPRC                          T#UPRC
0407AI              TXQTY                           T#QTY
0407AI              TXTAX                           T#TAX
0407AI              TXAMT                           T#AMT
0407AI              TXTXAR                          T#TXAR
0407AI              TXRESV                          T#RESV
     IIVREC2
     I              IVDECD                          F#DECD
     I              IVACDT                          F#ACDT
     I              IVACNT                          F#ACNT
     I              IVNO                            F#NO
     I              IVPDCD                          F#PDCD
     I              IVQTY                           F#QTY
     I              IVAMT                           F#AMT
     I*
0407AIIVREC4
0407AI              IVNO                            V#NO
0407AI              IVPDCD                          V#PDCD
0407AI              IVQTY                           V#QTY
0407AI              IVAMT                           V#AMT
0407AIARDSD4
0407AI              ASRESV                          R#RESV
0408AITRNDLG
0408AI              TXDATE                          T2DATE
0408AI              TXNO                            T2TXNO
0408AI              TXITEM                          T2ITEM
0408AI              TXCUNO                          T2CUNO
0408AI              TXCUNM                          T2CUNM
0408AI              TXORNO                          T2ORNO
0408AI              TXIVNO                          T2IVNO
0408AI              TXPDNM                          T2PDNM
0408AI              TXUPRC                          T2UPRC
0408AI              TXQTY                           T2QTY
0408AI              TXTAX                           T2TAX
0408AI              TXAMT                           T2AMT
0408AI              TXTXAR                          T2TXAR
0408AI              TXRESV                          T2RESV
     IINREC2
     I              INCUNO                          F#CUNO
     I              INCUNM                          F#CUNM
     I*
0510AIRSRVOUR
0510AI              S4FLAG                          O#FLAG
0510AI              S4TRCD                          O#TRCD
0510AI              S4VREA                          O#VREA
0510AI              S4PCOD                          O#PCOD
0510AI              S4DATE                          O#DATE
0510AI              S4VRNO                          O#VRNO
0510AI              S4VRTM                          O#VRTM
0510AI              S4CUNO                          O#CUNO
0510AI              S4CUST                          O#CUST
0510AI              S4ORNO                          O#ORNO
0510AI              S4PDNM                          O#PDNM
0510AI              S4NWGT                          O#NWGT
0510AI              S4OTNO                          O#OTNO
0510AI              S4DVNO                          O#DVNO
     I            DS
     I                                        1   6 CUST
     I                                        1   5 CUST1
     I                                        6   6 CUST2
     I                                       11  20 GRP
     I                                       11  11 GE1
     I                                       11  20 GE2
     I                                       21  26 NOG
     I                                       21  21 NOA
     I                                       22  260NOB
     IBBDS        DS
04091I                                        1  30 TXRESV
9710 I                                        1   6 TXACYM
     I                                       15  15 TXWHY
0611AI                                       18  18 D#TYPE
0409AI                                       41  45 IVRESV
0409AI                                       41  45 IVACYM
0407AI            DS
0409AI                                        1  30 T#RESV
0407AI                                       13  14 D#TXIT
0407AI            DS
0407AI                                        1  10 R#RESV
0407AI                                        1   1 D#DEL
0408AI            DS
0408AI                                        1   8 T#TXNO
0408AI                                        1   1 D#AREA
0408AI                                        2   3 D#VNO1
0408AI                                        4   80D#VNO2
0408AI            DS
0408AI                                        1   8 T2TXNO
0408AI                                        1   1 D2AREA
0408AI                                        2   3 D2VNO1
0408AI                                        4   80D2VNO2
0408AI            DS
0408AI                                        1   7 S4SPE5
0408AI                                        1   6 D#SPE5
0408AI            DS
0408AI                                        1   8 D#TXNO
0408AI                                        1   1 S4AREA
0408AI                                        2   3 S4VNO1
0408AI                                        4   80S4VNO2
0408AI            DS
0408AI                                        1   9 S4ORNO
0408AI                                        1   1 D1AREA
0408AI                                        2   60D1ORNO
0408AI                                        7   90D1ORTM
0605AI            DS
0605AI                                        1  30 TSRESV
0605AI                                        1   3 D#SPE3
0605AI            DS
0605AI                                        1  10 ASRESV
0605AI                                        8  10 D1SPE3
0412AI            DS
0412AI                                        1   80D#ACDT
0412AI                                        1   60D#ACYM
0412AI                                        7   80D#ACDD
0412AI                                        5   60D#ACMM
     I           UDS
     I                                      951 985 COMP
0407AI                                     10011010 T#USID
0408AI                                     10011001 T#USI1
0408AI                                     10011003 T#USI3
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           GEKEY     KLIST
     C                     KFLD           GEKIND
     C                     KFLD           GEPRIN
     C           TXKEY     KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C                     KFLD           TXITEM
     C           TX1KEY    KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C           IV2KEY    KLIST
     C                     KFLD           IVNO
     C                     KFLD           IVACNT
     C           IVKEY     KLIST
     C                     KFLD           IVNO
     C                     KFLD           IVACNT
     C                     KFLD           IVITEM
     C           CBKEY     KLIST
     C                     KFLD           CUST
0407AC           KEY01     KLIST
0407AC                     KFLD           IVNO
0407AC                     KFLD           W#PDCD
0407AC*
0407AC           KEY02     KLIST
0407AC                     KFLD           W1KIND
0407AC                     KFLD           W1TXNO
0407AC                     KFLD           W1TXIT
0408AC                     KFLD           TXNO
0408AC                     KFLD           TXITEM
     C*
0408AC           KEY03     KLIST
0408AC                     KFLD           D2AREA
0408AC                     KFLD           D2VNO1
0408AC                     KFLD           D2VNO2
0408AC*
0408AC           KEY04     KLIST
0408AC                     KFLD           D#AREA
0408AC                     KFLD           D#VNO1
0408AC                     KFLD           D#VNO2
0408AC                     KFLD           W1TXIT
0408AC*
0408AC           KEY05     KLIST
0408AC                     KFLD           D1AREA
0408AC                     KFLD           D1ORNO
0408AC                     KFLD           D1ORTM
     C*
0408AC           KEY06     KLIST
0408AC                     KFLD           D#AREA
0408AC                     KFLD           D#VNO1
0408AC                     KFLD           D#VNO2
     C*
0410AC           KEY07     KLIST
0410AC                     KFLD           IVNO
0410AC                     KFLD           PDNM
     C*
0510AC           KEY08     KLIST
0510AC                     KFLD           INVOX
0510AC                     KFLD           PDNM
0510AC*
0510AC           KEY09     KLIST
0510AC                     KFLD           T#ORNO
0510AC                     KFLD           D#AREA
0510AC                     KFLD           D#VNO1
0510AC                     KFLD           D#VNO2
0510AC*
0510AC           KEY10     KLIST
0510AC                     KFLD           TXNO
0510AC                     KFLD           TXITEM
     C*
     C**************************************************************
     C  N90                MOVE '1'       SCRN    1
     C  N90                MOVE '1'       *IN,90
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C           SCRN      CASEQ'1'       SR#01
     C           SCRN      CASEQ'2'       SR#02
9802 C           SCRN      CASEQ'3'       SR#03
     C                     ENDCS
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
     C**************************************************************
     CSR         SR#01     BEGSR
0408AC           T#USI1    IFEQ 'S'
0408AC           T#USI3    OREQ 'B05'
0408AC                     MOVEL*ON       *IN35
0408AC                     ELSE
0408AC                     MOVEL*OFF      *IN35
0408AC                     ENDIF
0408AC*
0408AC                     MOVEL'N'       S#CHYN
0408AC*
0611AC                     MOVEL'2'       S#TYPE
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99      CODE      IFEQ '6'
     C                     CALL 'ARR033P'
     C                     PARM           NO
     C                     FREE 'ARR033P'
     C                     MOVEL'1'       SCRN
     C                     MOVELERR,17    ERRMSG
     C                     ELSE
     C                     MOVE '2'       SCRN
0408AC   35                MOVEL*ON       *IN23
0408AC  N35                MOVEL*OFF      *IN23
     C                     EXSR PR#02
     C                     ENDIF
     C   99                MOVE '1'       SCRN
     CSR         SR#01Z    ENDSR
     C******
     CSR         SR#02     BEGSR
     C*
     C                     WRITEUND01
     C                     EXFMTSFCTL1
     C*
     C   KC                EXSR KC#01
     C   KL                MOVE '1'       SCRN
     C   KL                GOTO SR#02Z
     C   KJ                EXSR KJ#02
     C   KJ                GOTO SR#02Z
     C   08                EXSR KH#02                      載入
     C   08                GOTO SR#02Z
     C*
     C           CODE      IFEQ '1'
     C           CODE      OREQ '2'
     C                     EXSR CK#02
     C*
     C                     ELSE
     C           CODE      IFEQ '5'
     C                     EXSR CK#05
     C                     ENDIF
     C*
     C           CODE      IFEQ '4'
     C                     MOVE '1'       SCRN
     C                     ENDIF
     C                     ENDIF
     C*
     CSR         SR#02Z    ENDSR
     C*****************************************************************
     CSR         KC#01     BEGSR
     C*****************************************************************
     C                     SETON                     LR
     C                     RETRN
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         KJ#02     BEGSR
     C*****************************************************************
     C           CODE      IFEQ '1'
     C           CODE      OREQ '2'
     C                     EXSR CK#02
     C                     ENDIF
     C           CODE      IFEQ '5'
     C                     EXSR CK#05
     C                     ENDIF
     C  N99                EXSR FL#02
     C  N99                MOVE '1'       SCRN
     C*
     CSR         KJ#02Z    ENDSR
     C*****************************************************************
     CSR         KH#02     BEGSR
     C*****************************************************************
     C                     MOVEL'3'       SCRN
     C                     EXSR SR3100                     初始畫面三
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         SR#03     BEGSR
     C*****************************************************************
     C           S#SFN2    IFEQ 0
     C                     SETOF                     81
     C                     SETON                     8274
     C                     MOVELERR,31    S#ERR
     C                     ELSE                            有資料
     C                     SETOF                     8182
     C                     SETON                     74
     C                     ENDIF
     C*
     C                     WRITEUND02
     C                     EXFMTSFCTL2                     螢幕輸入
     C*
     C                     MOVE *BLANK    S#ERR
     C           S#CRN2    IFNE 0
     C                     Z-ADDS#CRN2    S#NBR2           記錄位置
     C                     ENDIF
     C*
     C                     SELEC
     C           *IN03     WHEQ '1'
     C                     EXSR KC#01                      結束
     C           *IN12     WHEQ '1'
     C                     MOVE '2'       SCRN             回前畫面
     C                     EXSR SR3110                     清挑選條件
     C           *IN05     WHEQ '1'
     C                     EXSR SR3400                     全部挑選
     C           *IN10     WHEQ '1'
     C                     EXSR SR3220                     重新合計
     C                     EXSR SR3200                     存檔
     C                     EXSR SR3110                     清挑選條件
     C                     OTHER
     C                     EXSR SR3300                     執行
     C                     ENDSL
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         SR3100    BEGSR
     C*****************************************************************
     C*INISR畫面三
     C                     MOVEL*BLANK    S#ERR
     C                     Z-ADD1         S#NBR2
     C                     SETON                     8182
     C                     WRITESFCTL2
     C*
     C                     Z-ADD0         S#SFN2
     C                     Z-ADD0         RRN2
     C                     Z-ADD0         S#SQTY
     C                     Z-ADD0         S#SAMT
     C                     Z-ADD0         S#STAX
     C                     MOVEL*BLANK    S#OPT
     C*
     CSR                   ENDSR
     C**************************************************************
     CSR         SR3110    BEGSR
     C**************************************************************
     C*清空畫面三挑選條件資料
     C*
     C                     MOVEL*BLANK    S#ORNO           訂單號碼
     C                     MOVEL*BLANK    W#ORNO
     C                     MOVEL*BLANK    S#ACNT           種類
     C                     MOVEL*BLANK    S#RESV           原因
     C                     MOVEL*BLANK    W#FLAG
     C                     Z-ADD0         S#UPRC
     C                     Z-ADD0         S#ACDS
     C                     Z-ADD0         W#ACDS
     C                     Z-ADD0         S#ACDE
     C                     Z-ADD0         W#ACDE
     C*
     CSR                   ENDSR
     C**************************************************************
     CSR         SR3200    BEGSR
     C**************************************************************
     C                     Z-ADD0         RRN2    30
     C                     Z-ADD0         RRN
     C                     Z-ADD0         W#SVN2  20
     C*
     C                     DO   S#SFN2
     C                     ADD  1         RRN2
     C           RRN2      CHAINSF2                  30
     C*
     C           S#OPT     IFEQ ' '
     C                     ITER
     C                     ENDIF
     C*
     C           1         DOWEQ1
     C                     ADD  1         RRN
     C*
     C           RRN       IFGT 10
     C                     MOVELERR,32    ERRMSG           項次超過
     C                     MOVEL'2'       SCRN
     C                     GOTO EN3200
     C                     ENDIF
     C*
     C           RRN       CHAINSF1                  30
     C           INVOX     IFEQ *BLANK
     C                     EXSR SR3210                     轉換內容
     C                     ADD  1         W#SVN2
     C                     UPDATSF1
     C                     LEAVE
     C                     ELSE
     C                     EXSR SR3211                     金額重新算
     C                     UPDATSF1
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDDO
     C                     MOVELERR,33    ERRMSG
     C                     MOVELW#SVN2    W#SVC2  2
     C           ERRMSG    CAT  W#SVC2:0  ERRMSG
     C           ES3200    TAG
     C*
     C                     MOVEL'2'       SCRN
     C*
     CSR         EN3200    ENDSR
     C**************************************************************
     CSR         SR3210    BEGSR
     C**************************************************************
     C*畫面三存檔搬移變數
     C*
     C                     Z-ADDRRN       ITEM             項次
     C                     Z-ADDS#QTY     QTY              數量
     C                     Z-ADDS#UPRC    UPRC             單價
     C                     MOVELS#INNO    INVOX            發票號碼
     C                     MOVELS#ACNT    ACNT             種類別
     C                     MOVELS#PDNO    PDNM             折讓品名
     C                     MOVELS#RESV    WHY              原因
     C                     MOVEL'A'       FLAG              FLAG碼
     C*
     C           UPRC      MULT QTY       AMT       H      金額
     C           AMT       MULT 0.05      TAX       H      稅額
     C*
     C                     ADD  AMT       TTLAMT
     C                     ADD  TAX       TTLTAX
9804AC                     ADD  QTY       TTLQTY
     C*
     CSR                   ENDSR
     C**************************************************************
     CSR         SR3211    BEGSR
     C**************************************************************
     C           UPRC      MULT QTY       AMT       H      金額
     C           AMT       MULT 0.05      TAX       H      稅額
     C*
     C           RRN       IFEQ 1
     C                     Z-ADD0         TTLAMT
     C                     Z-ADD0         TTLTAX
9804AC                     Z-ADD0         TTLQTY
     C                     ENDIF
     C*
     C                     ADD  AMT       TTLAMT
     C                     ADD  TAX       TTLTAX
9804AC                     ADD  QTY       TTLQTY
     C*
     CSR                   ENDSR
     C**************************************************************
     CSR         SR3220    BEGSR
     C**************************************************************
     C                     Z-ADD1         RRN
     C                     Z-ADD1         RRN2
     C                     Z-ADD0         TTLTAX
     C                     Z-ADD0         TTLAMT
9804AC                     Z-ADD0         TTLQTY
     C*
     C*重新合計畫面二金額、稅額
     C*
     C           1         DOWEQ1
     C           RRN       CHAINSF1                  31
     C*
     C   31                LEAVE
     C*
     C                     ADD  1         RRN
     C                     ADD  AMT       TTLAMT
     C                     ADD  TAX       TTLTAX
9804AC                     ADD  QTY       TTLQTY
     C                     ENDDO
     C*
     CSR                   ENDSR
     C**************************************************************
     CSR         SR3300    BEGSR
     C**************************************************************
     C*畫面三執行
     C*
     C*訂單或起訖日期不同時，則重新讀取資料
     C*
     C           S#ORNO    IFNE W#ORNO
     C           S#ACDS    ORNE W#ACDS
     C           S#ACDE    ORNE W#ACDE
     C                     MOVEL' '       W#FLAG  1
     C                     MOVELS#ORNO    W#ORNO  6
     C                     Z-ADDS#ACDS    W#ACDS  80
     C                     Z-ADDS#ACDE    W#ACDE  80
     C                     ELSE
     C                     MOVEL'X'       W#FLAG
     C                     ENDIF
     C*
     C           S#ORNO    IFEQ *BLANK                     訂單號碼
     C           S#ACNT    OREQ *BLANK                     種類別
     C           S#RESV    OREQ *BLANK                     原因
0408AC           *IN35     ANDEQ*OFF
     C           S#ACDS    OREQ 0                          發票起日
     C           S#ACDE    OREQ 0                          發票止日
     C           S#UPRC    OREQ 0                          平均單價
     C           W#FLAG    OREQ 'X'
     C                     GOTO EN3300
     C                     ELSE
     C                     EXSR SR3100
     C                     ENDIF
     C*
     C           S#ORNO    SETLLIVREC2
     C           1         DOWEQ1
     C           S#ORNO    READEIVREC2              N    30
     C   30                LEAVE
     C*
     C           F#ACDT    IFLT S#ACDS
     C           F#ACDT    ORGT S#ACDE
     C           F#DECD    OREQ 'D'
     C           F#ACNT    ORNE '1'
     C                     ITER
     C                     ENDIF
     C*
     C                     ADD  1         S#SFN2
     C                     ADD  1         RRN2
     C                     Z-ADDRRN2      S#ITEM           項次
     C                     MOVELF#NO      S#INNO           發票號碼
     C                     MOVELF#PDCD    S#PDNO           品名
     C                     Z-ADDF#QTY     S#QTY            數量
     C                     Z-ADDF#AMT     S#AMT            金額
     C           F#AMT     MULT 0.05      S#TAX     H      稅額
     C*
     C                     WRITESF2
     C                     ADD  S#QTY     S#SQTY           數量小計
     C                     ADD  S#AMT     S#SAMT           金額小計
     C                     ADD  S#TAX     S#STAX           稅額小計
     C                     ENDDO
     C*
     C                     MOVELS#ORNO    ORNO             訂單編號
     C                     MOVEL*OFF      *IN30
     C           S#ORNO    CHAININREC2              N30
     C  N30                MOVELF#CUNO    CUNO             客戶編號
     C  N30                MOVELF#CUNM    CUNM             客戶名稱
     C*
     CSR         EN3300    ENDSR
     C**************************************************************
     CSR         SR3400    BEGSR
     C**************************************************************
     C*畫面三發票資料全部挑選
     C*
     C                     Z-ADD0         RRN2
     C                     MOVE *OFF      *IN34
     C*
     C           1         DOWEQ1
     C                     ADD  1         RRN2
     C           RRN2      CHAINSF2                  34
     C*
     C   34                LEAVE
     C*
     C                     MOVEL'Y'       S#OPT
     C                     UPDATSF2
     C                     ENDDO
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         CK#01     BEGSR
     C*****************************************************************
     C                     SETOF                     414299
     C                     SETOF                     4369
     C                     MOVE *BLANK    ERRMSG
     C*
     C                     SELEC
     C           CODE      WHEQ ' '
     C                     SETON                     4199
     C                     MOVE ERR,1     ERRMSG
     C           CODE      WHEQ '1'
     C                     MOVE '新增'  MOD
     C                     MOVEA'01'      *IN,71
     C           CODE      WHEQ '2'
     C                     MOVE '更正'  MOD
     C                     MOVEA'01'      *IN,71
     C           CODE      WHEQ '3'
     C                     MOVE '刪除'  MOD
     C                     MOVEA'11'      *IN,71
     C                     MOVE '1'       *IN69
     C           CODE      WHEQ '4'
     C                     MOVE '查詢'  MOD
     C                     MOVEA'11'      *IN,71
     C                     MOVE '1'       *IN69
     C           CODE      WHEQ '5'
     C                     MOVE '確認'  MOD
     C                     MOVEA'10'      *IN,71
9908AC*                    Z-ADDUDATE     ACDT
9908AC           *DATE     SUB  19000000  ACDT
     C           CODE      WHEQ '6'
     C                     MOVE '列印'  MOD
     C                     MOVEA'11'      *IN,71
     C                     OTHER
     C                     SETON                     4199
     C                     MOVE ERR,2     ERRMSG
     C                     ENDSL
     C******
     C           CODE      IFNE '1'
     C           NO        IFEQ *BLANK
     C                     SETON                     4299
     C                     MOVE ERR,3     ERRMSG
     C                     ENDIF
     C                     ELSE
     C           NO        IFNE *BLANK
     C                     SETON                     4299
     C                     MOVE ERR,18    ERRMSG
     C                     ENDIF
0611AC  N99      *IN36     IFEQ *OFF
0611AC           S#TYPE    ANDNE'1'
0611AC                     SETON                     3699
0611AC                     MOVELERR,49    ERRMSG
0611AC                     ENDIF
     C                     ENDIF
     C**
     C           CODE      IFEQ '2'
     C           CODE      OREQ '3'
     C           CODE      OREQ '5'
     C           CODE      OREQ '6'
     C                     MOVELNO        NOAREA  1
     C           NOAREA    IFNE TXAR
     C                     SETON                     4299
     C                     MOVE ERR,23    ERRMSG
     C                     ENDIF
     C                     ENDIF
     C**
     C           *IN99     IFEQ '0'
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C                     Z-ADD1         TXITEM
9007 C*          TXKEY     CHAINTXREC               N97
YSH  C           TXKEY     SETLLTXREC                97
 .   C                     READ TXREC               N    97
 .   C           TXNO      IFNE NO
 .   C                     SETON                     97
 .   C                     ENDIF
     C                     SELEC
     C           CODE      WHEQ '1'
     C           *IN97     ANDEQ'0'
     C                     SETON                     4299
     C                     MOVE ERR,4     ERRMSG
     C           CODE      WHEQ '2'
     C           *IN97     ANDEQ'0'
     C           TXFL01    ANDNE' '
     C                     SETON                     4299
     C                     MOVE ERR,5     ERRMSG
     C           CODE      WHEQ '3'
     C           *IN97     ANDEQ'0'
     C           TXFL01    ANDNE' '
     C                     SETON                     4299
     C                     MOVE ERR,6     ERRMSG
     C           CODE      WHEQ '5'
     C           *IN97     ANDEQ'0'
     C           TXFL01    ANDEQ'Y'
     C                     SETON                     4299
     C                     MOVE ERR,10    ERRMSG
     C           CODE      WHNE '1'
     C           *IN97     ANDEQ'1'
     C                     SETON                     4299
     C                     MOVE ERR,7     ERRMSG
     C                     ENDSL
     C                     ENDIF
     C*
0408AC           CODE      IFEQ '3'
0408AC           CODE      OREQ '4'
0408AC           CODE      OREQ '5'
0408AC           CODE      OREQ '6'
0408AC           TXKEY     CHAINTRNDTS              N97
0408AC  N97                MOVELTSCHYN    S1CHYN
0408AC   97                MOVELS#CHYN    S1CHYN
0408AC                     ELSE
0408AC                     MOVELS#CHYN    S1CHYN
0408AC                     ENDIF
0408AC*
     CSR         CK#01Z    ENDSR
     C*****************************************************************
     CSR         PR#02     BEGSR
     C*****************************************************************
     C                     SETON                     80
     C                     WRITESFCTL1
     C                     SETOF                     80
     C                     Z-ADD0         RRN     20
     C                     MOVE *BLANK    CUNO
     C                     MOVE *BLANK    CUNM
 9401C                     MOVE *BLANK    ORNO
9908AC*                    Z-ADDUDATE     DATE
9908AC           *DATE     SUB  19000000  DATE
     C                     Z-ADD0         TTLAMT
     C                     Z-ADD0         TTLTAX
9804AC                     Z-ADD0         TTLQTY
     C**
     C           CODE      CASEQ'1'       PR#ADD
     C                     CAS            PR#OTH
     C                     ENDCS
     CSR         PR#02Z    ENDSR
     C******
     CSR         PR#ADD    BEGSR
     C                     EXSR @GETNO
0611AC                     MOVELS#TYPE    S#TYP1
0611AC                     SELEC
0611AC           S#TYP1    WHEQ '1'
0611AC                     MOVELTY1,1     S#TYNM
0611AC           S#TYP1    WHEQ '2'
0611AC                     MOVELTY1,2     S#TYNM
0611AC                     OTHER
0611AC                     MOVEL*BLANKS   S#TYNM
0611AC                     ENDSL
     C                     CLEARSF1
     C           RRN       DOWLT10
     C                     ADD  1         RRN
     C                     Z-ADDRRN       ITEM
     C                     WRITESF1
     C                     ENDDO
     C                     SETON                     10
     CSR         PR#ADZ    ENDSR
     C******
     CSR         @GETNO    BEGSR
     C                     MOVEL'06'      GEKIND
     C                     MOVE *BLANK    GEPRIN
     C                     MOVE *BLANK    GRP
     C                     MOVELTXAR      GE1
     C                     MOVELGRP       GEPRIN
     C           GEKEY     CHAINGEREC               N97
     C   97                Z-ADD0         GECUNO
     C                     MOVELTXAR      NOA
     C           GECUNO    IFEQ 99999
     C                     Z-ADD1         NOB
     C                     ELSE
     C           GECUNO    ADD  1         NOB
     C                     ENDIF
     C                     MOVELNOG       NO
     CSR                   ENDSR
     C***
     CSR         PR#OTH    BEGSR
     C                     MOVELTXCUNO    CUNO
     C                     MOVELTXCUNM    CUNM
 9401C                     MOVELTXORNO    ORNO
     C                     Z-ADDTXDATE    DATE
     C                     Z-ADDTXACDT    ACDT
     C*
0611AC                     MOVELD#TYPE    S#TYP1
0611AC           S#TYP1    IFNE *BLANKS
0611AC                     SELEC
0611AC           S#TYP1    WHEQ '1'
0611AC                     MOVELTY1,1     S#TYNM
0611AC           S#TYP1    WHEQ '2'
0611AC                     MOVELTY1,2     S#TYNM
0611AC                     OTHER
0611AC                     MOVEL*BLANKS   S#TYNM
0611AC                     ENDSL
0611AC                     ENDIF
     C*
     C           TXACYM    IFNE *BLANK
9708 C                     MOVE TXACYM    ACYM
     C                     ENDIF
     C           CODE      IFEQ '5'
9908AC*                    Z-ADDUDATE     ACDT
9908AC           *DATE     SUB  19000000  ACDT
     C                     ENDIF
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C                     Z-ADD0         TXITEM
     C           TXKEY     SETLLTXREC                97
     C  N97      TX1KEY    READETXREC                    97
     C           *IN97     DOWEQ'0'
     C                     CLEARSF1
     C   71                SETON                     70
     C                     ADD  1         RRN
     C           RRN       IFNE TXITEM
     C           RRN       DOWLTTXITEM
     C                     Z-ADDRRN       ITEM
     C                     WRITESF1
     C                     ADD  1         RRN
     C                     ENDDO
     C                     ENDIF
     C                     Z-ADDTXITEM    ITEM
     C                     MOVELTXACNT    ACNT
9803 C           TXFLAG    IFNE 'D'
     C                     Z-ADDTXACDT    ACDT
     C                     MOVELTXORNO    ORNO
9803 C                     MOVELTXORNO    H#ORNO
9803 C                     ENDIF
0611AC                     MOVELD#TYPE    S#TYP1
     C                     MOVELTXPDNM    PDNM
     C                     MOVELTXIVNO    INVOX
     C                     Z-ADDTXQTY     QTY
     C                     Z-ADDTXUPRC    UPRC
     C                     Z-ADDTXAMT     AMT
     C                     Z-ADDTXTAX     TAX
     C                     MOVELTXRVID    RVID
     C                     MOVELTXSALE    SALE
     C                     MOVELTXSATP    SATP
     C                     MOVELTXIVTP    KIND
     C                     MOVELTXFLAG    FLAG
     C                     MOVELTXWHY     WHY
     C           TXFLAG    IFNE 'D'
     C                     ADD  TXAMT     TTLAMT
     C                     ADD  TXTAX     TTLTAX
9804AC                     ADD  TXQTY     TTLQTY
     C                     ENDIF
0408AC           TXKEY     CHAINTRNDTS               96
0408AC  N96                MOVELTSMETL    S#METL
0408AC  N96                MOVELTSSPE1    S#XHWD
0408AC  N96                MOVELTSSPE2    S#XXBT
0408AC  N96                MOVELTSSPE5    S#LENG
0605AC  N96                MOVELD#SPE3    S#XXT1
     C                     WRITESF1
     C           TX1KEY    READETXREC                    97
     C                     ENDDO
     C****
     C           CODE      IFEQ '2'
     C                     CLEARSF1
     C           RRN       DOWLE9
     C                     ADD  1         RRN
     C                     Z-ADDRRN       ITEM
     C                     WRITESF1
     C                     ENDDO
     C                     ENDIF
     C                     SETON                     10
     CSR         PR#OTZ    ENDSR
     C******
     CSR         CK#02     BEGSR
     C                     SETOF                     99
     C                     MOVEA'00'      *IN,43
     C                     MOVE *BLANK    ERRMSG
     C                     Z-ADD0         TTLAMT
     C                     Z-ADD0         TTLTAX
9804AC                     Z-ADD0         TTLQTY
9803 C                     Z-ADD0         W#CONT  30
9803 C                     MOVEL*BLANK    W1ORNO  6
     C***
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE DATE      P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM           FLAG1   1
     C*
     C*
　 C*開立日期錯誤
     C           FLAG1     IFNE '0'
     C                     SETON                     9944
     C                     MOVELERR,19    ERRMSG
     C                     ENDIF
     C***
     C*客戶編號不存在
     C                     MOVELCUNO      CUST
     C           CBKEY     CHAINCBREC                97
     C   97                SETON                     43
     C   97                MOVELERR,13    ERRMSG
     C  N97                MOVELCBCUNM    CUNM
     C  N97                MOVELCBIVCO    IVCO    1
     C***
     C*
     C                     MOVEL*BLANK    W#AREA  1        發票廠區
     C*
     C                     MOVEL*BLANK    INVOT  10
     C                     Z-ADD0         RRN
     C                     MOVE '0'       *IN95
     C           *IN95     DOWEQ'0'
     C                     MOVEA'00000000'*IN,51
0408AC                     MOVEL*OFF      *IN60
     C                     ADD  1         RRN
     C           RRN       CHAINSF1                  95
     C   95                LEAVE
     C   21                MOVELINVOT     INVOX
     C                     MOVELINVOX     INVOT
     C           INVOX     IFEQ *BLANK
     C           ACNT      ANDEQ*BLANK
     C           FLAG      OREQ 'D'
     C                     UPDATSF1
     C                     ITER
     C                     ENDIF
     C***
     C                     SELEC
     C*種類別必須輸入
     C           ACNT      WHEQ ' '
     C                     SETON                     9952
     C                     MOVE ERR,11    ERRMSG
     C*種類別必須為２，３，４，５，６
     C           ACNT      WHNE '2'
     C           ACNT      ANDNE'3'
     C           ACNT      ANDNE'4'
     C           ACNT      ANDNE'5'
     C           ACNT      ANDNE'6'
     C                     SETON                     9952
     C                     MOVE ERR,12    ERRMSG
     C                     ENDSL
     C***
     C*發票號碼必須輸入
     C           INVOX     IFEQ *BLANK
     C                     SETON                     9951
     C                     MOVE ERR,8     ERRMSG
     C                     ENDIF
     C***
     C*此發票號碼不存在
     C           INVOX     CHAININREC               N94
     C   94                SETON                     9951
     C   94                MOVELERR,15    ERRMSG
     C*此發票號碼非屬此客戶
     C  N94      INCUNO    IFNE CUNO
     C                     SETON                     9951
     C                     MOVE ERR,14    ERRMSG
     C                     END
     C*此發票號碼已作廢
     C  N94      INDECD    IFNE ' '
     C                     SETON                     9951
     C                     MOVE ERR,16    ERRMSG
     C                     END
     C*
 9406C*若不為鋼筋類發票，在未押匯情況下不允許開立
  .  C  N94      INNBAL    IFNE 0
  .  C                     MOVELPDNM      W#PDNM  1
  .  C           W#PDNM    IFEQ '3'
  .  C           W#PDNM    OREQ '4'
  .  C           W#PDNM    OREQ '5'
  .  C*                    SETON                     9951
  .  C                     MOVE ERR,30    ERRMSG
  .  C                     ENDIF
 9406C                     ENDIF
     C*
     C*    ----- 檢核同一張折退單內之發票統一編號必須一致-----
     C*
 {   C           W#AREA    IFEQ *BLANK                     第一筆
     C                     MOVELINAREA    W#AREA
     C*
     C                     ELSE
     C                     MOVEL'T'       W#RTNV  1
  {  C                     SELEC
     C           W#AREA    WHEQ 'P'
     C           W#AREA    OREQ 'M'
     C           W#AREA    OREQ 'T'
0002AC           W#AREA    OREQ 'U'
   { C           INAREA    IFNE 'P'
     C           INAREA    ANDNE'M'
     C           INAREA    ANDNE'T'
0002AC           INAREA    ANDNE'U'
     C                     MOVEL'F'       W#RTNV
  }} C                     ENDIF
  {  C           W#AREA    WHEQ 'H'
   { C           INAREA    IFNE 'H'
     C                     MOVEL'F'       W#RTNV
   } C                     ENDIF
  {  C           W#AREA    WHEQ 'K'
   { C           INAREA    IFNE 'K'
     C                     MOVEL'F'       W#RTNV
   } C                     ENDIF
  }  C                     ENDSL
     C*
     C           W#RTNV    IFEQ 'F'                        非同廠區
     C                     SETON                     9951
     C                     MOVELERR,26    ERRMSG
     C                     ENDIF
 }   C                     ENDIF
     C*
     C***
     C* N94      INNBAL    IFLE 0
     C*                    SETON                     9951
     C*                    MOVE ERR,21    ERRMSG
     C*                    END
     C  N94                MOVELINORNO    ORNO
9803 C  N94                MOVELINORNO    H#ORNO
     C  N94                MOVELINRVID    RVID
     C  N94                MOVELINSALE    SALE
     C  N94                MOVELINSATP    SATP
9010 C  N94                MOVE INKIND    KIND
9405 C*
 .   C           ACNT      IFEQ '4'
 .   C           AMT       ANDGT0
 .   C           PDNM      ANDNE*BLANK
 .   C                     SETON                     9958
 .   C                     MOVE ERR,29    ERRMSG
 .   C                     ENDIF
9405 C*
     C***
     C*品名代號不存在
0511AC           ACNT      IFEQ '3'
0511AC           PDNM      ANDEQ*BLANKS
0511AC                     SETON                     9958
0511AC                     MOVELERR,48    ERRMSG
0511AC                     ENDIF
0511AC*
0510AC           PDNM      IFNE *BLANKS
0510AC           INVOX     ANDNE*BLANKS
0510AC           KEY08     CHAINIVREC4               97
0510AC   97                SETON                     9958
0510AC   97                MOVELERR,47    ERRMSG
0510AC                     ENDIF
0510AC*
     C           PDNM      IFNE *BLANK
0409AC                     MOVELPDNM      F4NAME
0409AC           F4NAME    CHAINRHIPROD              97
     C   97                SETON                     9958
     C   97                MOVE ERR,9     ERRMSG
     C                     ENDIF
     C***計算金額
     C           AMT       IFEQ 0
     C           QTY       MULT UPRC      AMT       H
     C                     ENDIF
     C***計算稅額
 9305C                     MOVELCUNO      W#CUNO  1
   . C           W#CUNO    IFEQ 'D'
   . C           TAX       ANDEQ0
   . C           AMT       MULT 0.05      TAX       H
 9305C                     ENDIF
     C***
     C                     ADD  AMT       TTLAMT
     C                     ADD  TAX       TTLTAX
9804AC                     ADD  QTY       TTLQTY
     C***
     C*金額不可為０
     C           AMT       IFEQ 0
     C                     SETON                     9955
     C                     MOVELERR,22    ERRMSG
     C                     ENDIF
     C***
     C           INKIND    IFEQ '3'
     C           AMT       MULT 0.05      TMTAX  110
     C           TAX       SUB  TMTAX     DIFAMT 110
     C           DIFAMT    IFGT 2
     C           DIFAMT    ORLT -2
     C                     SETON                     995556
     C                     MOVELERR,25    ERRMSG
     C                     ENDIF
     C                     ENDIF
 9203C******
  .  C*此張發票之折讓金額不可大於發票金額　
  .  C           AMT       IFGT INAAMT
  .  C                     SETON                     995556
  .  C                     MOVELERR,28    ERRMSG
 9203C                     ENDIF
 9803C*
  .  C           H#ORNO    IFNE W1ORNO
  .  C           W1ORNO    IFNE *BLANK
  .  C                     ADD  1         W#CONT
  .  C                     ENDIF
  .  C                     MOVELH#ORNO    W1ORNO
  .  C                     ENDIF
  .  C*
  .  C  N99      W#CONT    IFGT 0
  .  C                     SETON                     9951
  .  C                     MOVELERR,34    ERRMSG
 9803C                     ENDIF
     C******
0408AC  N99      S#CHYN    IFEQ 'Y'
     C*
0408AC                     MOVEL'N'       W#CHK   1
     C*
0408AC           S#METL    IFEQ *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           S#METL    OREQ *BLANKS
0408AC           S#XHWD    ANDEQ*ALL'0'
0408AC           S#XXBT    ANDEQ*ALL'0'
0408AC           S#LENG    ANDEQ*ALL'0'
0408AC           S#METL    OREQ *BLANKS
0408AC           S#XHWD    ANDEQ*ALL'0'
0408AC           S#XXBT    ANDEQ*ALL'0'
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           S#METL    OREQ *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*ALL'0'
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           S#METL    OREQ *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*ALL'0'
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           S#METL    OREQ *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*ALL'0'
0408AC                     SETON                     9960
0408AC                     MOVELERR,35    ERRMSG
0408AC                     ENDIF
0408AC*
0408AC  N99      S#XHWD    IFNE *BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0408AC           S#XHWD    OREQ *BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0408AC           S#XHWD    OREQ *BLANKS
0408AC           S#XXBT    ANDEQ*ALL'0'
0408AC           S#XHWD    OREQ *ALL'0'
0408AC           S#XXBT    ANDEQ*BLANKS
0408AC                     SETON                     9960
0408AC                     MOVELERR,41    ERRMSG
0408AC                     ENDIF
0408AC*
0408AC  N99      ACNT      IFNE '3'
0408AC                     SETON                     9952
0408AC                     MOVELERR,36    ERRMSG
0408AC                     ENDIF
0408AC*
0408AC                     MOVEL*OFF      *IN97
0408AC           INVOX     SETLLTRNDLB
0408AC  N99      *IN97     DOWEQ*OFF
0408AC           INVOX     READETRNDLB              N    97
0408AC   97                LEAVE
0408AC                     MOVEL*OFF      *IN96
0408AC           KEY06     SETLLHSVOUR
0408AC           *IN96     DOWEQ*OFF
0408AC           KEY06     READERHSVOUR                  96
0408AC   96                LEAVE
     C*
0408AC                     SELEC
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           S4QULT    IFNE S#METL
0408AC                     MOVELERR,37    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK   1
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDNE*BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           S4SPE1    IFNE S#XHWD
0408AC           S4SPE2    ORNE S#XXBT
0408AC           S4QULT    ORNE S#METL
0408AC                     MOVELERR,42    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0605AC           S#METL    WHNE *BLANKS
0605AC           S#XHWD    ANDNE*BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDEQ*BLANKS
0605AC           W#CHK     ANDNE'Y'
0605AC           S4SPE1    IFNE S#XHWD
0605AC           S4SPE2    ORNE S#XXBT
0605AC           S4SPE3    ORNE S#XXT1
0605AC           S4QULT    ORNE S#METL
0605AC                     MOVELERR,42    ERRMSG
0605AC                     SETON                     9960
0605AC                     ITER
0605AC                     ELSE
0605AC                     MOVEL'Y'       W#CHK
0605AC                     SETOF                     9960
0605AC                     MOVEL*BLANKS   ERRMSG
0605AC                     ENDIF
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDNE*BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           S4QULT    IFNE S#METL
0408AC           S4SPE1    ORNE S#XHWD
0408AC           S4SPE2    ORNE S#XXBT
0408AC           D#SPE5    ORNE S#LENG
0408AC                     MOVELERR,43    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0605AC           S#METL    WHNE *BLANKS
0605AC           S#XHWD    ANDNE*BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDNE*BLANKS
0605AC           W#CHK     ANDNE'Y'
0605AC           S4QULT    IFNE S#METL
0605AC           S4SPE1    ORNE S#XHWD
0605AC           S4SPE2    ORNE S#XXBT
0605AC           S4SPE3    ORNE S#XXT1
0605AC           D#SPE5    ORNE S#LENG
0605AC                     MOVELERR,43    ERRMSG
0605AC                     SETON                     9960
0605AC                     ITER
0605AC                     ELSE
0605AC                     MOVEL'Y'       W#CHK
0605AC                     SETOF                     9960
0605AC                     MOVEL*BLANKS   ERRMSG
0605AC                     ENDIF
0408AC           S#METL    WHEQ *BLANKS
0408AC           S#XHWD    ANDNE*BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           S4SPE1    IFNE S#XHWD
0408AC           S4SPE2    ORNE S#XXBT
0408AC                     MOVELERR,38    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0605AC           S#METL    WHEQ *BLANKS
0605AC           S#XHWD    ANDNE*BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDEQ*BLANKS
0605AC           W#CHK     ANDNE'Y'
0605AC           S4SPE1    IFNE S#XHWD
0605AC           S4SPE2    ORNE S#XXBT
0605AC           S4SPE3    ORNE S#XXT1
0605AC                     MOVELERR,38    ERRMSG
0605AC                     SETON                     9960
0605AC                     ITER
0605AC                     ELSE
0605AC                     MOVEL'Y'       W#CHK
0605AC                     SETOF                     9960
0605AC                     MOVEL*BLANKS   ERRMSG
0605AC                     ENDIF
0408AC           S#METL    WHEQ *BLANKS
0408AC           S#XHWD    ANDNE*BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           S4SPE1    IFNE S#XHWD
0408AC           S4SPE2    ORNE S#XXBT
0408AC           D#SPE5    ORNE S#LENG
0408AC                     MOVELERR,44    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0605AC           S#METL    WHEQ *BLANKS
0605AC           S#XHWD    ANDNE*BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDNE*BLANKS
0605AC           W#CHK     ANDNE'Y'
0605AC           S4SPE1    IFNE S#XHWD
0605AC           S4SPE2    ORNE S#XXBT
0605AC           S4SPE3    ORNE S#XXT1
0605AC           D#SPE5    ORNE S#LENG
0605AC                     MOVELERR,44    ERRMSG
0605AC                     SETON                     9960
0605AC                     ITER
0605AC                     ELSE
0605AC                     MOVEL'Y'       W#CHK
0605AC                     SETOF                     9960
0605AC                     MOVEL*BLANKS   ERRMSG
0605AC                     ENDIF
0408AC           S#METL    WHEQ *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           D#SPE5    IFNE S#LENG
0408AC                     MOVELERR,39    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC           W#CHK     ANDNE'Y'
0408AC           S4QULT    IFNE S#METL
0408AC           D#SPE5    ORNE S#LENG
0408AC                     MOVELERR,45    ERRMSG
0408AC                     SETON                     9960
0408AC                     ITER
0408AC                     ELSE
0408AC                     MOVEL'Y'       W#CHK
0408AC                     SETOF                     9960
0408AC                     MOVEL*BLANKS   ERRMSG
0408AC                     ENDIF
0408AC                     ENDSL
0408AC                     ENDDO
0408AC                     ENDDO
0408AC*
0408AC                     ENDIF
0408AC*
0408AC  N99      S#CHYN    IFEQ 'N'
0408AC           S#METL    IFNE *BLANKS
0408AC           S#XHWD    ORNE *BLANKS
0408AC           S#XXBT    ORNE *BLANKS
0408AC           S#LENG    ORNE *BLANKS
0408AC           S#XHWD    OREQ *ALL'0'
0408AC           S#XXBT    ANDEQ*ALL'0'
0408AC           S#LENG    ANDEQ*ALL'0'
0408AC                     SETON                     9960
0408AC                     MOVELERR,40    ERRMSG
0408AC                     ENDIF
0408AC                     ENDIF
     C*
     C                     UPDATSF1
     C***
     C                     ENDDO
     C******
9101 C*原因詳見CNV013R#X
9101 C  N94      INKIND    IFEQ '2'                        預收發票
9101 C           INRCNO    ANDEQ*BLANK                     預收發票
9101 C           INNBAL    ANDEQTTLAMT
9101 C                     SETON                     9951
9101 C                     MOVE ERR,27    ERRMSG
9101 C                     END
     C*
     CSR         CK#02Z    ENDSR
     C***
     CSR         CK#05     BEGSR
     C                     SETOF                     99
     C                     MOVEA'00'      *IN,45
     C                     MOVE *BLANK    ERRMSG
9710 C           ACDT      IFNE 99999999
     C*                    CALL 'C01'
     C*                    PARM           ACDT
     C*                    PARM           FLAG1   1
     C*                    FREE 'C01'
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE ACDT      P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE
     C                     PARM '1'       P#MODE
     C                     PARM           P#MTL
     C                     PARM           P#LY
     C                     PARM           FLAG1
　 C*確認日期錯誤
     C           FLAG1     IFNE '0'
     C                     SETON                     9945
     C                     MOVELERR,20    ERRMSG
     C                     ENDIF
     C                     ENDIF
0412AC*
0412AC*依鋼種分攤，折讓確認日須為999999999
0412AC*
0412AC           S1CHYN    IFEQ 'Y'
0412AC           ACDT      ANDNE99999999
0412AC                     SETON                     9945
0412AC                     MOVELERR,46    ERRMSG
0412AC                     GOTO CK#05Z
0412AC                     ENDIF
     C***
　 C*折讓確認日期為９９９９９９９９時，則入帳年月必須輸入
9710 C           ACDT      IFEQ 99999999
     C           ACYM      IFEQ 0
9711 C           ACYM      OREQ 9999
     C                     SETON                     9946
     C                     MOVELERR,24    ERRMSG
     C                     ENDIF
     C                     ELSE
     C                     MOVELACDT      ACYM
     C                     ENDIF
     CSR         CK#05Z    ENDSR
     C******
     CSR         FL#02     BEGSR
     C           CODE      CASEQ'3'       DL#02
     C           CODE      CASEQ'1'       WR#02
     C           CODE      CASEQ'2'       UP#02
     C           CODE      CASEQ'5'       UP#05
     C                     ENDCS
     CSR         FL#02Z    ENDSR
     C****
     CSR         DL#02     BEGSR
     C***
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C                     Z-ADD0         TXITEM
0407AC           TXNO      SETLLARDSD4
0407AC                     MOVEL*OFF      *IN55
0407AC           *IN55     DOWEQ*OFF
0407AC           TXNO      READEARDSD4                   55
0407AC   55                LEAVE
0407AC           TXAR      IFEQ 'H'
0407AC           TXAR      OREQ 'P'
0407AC           TXAR      OREQ 'M'
0407AC                     DELETARDSD4
0407AC                     ELSE
0407AC                     MOVEL'D'       ASFLAG
0407AC                     UPDATARDSD4
0407AC                     ENDIF
0407AC                     ENDDO
0407AC*
     C           TXKEY     SETLLTXREC                97
     C  N97      TX1KEY    READETXREC                    97
     C           *IN97     DOWEQ'0'
     C                     MOVEL'D'       TXFLAG
     C                     MOVELTXAR      TXTXAR
9908AC*                    Z-ADDUDATE     TXTXDT
9908AC           *DATE     SUB  19000000  TXTXDT
     C                     UPDATTXREC
     C           TX1KEY    READETXREC                    97
     C                     ENDDO
     C*
0408AC           TXKEY     SETLLTRNDTS               97
0408AC                     MOVEL*OFF      *IN97
0408AC           *IN97     DOWEQ'0'
0408AC           TX1KEY    READERTRNDTS                  97
0408AC   97                LEAVE
0408AC                     MOVEL'D'       TSFLAG
0408AC                     MOVELTXAR      TSTXAR
0408AC                     MOVELT#USID    TSUPDM
0408AC           *DATE     SUB  19000000  TSUPDD
0408AC                     TIME           TSUPDT
0408AC                     UPDATRTRNDTS
0408AC                     ENDDO
     C*
     CSR         DL#02Z    ENDSR
     *****
     CSR         WR#02     BEGSR
     C                     CLEARGEREC
     C                     MOVEL'06'      GEKIND
     C                     MOVE *BLANK    GEPRIN
     C                     MOVE *BLANK    GRP
     C                     MOVELTXAR      GE1
     C                     MOVELGRP       GEPRIN
     C           GEKEY     CHAINGEREC                97
     C   97                Z-ADD1         GECUNO
     C   97                WRITEGEREC
     C           *IN97     IFEQ '0'
     C           GECUNO    IFEQ 99999
     C                     Z-ADD1         GECUNO
     C                     ELSE
     C                     ADD  1         GECUNO
     C                     ENDIF
     C                     UPDATGEREC
     C                     ENDIF
     C                     MOVELTXAR      NOA
     C                     Z-ADDGECUNO    NOB
     C                     MOVELNOG       NO
     C***
     C                     SETOF                     95
     C                     Z-ADD0         RRN
     C           *IN95     DOWEQ'0'
     C                     ADD  1         RRN
     C           RRN       CHAINSF1                  95
     C   95                LEAVE
     C***
     C           INVOX     IFEQ *BLANK
     C           ACNT      ANDEQ*BLANK
     C           FLAG      OREQ 'D'
     C                     ITER
     C                     ENDIF
     C****
     C                     EXSR WR#TX
     C***
     C                     ENDDO
     C***
     CSR         WR#02Z    ENDSR
     *****
     CSR         UP#02     BEGSR
     C***
     C                     Z-ADD0         RRN
     C                     SETOF                     95
     C           *IN95     DOWEQ'0'
     C                     ADD  1         RRN
     C           RRN       CHAINSF1                  95
     C   95                LEAVE
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C                     Z-ADDRRN       TXITEM
     C           TXKEY     CHAINTXREC                96
     C           INVOX     IFEQ *BLANK
     C           PDNM      ANDEQ*BLANK
     C           FLAG      OREQ 'D'
     C   96                ITER
     C                     MOVE 'D'       TXFLAG
     C                     MOVE TXAR      TXTXAR
9908AC*                    Z-ADDUDATE     TXTXDT
0611AC                     MOVELS#TYP1    D#TYPE
9908AC           *DATE     SUB  19000000  TXTXDT
     C                     UPDATTXREC
0408AC           TXKEY     CHAINTRNDTS               97
0408AC                     MOVEL'D'       TSFLAG
0408AC                     MOVELTXAR      TSTXAR
0408AC                     MOVELT#USID    TSUPDM
0408AC           *DATE     SUB  19000000  TSUPDD
0408AC                     TIME           TSUPDT
     C                     ELSE
     C  N96                EXSR UP#TX
     C   96                EXSR WR#TX
     C                     ENDIF
     C***
     C                     ENDDO
     C***
     CSR         UP#02Z    ENDSR
     C***
     CSR         UP#05     BEGSR
     C                     Z-ADD0         RRN
     C                     SETOF                     95
     C           *IN95     DOWEQ'0'
     C                     ADD  1         RRN
     C           RRN       CHAINSF1                  95
     C   95                LEAVE
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C                     Z-ADDRRN       TXITEM
     C           TXKEY     CHAINTXREC                97
     C           *IN97     IFEQ '1'
     C           TXFLAG    OREQ 'D'
     C                     ITER
     C                     ENDIF
     C  N97                MOVE 'C'       TXFLAG
     C  N97                MOVE 'Y'       TXFL01
     C  N97                MOVE 'Y'       TXFL02
     C  N97                Z-ADDACDT      TXACDT
9708 C  N97                MOVELACYM      TXACYM
     C  N97                MOVELTXAR      TXTXAR
99908A* N97                Z-ADDUDATE     TXTXDT
9908AC  N97      *DATE     SUB  19000000  TXTXDT
     C  N97                UPDATTXREC
     C***
0408AC           TXKEY     CHAINRTRNDTS              97
0408AC  N97                MOVEL'C'       TSFLAG
0408AC  N97                MOVELT#USID    TSUPDM
0408AC  N97      *DATE     SUB  19000000  TSUPDT
0408AC  N97                TIME           TSUPDT
0408AC  N97                UPDATRTRNDTS
     C*
     C                     SETOF                     9192
     C                     MOVELINVOX     IVNO
     C                     MOVELACNT      IVACNT
     C                     Z-ADD0         IVITEM
     C           IV2KEY    SETLLIVREC                91
     C           *IN91     DOWEQ'0'
     C  N91      IV2KEY    READEIVREC               N    91
     C                     ENDDO
     C                     Z-ADDIVITEM    IVIT@   20
     C                     ADD  1         IVIT@
     C                     MOVELACNT      ACNT@   1
     C           AMT       MULT -1        IVAMT@ 110
     C***
     C                     CLEARIVREC
     C                     MOVEL'A'       IVFLAG
     C                     MOVELINVOX     IVNO
     C                     Z-ADDIVIT@     IVITEM
     C                     MOVELACNT@     IVACNT
     C                     Z-ADDACDT      IVACDT
     C                     MOVELORNO      IVORNO
     C                     MOVELPDNM      IVPDCD
     C                     Z-SUBQTY       IVQTY
     C                     Z-ADDUPRC      IVUPRC
     C                     Z-ADDIVAMT@    IVAMT
     C                     MOVELNO        IVAPNO
0407AC                     Z-ADDIVAMT     W#VAMT 110       *折讓金額
0409AC                     MOVELIVPDCD    W#PDCD  5        記錄品名
     C           ACNT      IFEQ '2'
     C                     MOVEL'C'       IVFL03
     C                     END
     C           ACNT      IFEQ '3'
     C                     MOVEL'D'       IVFL03
     C                     END
     C           ACNT      IFEQ '4'
     C           AMT       IFLT 0
     C                     MOVE 'H'       IVFL03
     C                     ELSE
     C                     MOVE 'G'       IVFL03
     C                     END
     C                     END
     C                     MOVEL'Y'       IVFL02
9908AC*                    Z-ADDUDATE     IVTXDT
9908AC           *DATE     SUB  19000000  IVTXDT
     C                     MOVELTXAR      IVTXAR
9708 C                     MOVE ACYM      IVACYM
     C                     WRITEIVREC
     C****
     C*9112新增判斷該發票之課稅別
9112 C           INVOX     CHAININREC               N91
9112 C           INTXTP    IFEQ '1'                        應稅
     C*
     C                     MOVELINVOX     IVNO
     C                     MOVEL'5'       IVACNT
     C                     Z-ADD0         IVITEM
     C           IV2KEY    SETLLIVREC                91
     C           *IN91     DOWEQ'0'
     C  N91      IV2KEY    READEIVREC               N    91
     C                     ENDDO
     C                     Z-ADDIVITEM    IVIT@   20
     C                     ADD  1         IVIT@
     C                     MOVEL'5'       ACNT@   1
     C           TAX       MULT -1        IVAMT@ 110
     C                     CLEARIVREC
     C                     MOVEL'A'       IVFLAG
     C                     MOVELINVOX     IVNO
     C                     Z-ADDIVIT@     IVITEM
     C                     MOVELACNT@     IVACNT
     C                     Z-ADDACDT      IVACDT
     C                     MOVELORNO      IVORNO
     C                     Z-ADD0         IVQTY
     C                     Z-ADD0         IVUPRC
     C                     Z-ADDIVAMT@    IVAMT
     C                     MOVELNO        IVAPNO
     C           ACNT      IFEQ '2'
     C                     MOVEL'B'       IVPDCD
     C                     MOVEL'C'       IVFL03
     C                     END
     C           ACNT      IFEQ '3'
     C                     MOVEL'C'       IVPDCD
     C                     MOVEL'D'       IVFL03
     C                     END
     C           ACNT      IFEQ '4'
     C           AMT       IFLT 0
     C                     MOVEL'A'       IVPDCD
     C                     MOVE 'H'       IVFL03
     C                     ELSE
     C                     MOVEL'C'       IVPDCD
     C                     MOVE 'G'       IVFL03
     C                     END
     C                     END
     C                     MOVEL'Y'       IVFL02
9908AC*                    Z-ADDUDATE     IVTXDT
9908AC           *DATE     SUB  19000000  IVTXDT
     C                     MOVELTXAR      IVTXAR
9708 C                     MOVE ACYM      IVACYM
     C                     WRITEIVREC
0407AC           ACNT      IFEQ '3'
0510AC                     MOVELNO        W#NO    1
0408AC           S1CHYN    IFEQ 'N'
0510AC           W#NO      IFEQ 'H'                        型鋼
0407AC                     EXSR SR3000
0510AC                     ELSE
0510AC                     EXSR SR5000                     鋼筋
0510AC                     ENDIF
0408AC                     ELSE
0408AC                     EXSR SR4000                     型筋依尺寸
0408AC                     ENDIF
0407AC                     ENDIF
9112 C                     ELSE
9112 C                     Z-ADD0         TAX
9112 C                     ENDIF
0412AC*
0412AC*依鋼種尺寸分攤須自動轉出
0412AC*
0412AC           S1CHYN    IFEQ 'Y'
     C*
0502AC                     Z-ADDACYM      D#ACYM
0503AC           D#ACYM    ADD  191100    D1ACYM  60       *西元年月
0412AC                     SELEC
0412AC           D#ACMM    WHEQ 1
0412AC           D#ACMM    OREQ 3
0412AC           D#ACMM    OREQ 5
0412AC           D#ACMM    OREQ 7
0412AC           D#ACMM    OREQ 8
0412AC           D#ACMM    OREQ 10
0412AC           D#ACMM    OREQ 12
0412AC                     Z-ADD31        D#ACDD           入帳日
0412AC           D#ACMM    WHEQ 4
0412AC           D#ACMM    OREQ 6
0412AC           D#ACMM    OREQ 9
0412AC           D#ACMM    OREQ 11
0412AC                     Z-ADD30        D#ACDD           入帳日
0412AC           D#ACMM    WHEQ 2
0503AC                     MOVELD1ACYM    W#ACYM  40
0503AC           W#ACYM    DIV  4         W#1     20
0412AC                     MVR            W#2     20
0412AC           W#2       IFEQ 0
0412AC                     Z-ADD29        D#ACDD           潤年
0412AC                     ELSE
0412AC                     Z-ADD28        D#ACDD           入帳日
0412AC                     ENDIF
0412AC                     ENDSL
     C*
0412AC                     MOVELINVOX     IVNO
0412AC                     MOVEL'7'       IVACNT
0412AC                     Z-ADD0         IVITEM
0412AC           IV2KEY    SETLLIVREC                91
0412AC           *IN91     DOWEQ'0'
0412AC  N91      IV2KEY    READEIVREC               N    91
0412AC                     ENDDO
0412AC                     Z-ADDIVITEM    IVIT@   20
0412AC                     ADD  1         IVIT@
0412AC                     MOVEL'7'       ACNT@   1
0412AC                     CLEARIVREC
0412AC                     MOVEL'A'       IVFLAG
0412AC                     MOVELINVOX     IVNO
0412AC                     Z-ADDIVIT@     IVITEM
0412AC                     MOVELACNT@     IVACNT
0412AC                     Z-ADDD#ACDT    IVACDT
0412AC                     MOVELORNO      IVORNO
0412AC                     Z-ADD0         IVQTY
0412AC                     Z-ADD0         IVUPRC
0412AC           AMT       ADD  TAX       IVAMT
0412AC                     MOVELORNO      IVAPNO
0412AC                     MOVEL'I'       IVFL03
0412AC                     MOVEL'Y'       IVFL02
0412AC           *DATE     SUB  19000000  IVTXDT
0412AC                     MOVELTXAR      IVTXAR
0412AC*                    MOVE ACYM      IVACYM
0412AC                     WRITEIVREC
0412AC                     ENDIF
0412AC*
     C****
     C***
     C           INVOX     CHAININREC                93
     C           *IN93     IFEQ '0'
     C           ACNT      IFEQ '2'
     C           AMT       MULT -1        AMTY   110
     C           TAX       MULT -1        TAXY   110
     C                     ADD  AMTY      INCAMT
     C                     ADD  TAXY      INCTAX
     C                     END
     C           ACNT      IFEQ '3'
     C           AMT       MULT -1        AMTZ   110
     C           TAX       MULT -1        TAXZ   110
     C                     ADD  AMTZ      INCAMT
     C                     ADD  TAXZ      INCTAX
0412AC           S1CHYN    IFEQ 'Y'
0503AC           AMT       ADD  TAX       W#FAMT 110
0503AC           W#FAMT    ADD  INFAMT    INFAMT
0412AC                     ENDIF
     C                     END
     C           ACNT      IFEQ '4'
     C           AMT       MULT -1        AMTR   110
     C           TAX       MULT -1        TAXR   110
     C           INTYPE    IFNE '2'
     C                     ADD  AMTR      INDAMT
     C                     ADD  TAXR      INDTAX
     C                     ELSE
     C                     ADD  AMTR      INCAMT
     C                     ADD  TAXR      INCTAX
     C                     ENDIF
     C                     ENDIF
     C           INAAMT    ADD  INATAX    INNBAL
     C                     ADD  INBAMT    INNBAL
     C                     ADD  INCAMT    INNBAL
     C                     ADD  INCTAX    INNBAL
     C                     ADD  INDAMT    INNBAL
     C                     ADD  INDTAX    INNBAL
     C                     ADD  INEAMT    INNBAL
     C                     ADD  INFAMT    INNBAL
     C           INNBAL    IFEQ 0
     C                     MOVE 'Y'       INFL01
     C                     ENDIF
     C                     MOVE 'C'       INFLAG
     C                     MOVELTXAR      INTXAR
9908AC*                    Z-ADDUDATE     INTXDT
9908AC           *DATE     SUB  19000000  INTXDT
     C                     UPDATINREC
     C                     ENDIF
     C                     ENDDO
0408AC           S1CHYN    IFEQ 'Y'
0408AC                     CALL 'ARR033P1'
0408AC                     PARM           TXNO
0408AC                     ENDIF
0408AC*
0611AC*寫入電子發票折讓單介面檔
0611AC*
0611AC                     EXSR SR6000
0611AC*
     CSR         UP#05Z    ENDSR
     C***************************
     C***  WRITE  TO  TRNDTL  ***
     C***************************
     CSR         WR#TX     BEGSR
     C                     CLEARTXREC
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C                     MOVEL'A'       TXFLAG
     C                     Z-ADDRRN       TXITEM
     C                     MOVELACNT      TXACNT
     C                     MOVELORNO      TXORNO
     C                     MOVELRVID      TXRVID
     C                     MOVELSALE      TXSALE
     C                     MOVELKIND      TXIVTP
     C                     MOVELSATP      TXSATP
     C                     Z-ADDDATE      TXDATE
     C                     MOVELCUNO      TXCUNO
     C                     MOVELCUNM      TXCUNM
     C                     MOVELIVCO      TXIVTP
     C                     MOVELINVOX     TXIVNO
     C                     MOVELPDNM      TXPDNM
     C                     Z-ADDQTY       TXQTY
     C                     Z-ADDUPRC      TXUPRC
     C                     Z-ADDAMT       TXAMT
     C                     Z-ADDTAX       TXTAX
     C                     MOVELTXAR      TXTXAR
0611AC                     MOVELS#TYP1    D#TYPE
9908AC*                    Z-ADDUDATE     TXTXDT
9908AC           *DATE     SUB  19000000  TXTXDT
     C                     MOVELWHY       TXWHY
     C                     WRITETXREC
     C*
0408AC           TXKEY     CHAINTRNDTS               96
0408AC   96                CLEARRTRNDTS
0408AC                     MOVEL'A'       TSFLAG
0408AC                     MOVELTXNO      TSNO
0408AC                     MOVEL'AR06'    TSCODE
0408AC                     Z-ADDTXITEM    TSITEM
0408AC                     MOVELS#METL    TSMETL
0408AC                     MOVELS#XHWD    TSSPE1
0408AC                     MOVELS#XXBT    TSSPE2
0408AC                     MOVELS#LENG    TSSPE5
0605AC                     MOVELS#XXT1    D#SPE3
0408AC                     MOVELS#CHYN    TSCHYN
0408AC                     MOVELTXAR      TSTXAR
0408AC                     MOVELT#USID    TSENTM
0408AC           *DATE     SUB  19000000  TSENTD
0408AC                     TIME           TSENTT
0408AC                     MOVELT#USID    TSUPDM
0408AC           *DATE     SUB  19000000  TSUPDD
0408AC                     TIME           TSUPDT
0408AC   96                WRITERTRNDTS
     CSR         WR#TXZ    ENDSR
     C***************************
     C***  UPDATE TO  TRNDTL  ***
     C***************************
     CSR         UP#TX     BEGSR
     C                     MOVEL'C'       TXFLAG
     C                     MOVELACNT      TXACNT
     C                     Z-ADDDATE      TXDATE
     C                     MOVELORNO      TXORNO
     C                     MOVELRVID      TXRVID
     C                     MOVELSALE      TXSALE
     C                     MOVELKIND      TXIVTP
     C                     MOVELSATP      TXSATP
     C                     MOVELCUNO      TXCUNO
     C                     MOVELCUNM      TXCUNM
     C                     MOVELPDNM      TXPDNM
     C                     MOVELINVOX     TXIVNO
     C                     Z-ADDQTY       TXQTY
     C                     Z-ADDUPRC      TXUPRC
     C                     Z-ADDAMT       TXAMT
     C                     Z-ADDTAX       TXTAX
     C                     MOVELTXAR      TXTXAR
0611AC                     MOVELS#TYP1    D#TYPE
9908AC*                    Z-ADDUDATE     TXTXDT
9908AC           *DATE     SUB  19000000  TXTXDT
     C                     MOVELWHY       TXWHY
     C                     UPDATTXREC
     C*
0408AC           TXKEY     CHAINTRNDTS               97
0408AC                     MOVEL'C'       TSFLAG
0408AC                     MOVELS#METL    TSMETL
0408AC                     MOVELS#XHWD    TSSPE1
0408AC                     MOVELS#XXBT    TSSPE2
0408AC                     MOVELS#LENG    TSSPE5
0605AC                     MOVELS#XXT1    D#SPE3
0408AC                     MOVELS#CHYN    TSCHYN
0408AC                     MOVELT#USID    TSUPDM
0408AC           *DATE     SUB  19000000  TSUPDD
0408AC                     TIME           TSUPDT
0408AC  N97                UPDATRTRNDTS
     CSR         UP#TXZ    ENDSR
0407AC***************************************************************
0407AC           SR3000    BEGSR
0407AC****************************************************************
0407AC*
0407AC*計算發票中同品項之數量─依磅單分攤
0407AC*
0408AC                     MOVEL'1'       W#CHYN  1
0407AC                     Z-ADD0         W#VQTY  80
0407AC           KEY01     SETLLIVREC4
0407AC                     MOVEL*OFF      *IN55
0407AC           *IN55     DOWEQ*OFF
0407AC           KEY01     READEIVREC4                   55
0407AC   55                LEAVE
0407AC*
0407AC           IVACNT    IFEQ '1'
0407AC                     ADD  V#QTY     W#VQTY
0407AC                     ENDIF
0407AC                     ENDDO
0407AC*
0407AC*乘-1將W#VAMT換成正數(發票折讓金額)
0407AC*乘-1將IVAMT換成正數(發票稅額)
0407AC*
0407AC           W#VAMT    MULT -1        W#AMTT 120H
0510AC                     Z-ADDW#AMTT    K#AMTT 120H
0407AC           IVAMT     MULT -1        W1AMTT 120H
0510AC                     Z-ADDW1AMTT    K1AMTT 120H
0407AC*
0407AC*計算折讓單價(折讓金額/發票中同品項之數量)
0407AC*
0407AC           W#AMTT    DIV  W#VQTY    W#PRIC  53H
0407AC*
0407AC           KEY01     SETLLTRNDLB
0407AC                     MOVEL*OFF      *IN55
0407AC           *IN55     DOWEQ*OFF
0407AC           KEY01     READETRNDLB                   55
0407AC   55                LEAVE
0407AC                     CLEARRARDSDT
0407AC*
0407AC                     MOVELT#TXNO    W1TXNO  8
0407AC           D#TXIT    IFEQ '  '
0407AC                     Z-ADD0         W1TXIT  20
0407AC                     ELSE
0407AC                     MOVELD#TXIT    W1TXIT
0407AC                     ENDIF
0407AC*
0407AC                     Z-ADDT#QTY     W1QTY   70
0407AC                     MOVELT#PDNM    W1PDNM  5
0407AC                     Z-ADDT#UPRC    W1UPRC  53
0407AC*
0407AC                     MOVEL'A'       ASFLAG           處理代碼
0407AC                     MOVEL'D'       ASKIND           分攤類別
0407AC                     MOVELT#CUNO    ASCUNO           客戶代號
0407AC                     MOVELT#CUNM    ASCUNM           客戶名稱
0407AC                     MOVELT#ORNO    ASORNO           訂單編號
0407AC                     Z-ADDACYM      ASYYMM           處理年月
0407AC                     MOVELINKIND    ASTYPE           發票聯式
0407AC                     MOVELINRVID    ASSALE           業務員別
0407AC                     MOVELINAREA    ASAREA           廠區別
0407AC                     Z-ADDW#PRIC    ASAMT4           折讓單價
0407AC                     MOVELT#IVNO    ASINNO           發票號碼
0407AC                     MOVEL'3'       ASACNT           發票類別
0407AC*
0407AC*發票日期為主檔開立日，非明細檔之入帳日
0407AC*
0407AC                     Z-ADDININDT    ASINDT           發票日期
0407AC                     MOVELT#TXNO    ASTXNO           磅單編號
0407AC                     Z-ADDW1TXIT    ASTXIT           磅單項次
0407AC                     Z-ADDT#DATE    ASDATE           出貨日期
0407AC                     MOVELT#PDNM    ASPDNM           品名
0407AC                     Z-ADDT#QTY     ASQTY1           銷貨數量
0407AC                     Z-ADDT#UPRC    ASPRC1           銷貨單價
0407AC                     Z-ADDT#AMT     ASAMT1           銷貨金額
0510AC                     Z-ADDT#QTY     ASQTY2           TR銷貨數量
0407AC*
0407AC           W#PRIC    MULT ASQTY1    ASDMT1    H      折讓金額
0407AC           W#AMTT    SUB  ASDMT1    W#AMTT
0407AC           ASDMT1    MULT 0.05      ASDMT2    H      折讓稅額
0407AC           W1AMTT    SUB  ASDMT2    W1AMTT
0407AC                     MOVELTXNO      ASDXNO           折讓單號
0408AC                     Z-ADDTXITEM    ASDXIT           折讓單項次
0407AC                     MOVELT#USID    ASUPDM           異動人員
0407AC           *DATE     SUB  19000000  ASUPDD           異動日期
0407AC                     TIME           ASUPDT           異動時間
0510AC                     Z-ADDK#AMTT    ASDMT5           折讓總金額
0510AC                     Z-ADDK1AMTT    ASDMT6           折讓總稅額
0408AC*
0408AC*寫入磅單之鋼種尺寸長度欄位
0408AC*
0408AC           KEY04     SETLLHSVOUR
0408AC           KEY04     CHAINHSVOUR               96
0408AC           *IN96     IFEQ '0'
0408AC                     MOVELS4QULT    ASMETL
0408AC                     MOVELS4SPE1    ASSPE1
0408AC                     MOVELS4SPE2    ASSPE2
0408AC                     MOVELD#SPE5    ASSPE5
0408AC                     ENDIF
0408AC                     MOVELW#CHYN    ASCHYN
0407AC                     WRITERARDSDT
0407AC                     ENDDO
0407AC*
0407AC           W#AMTT    IFNE 0
0407AC           W1AMTT    ORNE 0
0407AC                     MOVEL'D'       W1KIND  1
0407AC           W1TXIT    IFNE 0
0407AC           KEY02     CHAINRARDSDT              56
0407AC           W#AMTT    IFNE 0
0510AC                     Z-ADDW#AMTT    ASDMT3
0407AC           ASDMT1    ADD  W#AMTT    ASDMT1
0407AC                     Z-ADD0         W#AMTT
0407AC                     ENDIF
0407AC*
0407AC           W1AMTT    IFNE 0
0510AC                     Z-ADDW1AMTT    ASDMT4
0407AC           ASDMT2    ADD  W1AMTT    ASDMT2
0407AC                     Z-ADD0         W1AMTT
0407AC                     ENDIF
0407AC  N56                UPDATRARDSDT
0407AC                     ENDIF
0407AC*
0407AC           W1TXIT    IFEQ 0
0407AC           KEY02     SETLLRARDSDT
0407AC                     MOVEL*OFF      *IN58
0407AC           *IN58     DOWEQ*OFF
0407AC           KEY02     READERARDSDT                  58
0407AC   58                LEAVE
0407AC           ASPDNM    IFEQ W1PDNM
0407AC           W#AMTT    IFNE 0
0510AC                     Z-ADDW#AMTT    ASDMT3
0407AC           ASDMT1    ADD  W#AMTT    ASDMT1
0407AC                     Z-ADD0         W#AMTT
0407AC                     ENDIF
0407AC           W1AMTT    IFNE 0
0510AC                     Z-ADDW1AMTT    ASDMT4
0407AC           ASDMT2    ADD  W1AMTT    ASDMT2
0407AC                     Z-ADD0         W1AMTT
0407AC                     ENDIF
0407AC                     UPDATRARDSDT
0407AC                     ENDIF
0407AC                     ENDDO
0407AC                     ENDIF
0407AC*
0407AC                     ENDIF
0407AC                     ENDSR
0408AC****************************************************************
0408AC           SR4000    BEGSR
0408AC****************************************************************
0408AC*
0408AC                     MOVEL*BLANKS   W#TXNO  8
0408AC                     Z-ADD0         W#VQTY  80
0408AC                     MOVEL*OFF      *IN97
0410AC           KEY07     SETLLTRNDLG
0408AC           *IN97     DOWEQ*OFF
0410AC           KEY07     READETRNDLG              N    97
0408AC   97                LEAVE
0408AC*          T2TXNO    IFEQ W#TXNO                     同磅單只做一次
0408AC*                    ITER
0408AC*                    ELSE
0408AC*                    MOVELT2TXNO    W#TXNO
0408AC*                    ENDIF
0408AC                     MOVEL*OFF      *IN96
0408AC           KEY03     SETLLHSVOUR
0408AC           *IN96     DOWEQ*OFF
0408AC           KEY03     READERHSVOUR                  96
0408AC   96                LEAVE
0410AC           S4ORNO    IFNE T2ORNO
0410AC                     ITER
0410AC                     ENDIF
0408AC*
0408AC*計算分攤數量
0408AC*
0408AC                     SELEC
0408AC*依鋼種分攤
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC*
0408AC           S4QULT    IFEQ S#METL
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'2'       W#CHYN
0408AC*
0408AC                     ENDIF
0408AC*依鋼種尺寸分攤(不含T1)
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDNE*BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC*
0408AC           S4QULT    IFEQ S#METL
0408AC           S4SPE1    ANDEQS#XHWD
0408AC           S4SPE2    ANDEQS#XXBT
0408AC*
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'3'       W#CHYN
0408AC*
0408AC                     ENDIF
0605AC*依鋼種尺寸分攤(含T1)
0605AC           S#METL    WHNE *BLANKS
0605AC           S#XHWD    ANDNE*BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC*
0605AC           S4QULT    IFEQ S#METL
0605AC           S4SPE1    ANDEQS#XHWD
0605AC           S4SPE2    ANDEQS#XXBT
0605AC           S4SPE3    ANDEQS#XXT1
0605AC*
0605AC           S4TYPE    IFEQ '0'
0605AC                     ADD  S4STDW    W#VQTY
0605AC                     ELSE
0605AC                     ADD  S4NWGT    W#VQTY
0605AC                     ENDIF
0605AC                     MOVEL'9'       W#CHYN
0605AC                     ENDIF
0408AC*依鋼種尺寸長度分攤(不含T1)
0408AC           S#METL    WHNE *BLANKS
0408AC           S#XHWD    ANDNE*BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC*
0408AC           S4QULT    IFEQ S#METL
0408AC           S4SPE1    ANDEQS#XHWD
0408AC           S4SPE2    ANDEQS#XXBT
0408AC           D#SPE5    ANDEQS#LENG
0408AC*
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'4'       W#CHYN
0408AC*
0408AC                     ENDIF
0605AC*依鋼種尺寸長度分攤(含T1)
0605AC           S#METL    WHNE *BLANKS
0605AC           S#XHWD    ANDNE*BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDNE*BLANKS
0605AC*
0605AC           S4QULT    IFEQ S#METL
0605AC           S4SPE1    ANDEQS#XHWD
0605AC           S4SPE2    ANDEQS#XXBT
0605AC           S4SPE3    ANDEQS#XXT1
0605AC           D#SPE5    ANDEQS#LENG
0605AC*
0605AC           S4TYPE    IFEQ '0'
0605AC                     ADD  S4STDW    W#VQTY
0605AC                     ELSE
0605AC                     ADD  S4NWGT    W#VQTY
0605AC                     ENDIF
0605AC                     MOVEL'A'       W#CHYN
0605AC*
0605AC                     ENDIF
0408AC*依鋼種長度分攤
0408AC           S#METL    WHNE *BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0408AC*
0408AC           S4QULT    IFEQ S#METL
0408AC           D#SPE5    ANDEQS#LENG
0408AC*
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'8'       W#CHYN
0408AC*
0408AC                     ENDIF
0408AC*依尺寸分攤(不含T1)
0408AC           S#XHWD    WHNE *BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDEQ*BLANKS
0408AC           S#METL    ANDEQ*BLANKS
0408AC*
0408AC           S4SPE1    IFEQ S#XHWD
0408AC           S4SPE2    ANDEQS#XXBT
0408AC*
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'5'       W#CHYN
0408AC*
0408AC                     ENDIF
0605AC*依尺寸分攤(含T1)
0605AC           S#XHWD    WHNE *BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDEQ*BLANKS
0605AC           S#METL    ANDEQ*BLANKS
0605AC*
0605AC           S4SPE1    IFEQ S#XHWD
0605AC           S4SPE2    ANDEQS#XXBT
0605AC           S4SPE3    ANDEQS#XXT1
0605AC*
0605AC           S4TYPE    IFEQ '0'
0605AC                     ADD  S4STDW    W#VQTY
0605AC                     ELSE
0605AC                     ADD  S4NWGT    W#VQTY
0605AC                     ENDIF
0605AC                     MOVEL'B'       W#CHYN
0605AC                     ENDIF
0408AC*依尺寸長度分攤(不含T1)
0408AC           S#XHWD    WHNE *BLANKS
0408AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDEQ*BLANKS
0408AC           S#LENG    ANDNE*BLANKS
0408AC           S#METL    ANDEQ*BLANKS
0408AC*
0408AC           S4SPE1    IFEQ S#XHWD
0408AC           S4SPE2    ANDEQS#XXBT
0408AC           D#SPE5    ANDEQS#LENG
0408AC*
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'6'       W#CHYN
0408AC*
0408AC                     ENDIF
0605AC*依尺寸長度分攤(含T1)
0605AC           S#XHWD    WHNE *BLANKS
0605AC           S#XXBT    ANDNE*BLANKS
0605AC           S#XXT1    ANDNE*BLANKS
0605AC           S#LENG    ANDNE*BLANKS
0605AC           S#METL    ANDEQ*BLANKS
0605AC*
0605AC           S4SPE1    IFEQ S#XHWD
0605AC           S4SPE2    ANDEQS#XXBT
0605AC           S4SPE3    ANDEQS#XXT1
0605AC           D#SPE5    ANDEQS#LENG
0605AC*
0605AC           S4TYPE    IFEQ '0'
0605AC                     ADD  S4STDW    W#VQTY
0605AC                     ELSE
0605AC                     ADD  S4NWGT    W#VQTY
0605AC                     ENDIF
0605AC                     MOVEL'C'       W#CHYN
0605AC*
0605AC                     ENDIF
0408AC*依長度分攤
0408AC           S#LENG    WHNE *BLANKS
0408AC           S#XHWD    ANDEQ*BLANKS
0408AC           S#XXBT    ANDEQ*BLANKS
0408AC           S#METL    ANDEQ*BLANKS
0408AC*
0408AC           D#SPE5    IFEQ S#LENG
0408AC*
0408AC           S4TYPE    IFEQ '0'
0408AC                     ADD  S4STDW    W#VQTY
0408AC                     ELSE
0408AC                     ADD  S4NWGT    W#VQTY
0408AC                     ENDIF
0408AC                     MOVEL'7'       W#CHYN
0408AC*
0408AC                     ENDIF
0408AC*
0408AC                     ENDSL
0408AC*
0408AC                     ENDDO
0408AC                     ENDDO
0408AC*
0408AC*乘-1將W#VAMT換成正數(發票折讓金額)
0408AC*乘-1將IVAMT換成正數(發票稅額)
0408AC*
0408AC           W#VAMT    MULT -1        W#AMTT 120H
0510AC                     Z-ADDW#AMTT    K#AMTT 120H
0408AC           IVAMT     MULT -1        W1AMTT 120H
0510AC                     Z-ADDW1AMTT    K1AMTT 120H
0408AC*
0408AC*計算折讓單價(折讓金額/磅單符合條件之數量)
0408AC*
0408AC           W#AMTT    DIV  W#VQTY    W#PRIC  53H
0408AC*
0408AC                     Z-ADD0         W#QTY  120
0408AC                     MOVEL*BLANKS   W1TXNO           記錄調整磅單編號
0408AC                     MOVEL*BLANKS   W#TXNO           同磅單做一次
0408AC*
0408AC                     MOVEL*OFF      *IN97
0410AC           KEY07     SETLLTRNDLG
0408AC           *IN97     DOWEQ*OFF
0410AC           KEY07     READETRNDLG              N    97
0408AC   97                LEAVE
0408AC*          T2TXNO    IFEQ W#TXNO
0408AC*                    ITER
0408AC*                    ELSE
0408AC*                    MOVELT2TXNO    W#TXNO
0408AC*                    ENDIF
0408AC                     MOVEL*OFF      *IN96
0408AC           KEY03     SETLLHSVOUR
0408AC           *IN96     DOWEQ*OFF
0408AC           KEY03     READERHSVOUR                  96
0408AC   96                LEAVE
     C*
0410AC           S4ORNO    IFNE T2ORNO
0410AC                     ITER
0410AC                     ENDIF
0408AC*
0408AC                     SELEC
0408AC           W#CHYN    WHEQ '2'
0408AC           S#METL    ANDEQS4QULT
0408AC                     EXSR SR4500
0408AC           W#CHYN    WHEQ '3'                        不含T1
0408AC           S#METL    ANDEQS4QULT
0408AC           S#XHWD    ANDEQS4SPE1
0408AC           S#XXBT    ANDEQS4SPE2
0408AC                     EXSR SR4500
0605AC           W#CHYN    WHEQ '9'                        含T1
0605AC           S#METL    ANDEQS4QULT
0605AC           S#XHWD    ANDEQS4SPE1
0605AC           S#XXBT    ANDEQS4SPE2
0605AC           S#XXT1    ANDEQS4SPE3
0605AC                     EXSR SR4500
0408AC           W#CHYN    WHEQ '4'                        不含T1
0408AC           S#METL    ANDEQS4QULT
0408AC           S#XHWD    ANDEQS4SPE1
0408AC           S#XXBT    ANDEQS4SPE2
0408AC           S#LENG    ANDEQD#SPE5
0408AC                     EXSR SR4500
0605AC           W#CHYN    WHEQ 'A'
0605AC           S#METL    ANDEQS4QULT
0605AC           S#XHWD    ANDEQS4SPE1
0605AC           S#XXBT    ANDEQS4SPE2
0605AC           S#XXT1    ANDEQS4SPE3
0605AC           S#LENG    ANDEQD#SPE5
0605AC                     EXSR SR4500
0408AC           W#CHYN    WHEQ '8'
0408AC           S#METL    ANDEQS4QULT
0408AC           S#LENG    ANDEQD#SPE5
0408AC                     EXSR SR4500
0408AC           W#CHYN    WHEQ '5'                        不含T1
0408AC           S#XHWD    ANDEQS4SPE1
0408AC           S#XXBT    ANDEQS4SPE2
0408AC                     EXSR SR4500
0605AC           W#CHYN    WHEQ 'B'                        含T1
0605AC           S#XHWD    ANDEQS4SPE1
0605AC           S#XXBT    ANDEQS4SPE2
0605AC           S#XXT1    ANDEQS4SPE3
0605AC                     EXSR SR4500
0408AC           W#CHYN    WHEQ '6'                        不含T1
0408AC           S#XHWD    ANDEQS4SPE1
0408AC           S#XXBT    ANDEQS4SPE2
0408AC           S#LENG    ANDEQD#SPE5
0408AC                     EXSR SR4500
0605AC           W#CHYN    WHEQ 'C'                        含T1
0605AC           S#XHWD    ANDEQS4SPE1
0605AC           S#XXBT    ANDEQS4SPE2
0605AC           S#XXT1    ANDEQS4SPE3
0650AC           S#LENG    ANDEQD#SPE5
0605AC                     EXSR SR4500
0408AC           W#CHYN    WHEQ '7'
0408AC           S#LENG    ANDEQD#SPE5
0408AC                     EXSR SR4500
0408AC                     ENDSL
0408AC*
0408AC                     ENDDO
0408AC                     ENDDO
0408AC*
0408AC*
0408AC           W#AMTT    IFNE 0
0408AC           W1AMTT    ORNE 0
0408AC                     MOVEL'D'       W1KIND  1
0408AC           W1TXIT    IFNE 0
0408AC           KEY02     CHAINRARDSDT              56
0408AC           W#AMTT    IFNE 0
0510AC                     Z-ADDW#AMTT    ASDMT3
0408AC           ASDMT1    ADD  W#AMTT    ASDMT1
0408AC                     Z-ADD0         W#AMTT
0408AC                     ENDIF
0408AC*
0408AC           W1AMTT    IFNE 0
0510AC                     Z-ADDW1AMTT    ASDMT4
0408AC           ASDMT2    ADD  W1AMTT    ASDMT2
0408AC                     Z-ADD0         W1AMTT
0408AC                     ENDIF
0408AC  N56                UPDATRARDSDT
0408AC                     ENDIF
0408AC*
0408AC                     ENDIF
0408AC                     ENDSR
0408AC***************************************************************
0408AC           SR4500    BEGSR
0408AC*****************************************************************
0408AC*
0408AC                     MOVEL'A'       ASFLAG           處理代碼
0408AC                     MOVEL'D'       ASKIND           分攤類別
0408AC                     MOVELT2CUNO    ASCUNO           客戶代號
0408AC                     MOVELT2CUNM    ASCUNM           客戶名稱
0408AC                     MOVELT2ORNO    ASORNO           訂單編號
0408AC                     Z-ADDACYM      ASYYMM           處理年月
0408AC                     MOVELINKIND    ASTYPE           發票聯式
0408AC                     MOVELINRVID    ASSALE           業務員別
0408AC                     MOVELINAREA    ASAREA           廠區別
0408AC                     Z-ADDW#PRIC    ASAMT4           折讓單價
0408AC                     MOVELT2IVNO    ASINNO           發票號碼
0408AC                     MOVEL'3'       ASACNT           發票類別
0408AC*
0408AC*發票日期為主檔開立日，非明細檔之入帳日
0408AC*
0408AC                     Z-ADDININDT    ASINDT           發票日期
0408AC                     MOVELD#TXNO    ASTXNO           磅單編號
0408AC                     Z-ADDS4SQIT    ASTXIT           磅單項次
0408AC                     Z-ADDT2DATE    ASDATE           出貨日期
0408AC                     MOVELS4NAME    ASPDNM           品名
0408AC           S4TYPE    IFEQ '0'
0408AC                     Z-ADDS4STDW    ASQTY1
0408AC                     ELSE
0408AC                     Z-ADDS4NWGT    ASQTY1           銷貨數量
0408AC                     ENDIF
0408AC*
0408AC           W#QTY     IFEQ 0                          記錄調整最大量磅單
0408AC                     Z-ADDASQTY1    W#QTY
0408AC                     MOVELD#TXNO    W1TXNO
0408AC                     Z-ADDS4SQIT    W1TXIT
0408AC                     ELSE
0408AC           ASQTY1    IFGE W#QTY
0408AC                     Z-ADDASQTY1    W#QTY
0408AC                     MOVELD#TXNO    W1TXNO
0408AC                     Z-ADDS4SQIT    W1TXIT
0408AC                     ENDIF
0408AC                     ENDIF
     C*
0408AC           KEY05     CHAINHSMAST               58
0408AC  N58                Z-ADDS1UPRC    ASPRC1
0408AC   58                Z-ADD0         ASPRC1           銷貨單價
0408AC           ASQTY1    MULT ASPRC1    ASAMT1           銷貨金額
0408AC*
0408AC           W#PRIC    MULT ASQTY1    ASDMT1    H      折讓金額
0408AC           W#AMTT    SUB  ASDMT1    W#AMTT
0408AC           ASDMT1    MULT 0.05      ASDMT2    H      折讓稅額
0408AC           W1AMTT    SUB  ASDMT2    W1AMTT
0408AC                     MOVELTXNO      ASDXNO           折讓單號
0408AC                     Z-ADDTXITEM    ASDXIT           折讓單項次
0408AC                     MOVELT#USID    ASUPDM           異動人員
0408AC           *DATE     SUB  19000000  ASUPDD           異動日期
0408AC                     TIME           ASUPDT           異動時間
0510AC                     Z-ADDK#AMTT    ASDMT5           折讓總金額
0510AC                     Z-ADDK1AMTT    ASDMT6           折讓總稅額
0408AC*
0408AC                     MOVELS4QULT    ASMETL
0408AC                     MOVELS4SPE1    ASSPE1
0408AC                     MOVELS4SPE2    ASSPE2
0408AC                     MOVELD#SPE5    ASSPE5
0605AC                     MOVELS4SPE3    D1SPE3
0408AC                     MOVELW#CHYN    ASCHYN
0407AC                     WRITERARDSDT
0408AC*
0408AC*
0408AC                     ENDSR
0510AC****************************************************************
0510AC           SR5000    BEGSR
0510AC*****************************************************************
0510AC*
0510AC                     MOVELTXIVNO    IVNO
0510AC                     MOVELTXPDNM    W#PDCD  5        記錄品名
     C*
0510AC*乘-1將W#VAMT換成正數(發票折讓金額)
0510AC*乘-1將IVAMT換成正數(發票稅額)
0510AC*
0510AC           W#VAMT    MULT -1        W#AMTT 120H      折讓金額
0510AC                     Z-ADDW#AMTT    K#AMTT 120H      折讓金額
0510AC           IVAMT     MULT -1        W1AMTT 120H      折讓稅額
0510AC                     Z-ADDW1AMTT    K1AMTT 120H      折讓稅額
     C*
0510AC                     Z-ADD0         W#SQTY  90       磅單數量
0510AC                     MOVEL'N'       W#COYN  1
0510AC           KEY01     SETLLTRNDLB
0510AC                     MOVEL*OFF      *IN55
0510AC           *IN55     DOWEQ*OFF
0510AC           KEY01     READETRNDLB                   55
0510AC           *IN55     IFEQ *ON
0510AC           W#COYN    ANDEQ'N'
0510AC                     CLEARRARDSDT
0510AC                     MOVEL'D'       ASKIND
0510AC                     MOVELTXCUNO    ASCUNO
0510AC                     MOVELTXCUNM    ASCUNM
0510AC                     MOVELTXORNO    ASORNO
0510AC                     MOVELACYM      ASYYMM
0510AC           TXIVNO    CHAININREC                52
0510AC                     MOVELINKIND    ASTYPE           發票聯式
0510AC                     MOVELINRVID    ASSALE           業務員別
0510AC                     MOVELINAREA    ASAREA           廠區別
0510AC                     MOVELTXIVNO    ASINNO
0510AC                     MOVEL'3'       ASACNT
0510AC                     Z-ADDININDT    ASINDT           發票日期
0510AC                     MOVELW#PDCD    ASPDNM
0510AC                     Z-ADDW#AMTT    ASDMT1
0510AC                     Z-ADDW1AMTT    ASDMT2
0510AC                     MOVELTXNO      ASDXNO
0510AC                     Z-ADDTXITEM    ASDXIT
0510AC                     MOVELT#USID    ASUPDM           異動人員
0510AC           *DATE     SUB  19000000  ASUPDD           異動日期
0510AC                     TIME           ASUPDT           異動時間
0510AC                     MOVEL'1'       ASCHYN           分攤方式
0510AC                     Z-ADDK#AMTT    ASDMT5
0510AC                     Z-ADDK1AMTT    ASDMT6
0510AC                     MOVEL'IV'      ASRESV
0510AC                     WRITERARDSDT
0510AC                     ENDIF
0510AC   55                LEAVE
     C*
0510AC           T#QTY     IFLT 0
0510AC           T#AMT     ORLT 0
0510AC                     ITER
0510AC                     ENDIF
     C*
0510AC                     MOVEL'Y'       W#COYN
     C*
0510AC                     MOVEL'N'       W1COYN  1
0510AC           KEY09     SETLLRSRVOUR
0510AC                     MOVEL*OFF      *IN57
0510AC           *IN57     DOWEQ*OFF
0510AC           KEY09     READERSRVOUR                  57
0510AC           *IN57     IFEQ *ON
0510AC           W1COYN    ANDEQ'N'
0510AC                     CLEARRARDSDT
0510AC                     MOVEL'D'       ASKIND
0510AC                     MOVELT#CUNO    ASCUNO
0510AC                     MOVELT#CUNM    ASCUNM
0510AC                     MOVELT#ORNO    ASORNO
0510AC                     MOVELACYM      ASYYMM
0510AC           TXIVNO    CHAININREC                52
0510AC                     MOVELINKIND    ASTYPE           發票聯式
0510AC                     MOVELINRVID    ASSALE           業務員別
0510AC                     MOVELINAREA    ASAREA           廠區別
0510AC                     MOVELT#IVNO    ASINNO
0510AC                     MOVEL'3'       ASACNT
0510AC                     Z-ADDININDT    ASINDT           發票日期
0510AC                     MOVELT#TXNO    ASTXNO
0510AC           D#TXIT    IFNE *BLANKS
0510AC                     MOVELD#TXIT    ASTXIT
0510AC                     ENDIF
0510AC                     MOVELT#DATE    ASDATE
0510AC                     MOVELT#PDNM    ASPDNM
0510AC                     Z-ADDT#QTY     ASQTY1
0510AC                     Z-ADDT#UPRC    ASPRC1
0510AC                     Z-ADDT#AMT     ASAMT1
0510AC                     Z-ADDT#QTY     ASQTY2
0510AC                     ADD  ASQTY1    W#SQTY
0510AC                     MOVELTXNO      ASDXNO
0510AC                     MOVELTXITEM    ASDXIT
0510AC                     MOVELT#USID    ASUPDM           異動人員
0510AC           *DATE     SUB  19000000  ASUPDD           異動日期
0510AC                     TIME           ASUPDT           異動時間
0510AC                     MOVEL'1'       ASCHYN           分攤方式
0510AC                     Z-ADDK#AMTT    ASDMT5
0510AC                     Z-ADDK1AMTT    ASDMT6
0510AC                     MOVEL'SR'      ASRESV
0510AC                     WRITERARDSDT
0510AC                     ENDIF
0510AC   57                LEAVE
     C*
0510AC                     MOVEL'Y'       W1COYN
0510AC                     CLEARRARDSDT
     C*
0510AC                     MOVELT#TXNO    W1TXNO  8
0510AC                     Z-ADDO#VRTM    W1TXIT  20
     C*
0510AC                     Z-ADDT#QTY     W1QTY   70
0510AC                     MOVELT#PDNM    W1PDNM  5
0510AC                     Z-ADDT#UPRC    W1UPRC  53
     C*
0510AC                     MOVEL'A'       ASFLAG           處理代碼
0510AC                     MOVEL'D'       ASKIND           分攤類別
0510AC                     MOVELT#CUNO    ASCUNO           客戶代號
0510AC                     MOVELT#CUNM    ASCUNM           客戶名稱
0510AC                     MOVELT#ORNO    ASORNO           訂單編號
0510AC                     Z-ADDACYM      ASYYMM           處理年月
0510AC           TXIVNO    CHAININREC                52
0510AC                     MOVELINKIND    ASTYPE           發票聯式
0510AC                     MOVELINRVID    ASSALE           業務員別
0510AC                     MOVELINAREA    ASAREA           廠區別
0510AC                     MOVELT#IVNO    ASINNO           發票號碼
0510AC                     MOVEL'3'       ASACNT           發票類別
     C*
     C*發票日期為主檔開立日，非明細檔之入帳日
     C*
0510AC                     Z-ADDININDT    ASINDT           發票日期
0510AC                     MOVELT#TXNO    ASTXNO           磅單編號
0510AC                     Z-ADDW1TXIT    ASTXIT           磅單項次
0510AC                     Z-ADDT#DATE    ASDATE           出貨日期
0510AC                     MOVELT#PDNM    ASPDNM           品名
0510AC                     Z-ADDO#NWGT    ASQTY1           銷貨數量
0510AC                     Z-ADDT#UPRC    ASPRC1           TR銷貨單價
0510AC                     Z-ADDT#AMT     ASAMT1           TR銷貨金額
0510AC                     Z-ADDT#QTY     ASQTY2           TR銷貨數量
0510AC                     ADD  ASQTY1    W#SQTY
     C*
0510AC                     MOVELTXNO      ASDXNO           折讓單號
0510AC                     Z-ADDTXITEM    ASDXIT           折讓單項次
0510AC                     MOVELT#USID    ASUPDM           異動人員
0510AC           *DATE     SUB  19000000  ASUPDD           異動日期
0510AC                     TIME           ASUPDT           異動時間
0510AC                     MOVEL'1'       ASCHYN           分攤方式
0510AC                     Z-ADDK#AMTT    ASDMT5           折讓總金額
0510AC                     Z-ADDK1AMTT    ASDMT6           折讓總稅額
0510AC                     WRITERARDSDT
0510AC                     ENDDO
     C*
0510AC                     ENDDO
     C*
0510AC           W#COYN    IFEQ 'N'
0510AC                     GOTO END500
0510AC                     ENDIF
     C*
0510AC                     MOVEL*OFF      *IN57
0510AC           KEY10     SETLLARDSD5
0510AC           *IN57     DOWEQ*OFF
0510AC           KEY10     READEARDSD5                   57
0510AC   57                LEAVE
0510AC           ASQTY1    DIV  W#SQTY    ASAMT5
0510AC           ASAMT5    MULT K#AMTT    ASDMT1    H      折讓金額
0510AC           W#AMTT    SUB  ASDMT1    W#AMTT
0510AC           ASAMT5    MULT K1AMTT    ASDMT2    H      折讓稅額
0510AC           W1AMTT    SUB  ASDMT2    W1AMTT
0510AC                     UPDATARDSD5
0510AC                     ENDDO
0510AC*
0510AC           W#AMTT    IFNE 0
0510AC           W1AMTT    ORNE 0
0510AC                     MOVEL'D'       W1KIND  1
0510AC           W1TXIT    IFNE 0
0510AC           KEY02     CHAINRARDSDT              56
0510AC           W#AMTT    IFNE 0
0510AC                     Z-ADDW#AMTT    ASDMT3
0510AC           ASDMT1    ADD  W#AMTT    ASDMT1
0510AC                     Z-ADD0         W#AMTT
0510AC                     ENDIF
     C*
0510AC           W1AMTT    IFNE 0
0510AC                     Z-ADDW1AMTT    ASDMT4
0510AC           ASDMT2    ADD  W1AMTT    ASDMT2
0510AC                     Z-ADD0         W1AMTT
0510AC                     ENDIF
0510AC  N56                UPDATRARDSDT
0510AC                     ENDIF
     C*
0510AC           W1TXIT    IFEQ 0
0510AC           KEY02     SETLLRARDSDT
0510AC                     MOVEL*OFF      *IN58
0510AC           *IN58     DOWEQ*OFF
0510AC           KEY02     READERARDSDT                  58
0510AC   58                LEAVE
0510AC           ASPDNM    IFEQ W1PDNM
0510AC           W#AMTT    IFNE 0
0510AC                     Z-ADDW#AMTT    ASDMT3
0510AC           ASDMT1    ADD  W#AMTT    ASDMT1
0510AC                     Z-ADD0         W#AMTT
0510AC                     ENDIF
0510AC           W1AMTT    IFNE 0
0510AC                     Z-ADDW1AMTT    ASDMT4
0510AC           ASDMT2    ADD  W1AMTT    ASDMT2
0510AC                     Z-ADD0         W1AMTT
0510AC                     ENDIF
0510AC                     UPDATRARDSDT
0510AC                     ENDIF
0510AC                     ENDDO
0510AC                     ENDIF
     C*
0510AC                     ENDIF
0510AC           END500    ENDSR
0510AC***************************************************************
0611AC           SR6000    BEGSR
0611AC*****************************************************************
0611AC*
0611AC                     CLEARRINETRN
0611AC                     MOVEL'B0101'   TRMSTE
0611AC                     MOVELNO        TRNO
0611AC           TXTXDT    ADD  19110000  TRINDT
0611AC*          ININDT    ADD  19110000
0611AC                     ENDSR
0611AC****************************************************************
** ERR
功能代碼必須輸入．
功能代碼必須為１，２，３，４，５，６
非新增時，折讓單號必須輸入
此張折讓單已存在
此張折讓單已確認，不可再修改
此張折讓單已確認，不可再刪除
此張折讓單不存在
發票號碼必須輸入
品名代號不存在
此張折讓單已確認
種類別必須輸入
種類別必須為２，３，４
客戶編號不存在
此發票號碼非屬此客戶
此發票號碼不存在
此發票號碼已作廢
折讓證明單已列印完畢．
新增時折讓單號不可輸入
開立日期錯誤
確認日期錯誤
發票餘額已等於０，不可再有折讓
金額不可為０
此張折讓單非屬本廠區，不可更改，刪除，確認及列印
折讓確認日期為９９９９９９９９時，則入帳年月必須輸入
此張發票之折讓稅額與折讓金額計算出之稅額相差２元以上，不合理，請查核
２６－折讓退回證明單內含有不同的統一編號發票。
２７－此預收發票無繳款紀錄,不得折讓,請查核！
２８－此張發票之折讓金額不可大於發票金額！
２９－該張預收發票折讓不須打品名！
３０－此張發票尚未押匯，不可開立折讓單！
３１－資料不存在
３２－載入之發票筆數多於折讓畫面內空白的項次，載入不完整
３３－載入之發票已存回折讓畫面，合計存回筆數：
３４－載入之發票不屬於同一張訂單，請查核
３５－鋼種、尺寸、長度欄位須擇一輸入!
３６－種類別必須為３!
３７－此發票對應磅單無此鋼種，請確認!
３８－此發票對應磅單無此尺寸，請確認！
３９－此發票對應磅單無此長度，請確認！
４０－不做分攤鋼種、尺寸、長度欄位須空白!
４１－尺寸欄位H/W/D及B/T須同時填入資料!
４２－此發票對應磅單無此鋼種、尺寸，請確認!
４３－此發票對應磅單無此鋼種、尺寸、長度，請確認!
４４－此發票對應磅單無此尺寸、長度，請確認!
４５－此發票對應磅單無此鋼種、長度，請確認！
４６－依鋼種尺寸分攤，確認日期須為999999999!!
４７－發票明細中無此產品代碼，請確認!!
４８－品名不可空白!!
４９－若為客戶開立之折讓單，請改為１，按執行鍵繼續!
** TY1
客戶開立
東和開立
