     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARE026RS
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     業務員基本資料傳輸廠區作業畫面
     H*            5.DATE-WRITTEN  86/12/11
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARE026S2CF  E                    WORKSTN
     I*************************************************************
     I           UDS
     I                                      951 985 S#COMP
     I                                     10111020 S#DEVI
     I                                     10011010 U#USID
     I                                     10211021 U#AREA
     I            DS
9008 I                                        1   80W#DATE
LYW  I                                        1   40D#YY
     C**************************************************************
     C*   程式參數傳遞區
     C**************************************************************
     C           *ENTRY    PLIST
     C                     PARM           P#IN03  1
     C**************************************************************
     C                     MOVEL'Y'       S#YN
     C                     EXFMTAR026F1
     C           *IN03     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVEL'1'       P#IN03
     C                     ELSE
     C           S#YN      IFEQ 'Y'
     C                     MOVEL'0'       P#IN03
     C                     ELSE
     C                     MOVEL'1'       P#IN03
     C                     ENDIF
     C                     ENDIF
     C                     SETON                     LR
     C*
