     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARE105R1
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     發票號碼使用檢核副程式
     A*            5.DATE-WRITTEN  107/03/20 2017AR1112
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     H        1   Y                                     1                 BR003
     FGENSEQ  IF  E           K        DISK
     E*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10011010 D#USER
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C*
     C           GEKEY     KLIST
     C                     KFLD           GEKIND
     C                     KFLD           GEPRIN
     C*
     C**************************************************************
     C           *ENTRY    PLIST
     C                     PARM           W#PRIN 10
     C                     PARM           W#ERR   1
     C**
     C                     EXSR CK#01
     C**
     C                     SETON                     LR
     C                     RETRN
     C**************************************************************
     CSR         CK#01     BEGSR
     C**************************************************************
     C                     Z-ADD0         STNO2   80
     C                     Z-ADD0         STNO3   80
     C                     Z-ADD0         CUNO2   80
     C                     Z-ADD0         CUNO3   80
     C                     MOVEL*OFF      *IN96
     C                     MOVEL'01'      GEKIND
     C                     MOVEL*BLANK    GEPRIN
     C                     MOVELW#PRIN    GEPRIN
     C           GEKEY     CHAINGENSEQ              N96
     C  N96                Z-ADDGESTNO    STNO2
     C  N96                Z-ADDGECUNO    CUNO2
     C                     MOVEL'02'      GEKIND
     C           GEKEY     CHAINGENSEQ              N96
     C  N96                Z-ADDGESTNO    STNO3
     C  N96                Z-ADDGECUNO    CUNO3
     C  N96      STNO2     IFLE CUNO2
     C           STNO3     ORLE CUNO3
     C                     MOVEL'1'       W#ERR
     C                     ELSE
     C                     MOVEL'0'       W#ERR
     C                     ENDIF
     C   96                MOVEL'0'       W#ERR
     C*
     C                     ENDSR
