     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARE111RS
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     更換請款單業務員作業畫面
     A*            5.DATE-WRITTEN  112/10/26
     A*            6.UPDATE  DATE
     A*
     A*
     H****************************************************************
     H        1   Y                                     1                 BR003
     FARE111S CF  E                    WORKSTN
     FINVMSTL5IF  E           K        DISK
     FARSAID  IF  E           K        DISK
     E*************************************************************
     E                    ERR     1  10 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           S#APNO  7
     C                     PARM           S#SALE  1
     C                     PARM           S#CHSA  1
     C**************************************************************
     C           *DATE     SUB  19000000  U#SYSD  80
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C****
     CSR         CK#01     BEGSR
     C*
     C                     SETOF                     414243
     C                     SETOF                     99
     C*
     C           S#APNO    IFEQ ' '
     C                     MOVELERR,1     ERRMSG
     C                     SETON                     4199
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C           S#SALE    IFEQ ' '
     C                     MOVELERR,2     ERRMSG
     C                     SETON                     4299
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C           S#CHSA    IFEQ ' '
     C                     MOVELERR,2     ERRMSG
     C                     SETON                     4399
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C           S#APNO    IFNE *BLANKS
     C           S#APNO    CHAININREC               N51
     C   51                MOVELERR,3     ERRMSG
     C   51                SETON                     4199
     C   99                GOTO CK#01Z
     C                     ENDIF
     C*
     C           S#APNO    IFNE *BLANKS
     C                     MOVEL*BLANKS   W#CHK   1
     C                     MOVEL*OFF      *IN52
     C           S#APNO    SETLLINREC
     C           *IN52     DOWEQ*OFF
     C           S#APNO    READEINREC               N    52
     C   52                LEAVE
     C           INRVID    IFNE S#SALE
     C                     ITER
     C                     ELSE
     C                     MOVEL'Y'       W#CHK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           W#CHK     IFNE 'Y'
     C                     MOVELERR,4     ERRMSG
     C                     SETON                     4299
     C                     GOTO CK#01Z
     C                     ENDIF
     C                     ENDIF
     C*
     C           S#CHSA    IFNE *BLANKS
     C                     MOVELS#CHSA    W#CHSA  2
     C           W#CHSA    CHAINRARSAID             N51
     C   51                MOVELERR,5     ERRMSG
     C   51                SETON                     4399
     C   99                GOTO CK#01Z
     C                     ENDIF
     C*
     CSR         CK#01Z    ENDSR
     C******
** ERR
01-請款單號不可空白
02-欄位不可空白
03-無此請款單，請確認
04-此請款單原務員輸入錯誤或無資料須修改，請確認
05-欲更換之業務員代號不存在，請確認
