     H            Y                                     1                 BR100
     FARINVM  UP  E           K        DISK
     FARINVMW UF  E           K        DISK                      A
     IRARINVM     01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C           AMINNO    CHAINRARINVMW             40
     C                     MOVE AMFLAG    AWFLAG
     C                     MOVE AMINNO    AWINNO
     C                     Z-ADDAMINDT    AWINDT
     C                     Z-ADDAMDUDT    AWDUDT
     C                     MOVE AMINTP    AWINTP
     C                     MOVE AMDELT    AWDELT
     C                     MOVE AMDELD    AWDELD
     C                     MOVE AMCUNO    AWCUNO
     C                     MOVE AMCUNM    AWCUNM
     C                     Z-ADDAMAAMT    AWAAMT
     C                     Z-ADDAMATAX    AWATAX
     C                     Z-ADDAMBAMT    AWBAMT
     C                     Z-ADDAMBTAX    AWBTAX
     C                     Z-ADDAMCAMT    AWCAMT
     C                     Z-ADDAMDAMT    AWDAMT
     C                     Z-ADDAMEAMT    AWEAMT
     C                     Z-ADDAMFAMT    AWFAMT
     C                     MOVE AMAPN1    AWAPN1
     C                     Z-ADDAMAPD1    AWAPD1
     C                     MOVE AMAPCD    AWAPCD
     C                     MOVE AMAPN2    AWAPN2
     C                     Z-ADDAMAPD2    AWAPD2
     C                     MOVE AMORNO    AWORNO
     C                     MOVE AMAREA    AWAREA
     C                     MOVE AMACN1    AWACN1
     C                     Z-ADDAMDAT1    AWDAT1
     C                     MOVE AMDLC1    AWDLC1
     C                     MOVE AMBLCB    AWBLCB
     C                     MOVE AMDLM1    AWDLM1
     C                     Z-ADDAMDLD1    AWDLD1
     C                     MOVE AMCHKC    AWCHKC
     C                     MOVE AMCHKM    AWCHKM
     C                     Z-ADDAMCHKD    AWCHKD
     C                     MOVE AMDLC2    AWDLC2
     C                     MOVE AMDLM2    AWDLM2
     C                     Z-ADDAMDLD2    AWDLD2
     C                     MOVE AMCLOC    AWCLOC
     C                     MOVE AMCLOM    AWCLOM
     C                     Z-ADDAMCLOD    AWCLOD
     C                     MOVE AMUPDM    AWUPDM
     C                     Z-ADDAMUPDD    AWUPDD
     C                     Z-ADDAMUPDT    AWUPDT
     C   40                WRITERARINVMW
     C  N40                UPDATRARINVMW
     C*
     C           U#AREA    IFNE 'P'                        廠區
     C                     MOVE *BLANK    AMFLAG
     C                     UPDATRARINVM
     C                     ELSE
     C           AMFLAG    IFEQ 'D'                        台北
     C                     DELETRARINVM
     C                     ELSE
     C                     MOVE *BLANK    AMFLAG
     C                     UPDATRARINVM
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
