     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP090R4A
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            4.FUNCTION     依調整計算出調整兌現日
     H*            5.DATE-WRITTEN  91/03/26
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARP090X UP  E           K        DISK
     FARP090F IF  E           K        DISK
     IRARP090X    01
     I           UDS
     I                                      301 301 D#SLC1
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           D#SLC1    IFEQ '1'                        客戶別
     C                     MOVELA1CUNO    W#COD1  6
     C                     ELSE
     C                     MOVELA1SALE    W#COD1
     C                     ENDIF
     C*
     C           W#COD1    CHAINRARP090F             40
     C*
     C                     MOVE A1DAT1    P#PDAT
     C                     MOVE '1'       P#MODE           民國年
     C           AFDAY2    IFLT 0
     C                     MOVE '1'       P#OMOD           向前
     C                     MULT -1        AFDAY2
     C                     ELSE
     C                     MOVE '2'       P#OMOD           向後
     C                     ENDIF
     C                     MOVE AFDAY2    P#DAYS           天數
     C                     CALL 'UTS104R'
     C                     PARM           P#PDAT  8
     C                     PARM           P#MODE  1
     C                     PARM           P#OMOD  1
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#ERR   1
     C                     MOVE P#RDAT    A1DAT2           調整兌現日
     C*
     C                     UPDATRARP090X
     C*
     C                     ENDSR
