     H            Y                                     1                 BR100
     FRCVDW   IF  E           K        DISK
     F            RVREC                             KRENAMEWRV
     FRCVDTL  UF  E           K        DISK
     IWRV         01
     I              RVNO                            NO
     I              RVITEM                          ITEM
     I              RVSBID                          SBID
     I              RVSANO                          SANO
     I              RVNTCD                          NTCD
     I              RVNTDT                          NTDT
     I              RVTXDT                          TXDT
     I              RVAREA                          AREA
     I           UDS
     I                                        1   6 WNO
     I                                        7   80WITEM
     I                                     10211021 LOC
     C           RVKEY     KLIST
     C                     KFLD           RVNO
     C                     KFLD           RVITEM
     C           RVKEY1    KLIST
     C                     KFLD           WNO
     C                     KFLD           WITEM
     C           RVKEY1    CHAINWRV                  31
     C           *IN31     IFEQ '0'
     C           LOC       ANDNEAREA
     C                     EXSR UPTAL
     C                     ENDIF
     C                     SETON                     LR
     C**********
     C* UPTAL  *
     C**********
     C           UPTAL     BEGSR
     C                     MOVELNO        RVNO
     C                     MOVELITEM      RVITEM
     C           RVKEY     CHAINRCVDTL               31
     C           *IN31     IFEQ '0'
     C                     MOVELSBID      RVSBID
     C                     MOVELSANO      RVSANO
     C                     MOVELNTCD      RVNTCD
     C                     Z-ADDNTDT      RVNTDT
     C                     Z-ADDTXDT      RVTXDT
     C                     UPDATRVREC
     C                     ENDIF
     C                     ENDSR
