     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP012RA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     調整單代開傳票(前期處理)
     H*            5.DATE-WRITTEN  100/06/07  2011AR607
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FTRNDTL  IP  E           K        DISK
     FTRNDTLZ O   E           K        DISK
     F            TXREC                             KRENAMETRZ
     FTRNDTLU IF  E           K        DISK
     F            TXREC                             KRENAMETRLU
     FWTMASPL2IF  E           K        DISK
     FAMPRODL3IF  E           K        DISK
     I*****************************************************************
     ITRLU        01
     I              TXFLAG                          FLAG
     I              TXCODE                          CODE
     I              TXNO                            NO
     I              TXITEM                          ITEM
     I              TXACNT                          ACNT
     I              TXDATE                          DATE
     I              TXACDT                          ACDT
     I              TXCUNO                          CUNO
     I              TXCUNM                          CUNM
     I              TXORNO                          ORNO
     I              TXIVNO                          IVNO
     I              TXPCNO                          PCNO
     I              TXVUNO                          VUNO
     I              TXRVID                          RVID
     I              TXSALE                          SALE
     I              TXSATP                          SATP
     I              TXIVTP                          IVTP
     I              TXPDNM                          PDNM
     I              TXQTY                           QTY
     I              TXUPRC                          UPRC
     I              TXAMT                           AMT
     I              TXTAX                           TAX
     I              TXFL01                          FL01
     I              TXFL02                          FL02
     I              TXTXAR                          TXAR
     I              TXTXDT                          TXDT
     I              TXRESV                          RESV
     I*
     I            DS
     I                                        1   8 D#TXNO
     I                                        1   1 D#TXN1
     I                                        2   3 D#TXN2
     I                                        4   80D#TXN3
     I            DS
     I                                        1  15 TXRESV
     I                                        1   3 D#PDNO
     I            DS
     I                                        1   4 W6STNO
     I                                        4   4 W#STNO
     C*****************************************************************
     C           KEY01     KLIST
     C                     KFLD           D#TXN1
     C                     KFLD           D#TXN2
     C                     KFLD           D#TXN3
     C           KEY02     KLIST
     C                     KFLD           D#AREA  1
     C                     KFLD           W#PDNM
     C           K#TX      KLIST
     C                     KFLD           F#CODE  4
     C                     KFLD           F#NO    8
     C*****************************************************************
     C*
     C                     MOVEL'U'       D#AREA
     C                     EXSR SR1000
     C                     MOVELTXPCNO    D#TXNO
0007AC           D#TXN1    IFEQ 'U'
0007AC           D#TXN1    OREQ 'D'
     C           KEY01     CHAINWTMASPL2            N51
     C           *IN51     IFEQ *OFF
     C           W#STNO    IFNE 'E'
     C           KEY02     CHAINAMPRODL3            N52
     C  N52                MOVELAPSTNO    TXSTNO
     C   52                MOVEL*BLANKS   TXSTNO
     C                     ENDIF
     C           W#STNO    IFEQ 'E'
     C                     MOVELW6STNO    TXSTNO
     C                     ENDIF
     C*
     C                     ELSE
     C           KEY02     CHAINAMPRODL3            N52
     C  N52                MOVELAPSTNO    TXSTNO
     C   52                MOVEL*BLANKS   TXSTNO
     C                     ENDIF
0007AC                     ELSE
0007AC                     MOVEL*BLANKS   TXSTNO
0007AC                     ENDIF
     C                     WRITETRZ
     C*
     C****************************************************************
     C           SR1000    BEGSR
     C****************************************************************
     C*
     C                     MOVEL'SA04'    F#CODE
     C                     MOVELTXPCNO    F#NO
     C                     MOVEL*BLANK    W#PDNM  3
     C                     Z-ADD0         W#QTY   70
     C           K#TX      CHAINTRLU                 69
     C           *IN69     DOWEQ'0'
     C           QTY       IFGT W#QTY
     C                     Z-ADDQTY       W#QTY
     C                     MOVELPDNM      W#PDNM           量多之品名
     C                     ENDIF
     C           K#TX      READETRLU                     69
     C                     ENDDO
     C*
     C                     ENDSR
