     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP071R3
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     客戶暫收統計檔期初設定─彙總
     H*            5.DATE-WRITTEN  88/11/30
     H*
     H*****************************************************************
     FAR2159F UP  E           K        DISK
     I*****************************************************************
     I           UDS
     I                                        1   1 U#AREA
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C  N99                SETON                     99
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     CLRN99                EXSR MSGSR
     C*
     C*********************************
     C*  初始程式
     C*********************************
     CSR         INISR     BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  DETAIL TIME 函式
     C*********************************
     CSR         DTLSR     BEGSR
     C                     MOVEL'A'       ARFLAG           設定異動
     C           ARAMT4    IFGE ARAMT3                     餘額較大
     C           ARAMT4    SUB  ARAMT3    ARAMT1           有現金
     C                     ELSE
     C           ARAMT3    SUB  ARAMT4    ARAMT2           有貨款
     C                     ENDIF
     C                     Z-ADD0         ARAMT4           清備註
     C                     UPDATARREC
     CSR                   ENDSR
     C*
     C*********************************
     C*  LR 函式  印核覆
     C*********************************
     CSR         LRSR      BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  查無資料函式
     C*********************************
     CSR         MSGSR     BEGSR
     CSR                   ENDSR
     C*
     C*****************************************************************
