     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP070RA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     客戶暫收統計檔上傳台北─沖銷處理
     H*            5.DATE-WRITTEN  88/11/30
     H*
     H*****************************************************************
     FAR2159F UP  E           K        DISK
     I*****************************************************************
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C  N99                SETON                     99
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     CLRN99                EXSR MSGSR
     C*
     C*********************************
     C*  初始程式
     C*********************************
     CSR         INISR     BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  DETAIL TIME 函式
     C*********************************
     CSR         DTLSR     BEGSR
     C           ARAMT2    IFGE ARAMT1                     貨款較多
     C                     SUB  ARAMT1    ARAMT2
     C                     Z-ADD0         ARAMT1
     C                     ELSE                            現金較多
     C                     SUB  ARAMT2    ARAMT1
     C                     Z-ADD0         ARAMT2
     C                     ENDIF
     C*
     C                     UPDATARREC                      存回
     CSR                   ENDSR
     C*********************************
     C*  LR 函式  印核覆
     C*********************************
     CSR         LRSR      BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  查無資料函式
     C*********************************
     CSR         MSGSR     BEGSR
     CSR                   ENDSR
     C*
     C*****************************************************************
