     H****************************************************************
     H*
     H*       UPDATE  DATE  104/09/24  2015AR953  S00WCJ (0409A)
     H*                      產品代碼3碼擴5碼
     H*
     H****************************************************************
     H            Y                                     1                 BR100
     FARINVD  UP  E           K        DISK
     FARINVDW UF  E           K        DISK                      A
     IRARINVD     01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C           K#INVD    KLIST
     C                     KFLD           AWINNO
     C                     KFLD           AWACNT
     C                     KFLD           AWITEM
     C*
     C                     MOVE AVINNO    AWINNO
     C                     MOVE AVACNT    AWACNT
     C                     MOVE AVITEM    AWITEM
     C           K#INVD    CHAINRARINVDW             40
     C                     MOVE AVFLAG    AWFLAG
     C                     MOVE AVINNO    AWINNO
     C                     MOVE AVACNT    AWACNT
     C                     Z-ADDAVITEM    AWITEM
     C                     Z-ADDAVACDT    AWACDT
     C                     MOVE AVORNO    AWORNO
0409AC                     MOVELAVPDCD    AWPDCD
     C                     Z-ADDAVQTY     AWQTY
     C                     Z-ADDAVUPRC    AWUPRC
     C                     Z-ADDAVAMT     AWAMT
     C                     MOVE AVDECD    AWDECD
     C                     Z-ADDAVDEDT    AWDEDT
     C                     MOVE AVAPNO    AWAPNO
     C                     MOVE AVACNO    AWACNO
     C                     MOVE AVFL01    AWFL01
     C                     MOVE AVFL02    AWFL02
     C                     MOVE AVFL03    AWFL03
     C                     MOVE AVTXAR    AWTXAR
     C                     Z-ADDAVTXDT    AWTXDT
     C                     MOVE AVRESV    AWRESV
     C   40                WRITERARINVDW
     C  N40                UPDATRARINVDW
     C*
     C           U#AREA    IFNE 'P'                        廠區
     C                     MOVE *BLANK    AVFLAG
     C                     UPDATRARINVD
     C                     ELSE
     C           AVFLAG    IFEQ 'D'                        台北
     C                     DELETRARINVD
     C                     ELSE
     C                     MOVE *BLANK    AVFLAG
     C                     UPDATRARINVD
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
