     H            Y                                     1                 BR100
     FARCVMS  UP  E           K        DISK
     FCBCUST  IF  E           K        DISK
     FARCUDT  IF  E           K        DISK
     FARCVDT  IF  E           K        DISK
     FARCVDTD O   E                    DISK
     IRARCVMS     01
     I            DS
     I                                        1  61 D#CUM1
     I                                        1  20 D#SLI1
     I                                       21  21 D#MUI1
     I                                       22  51 D#BHID
     I                                       52  61 D#CONT
     I            DS
     I                                        1  90 D#CUM2
     I                                        1  20 D#INNO
     I                                       21  40 D#SLI2
     I                                       41  60 D#BYI1
     I                                       61  63 D#PRCE
     I                                       64  76 D#DAMT
     I                                       77  77 D#DOT
     I                                       78  79 D#ZERO
     I                                       80  83 D#INYR
     I                                       84  84 D#DAS1
     I                                       85  86 D#INMN
     I                                       87  87 D#DAS2
     I                                       88  89 D#INDT
     I                                       90  90 D#TRAN
     I            DS
     I                                        1   8 D#DATE
     I                                        1   4 D#YY
     I                                        5   6 D#MM
     I                                        7   8 D#DD
     I            DS
     I                                        1  30 D#BHIX
     I                                        1   8 D#CUID
     I                                        9  16 D#DATX
     I                                       17  22 D#TIME
     I           UDS
     I                                      301 303 U#BKID
     I                                      310 339 U#BHID
     I                                     10011010 U#USER
     C  N99                EXSR INISR
     C   01                EXSR DTLSR
     CLR 99                EXSR LRSR
     CLR                   RETRN
     CSR         INISR     BEGSR
     C                     MOVE *ON       *IN99
     C                     MOVEL'75280209'D#CUID
     C                     MOVE UDATE     W#DATE  80
     C                     ADD  19110000  W#DATE
     C                     MOVE W#DATE    D#DATX
     C                     TIME           W#TIME  60
     C                     MOVE *ALL'0'   D#TIME
     C                     MOVE W#TIME    D#TIME
     C                     ENDSR
     C*
     CSR         DTLSR     BEGSR
     C           K#CVDT    KLIST
     C                     KFLD           ATRCNO
     C                     KFLD           ATITEM
     C*
     C           ASCUNO    CHAINRARCUDT              41
     C           *IN41     IFEQ *ON
     C           ACBKID    ORNE U#BKID
     C                     GOTO ENDDTL
     C                     ENDIF
     C*
     C                     MOVE ASRCNO    ATRCNO           ≧綪虫腹
     C                     Z-ADD0         ATITEM           兜Ω
     C           K#CVDT    SETLLRARCVDT
     C                     MOVE *OFF      *IN40
     C           *IN40     DOWEQ*OFF
     C                     READ RARCVDT                  40
     C   40                LEAVE
     C*
     C           ATRCNO    IFNE ASRCNO
     C                     LEAVE
     C                     ENDIF
     C*
     C                     EXSR WTRSR                      糶
     C                     ENDDO
     C*
     C                     MOVE 'Y'       ASCDA1           ≧綪更絏
     C                     MOVE UDATE     ASCDA2           更ら戳
     C                     MOVE U#USER    ASCDA3           更
     C                     MOVE D#BHIX    ASBIH1
     C                     UPDATRARCVMS
     C           ENDDTL    ENDSR
     C*
     CSR         WTRSR     BEGSR
     C*
     C                     CLEARRARCVDTD
     C                     MOVE *BLANK    D#CUM2
     C                     MOVELATINNO    D#INNO           祇布腹絏
     C                     MOVEL'75280209'D#SLI2           狥葵参絪
     C           ASCUNO    CHAINCBREC                41
     C                     MOVELCBMUID    D#BYI1           禦絪腹
     C                     MOVE 'TWD'     D#PRCE           刽
     C                     MOVE *ALL'0'   D#DAMT           祇布肂
     C                     MOVE ATAMT3    D#DAMT           祇布肂
     C                     MOVE '.'       D#DOT            计翴
     C                     MOVE *ALL'0'   D#ZERO           计肂
     C*
     C           19110000  ADD  ATINDT    W#DATE           祇布ら戳
     C                     MOVE W#DATE    D#DATE           祇布ら戳
     C                     MOVE D#YY      D#INYR
     C                     MOVE '/'       D#DAS1
     C                     MOVE D#MM      D#INMN
     C                     MOVE '/'       D#DAS2
     C                     MOVE D#DD      D#INDT
     C*
     C                     MOVE '1'       D#TRAN
     C*
     C                     MOVE '1'       ADCUM1           灿
     C                     MOVE D#CUM2    ADCUM2
     C                     WRITERARCVDTD
     C*
     C                     ADD  1         W#CONT  40
     C*
     C                     ENDSR
     C*
     CSR         LRSR      BEGSR
     C           W#CONT    IFNE 0
     C                     CLEARRARCVDTD
     C                     MOVE *BLANK    D#CUM1
     C                     MOVE '0'       ADCUM1
     C                     MOVEL'75280209'D#SLI1           狥葵参絪
     C                     MOVE 'S'       D#MUI1           綪扳坝
     C                     MOVE D#BHIX    D#BHID           у腹
     C                     MOVE *ALL'0'   D#CONT           祇布眎计
     C                     MOVE W#CONT    D#CONT           祇布眎计
     C                     MOVELD#CUM1    ADCUM2
     C                     WRITERARCVDTD
     C                     ENDIF
     C*
     C                     MOVE D#BHIX    U#BHID           у腹
     C*
     C                     ENDSR
