     FINVMSTP IP  E                    DISK
     FINVDTLP O   E           K        DISK                      A
     FINVDTL  IF  E           K        DISK
     F            IVREC                             KRENAMEIVRECD
     IIVRECD
     I              IVFLAG                          FLAG
     I              IVNO                            NO
     I              IVACNT                          ACNT
     I              IVITEM                          ITEM
     I              IVACDT                          ACDT
     I              IVORNO                          ORNO
     I              IVPDCD                          PDCD
     I              IVQTY                           QTY
     I              IVUPRC                          UPRC
     I              IVAMT                           AMT
     I              IVDECD                          DECD
     I              IVDEDT                          DEDT
     I              IVAPNO                          APNO
     I              IVACNO                          ACNO
     I              IVFL01                          FL01
     I              IVFL02                          FL02
     I              IVFL03                          FL03
     I              IVTXAR                          TXAR
     I              IVTXDT                          TXDT
     I              IVRESV                          RESV
     C           KEY       KLIST
     C                     KFLD           INNO
     C                     KFLD           ACNT
     C                     KFLD           ITEM
     C***  CHECK OERDER
     C           INNO      SETLLINVDTL               97
     C           *IN97     DOWEQ'0'
     C  N97      INNO      READEINVDTL                   97
     C   97                LEAVE
     C                     MOVE *BLANK    IVFLAG
     C                     MOVE NO        IVNO
     C                     MOVE ACNT      IVACNT
     C                     Z-ADDITEM      IVITEM
     C                     MOVE NO        IVNO
     C                     Z-ADDACDT      IVACDT
9008 C                     MOVELORNO      IVORNO
     C                     MOVE PDCD      IVPDCD
     C                     Z-ADDQTY       IVQTY
     C                     Z-ADDUPRC      IVUPRC
     C                     Z-ADDAMT       IVAMT
     C                     MOVE DECD      IVDECD
     C                     Z-ADDDEDT      IVDEDT
     C                     MOVE APNO      IVAPNO
     C                     MOVE ACNO      IVACNO
     C                     MOVE FL01      IVFL01
     C                     MOVE FL02      IVFL02
     C                     MOVE FL03      IVFL03
     C                     MOVE TXAR      IVTXAR
     C                     Z-ADDTXDT      IVTXDT
     C                     MOVE RESV      IVRESV
     C                     WRITEIVREC
     C                     ENDDO
