     H        1   Y                                     1                 BR003
     FCPRBAL  IP  E                    DISK
     FAFCBAL  O   E           K        DISK
     I           UDS
     I                                        1   1 AREA
     C*----------------------------------------------------
     C                     CLEARAFREC
     C                     MOVEL'A'       AFFLAG
     C                     MOVELCPCUNO    AFCUNO
     C                     MOVELCPCUNM    AFCUNM
     C                     MOVELCPORNO    AFORNO
     C*TEST
     C           AFORNO    IFEQ 'K3021'
     C                     Z-ADD0         W#TEST  10
     C                     ENDIF
CLJ  C                     Z-ADDCPNBAL    AFNBAL
     C                     WRITEAFREC
     C****
