     H*****************************************************************
     H*
     H*         >>   PROGRAM INTRODUCTOR  <<
     H*
     H*       1.PROGRAM-ID   ARP099RA
     H*       2.PROGRAM-TYPE RPG/400
     H*       3.AUTHOR       S02CSF
     H*       4.FUNCTION    磅單與運費調整對照檔─傳輸（台北及廠區）
     H*       5.DATE-WRITTEN 91/12/16
     H*       6.DATE-MODIFY
     H*
     H*****************************************************************
     H            Y                                     1                 BR100
     FARDLWT  UP  E           K        DISK
     FARDLWTW UF  E           K        DISK                      A
     IRARDLWT     01
     I           UDS
     I                                      301 301 U#AREA
     C*FILE==>ARDLWTW
     C           W#DLWT    KLIST
     C                     KFLD           AXORNO
     C                     KFLD           AXWTNO
     C*
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C                     MOVELAWORNO    AXORNO           訂單號碼
     C                     MOVELAWWTNO    AXWTNO           磅單號碼
     C           W#DLWT    CHAINRARDLWTW             40
     C                     MOVELAWFLAG    AXFLAG           處理代碼
     C                     MOVELAWCUNO    AXCUNO           客戶代碼
     C                     MOVELAWCUNM    AXCUNM           客戶簡稱
     C                     MOVELAWORNO    AXORNO           訂單號碼
     C                     MOVELAWDLVY    AXDLVY           交單號碼
     C                     MOVELAWWTNO    AXWTNO           磅單號碼
     C                     Z-ADDAWWTDT    AXWTDT           出貨日期
     C                     MOVELAWTXNO    AXTXNO           調整單號
     C                     Z-ADDAWTXDT    AXTXDT           調整單開立日
     C                     MOVELAWIVNO    AXIVNO           發票號碼
     C                     MOVELAWCOD1    AXCOD1           調整開立碼
     C                     MOVELAWCOD2    AXCOD2           調整確認碼
     C                     MOVELAWCOD3    AXCOD3           作廢碼
     C                     MOVELAWRESV    AXRESV           備註
     C                     MOVELAWRES1    AXRES1           預留1
     C                     MOVELAWRES2    AXRES2           預留2
     C                     Z-ADDAWUPDD    AXUPDD           異動日期
     C                     Z-ADDAWUPDT    AXUPDT           異動時間
     C                     MOVELAWUPDM    AXUPDM           異動人員
     C   40                WRITERARDLWTW
     C  N40                UPDATRARDLWTW
     C*
     C                     MOVE *BLANK    AWFLAG
     C                     UPDATRARDLWT
     C*
     C                     ENDSR
