     H****************************************************************
     H*
     H*            UPDATE  DATE  98/10/18 2009AR357 S00WJC (9810A)
     H*
     H****************************************************************
     FRCVDTL  UP  E                    DISK
     F            RVREC                             KRENAMERVRECD
     FRCVDTLP UF  E           K        DISK                      A
     IRVRECD      01
     I              RVFLAG                          FLAG
     I              RVNO                            NO
     I              RVITEM                          ITEM
     I              RVDATE                          DATE
     I              RVCUNO                          CUNO
     I              RVCUNM                          CUNM
     I              RVTYPE                          TYPE
     I              RVDPNO                          DPNO
     I              RVVNO1                          VNO1
     I              RVDECD                          DECD
     I              RVDEDT                          DEDT
     I              RVUSTP                          USTP
     I              RVNTTP                          NTTP
     I              RVPBID                          PBID
     I              RVPANO                          PANO
     I              RVACTP                          ACTP
     I              RVACNO                          ACNO
     I              RVRLNO                          RLNO
     I              RVPLAC                          PLAC
     I              RVNTNO                          NTNO
     I              RVDUDT                          DUDT
     I              RVRAMT                          RAMT
     I              RVSBID                          SBID
     I              RVSANO                          SANO
     I              RVAMCD                          AMCD
     I              RVWRNO                          WRNO
     I              RVNTCD                          NTCD
     I              RVNTDT                          NTDT
     I              RVPRCD                          PRCD
     I              RVPRDT                          PRDT
     I              RVTBID                          TBID
     I              RVTANO                          TANO
     I              RVVNO2                          VNO2
     I              RVTXAR                          TXAR
     I              RVTXDT                          TXDT
     I              RVAREA                          AREA
     I              RVRVID                          RVID
     I              RVRESV                          RESV
8905 I              RVOLRV                          OLRV
 .   I              RVOLDT                          OLDT
 .   I              RVRES2                          RES2
9810AI              RVCURR                          CURR
9810AI              RVCAMT                          CAMT
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           ITEM
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRVREC                31
     C                     MOVE FLAG      RVFLAG
     C                     MOVE NO        RVNO
     C                     Z-ADDITEM      RVITEM
     C                     Z-ADDDATE      RVDATE
     C                     MOVE CUNO      RVCUNO
     C                     MOVE CUNM      RVCUNM
     C                     MOVE TYPE      RVTYPE
     C                     MOVE DPNO      RVDPNO
     C                     MOVE VNO1      RVVNO1
     C                     MOVE DECD      RVDECD
     C                     Z-ADDDEDT      RVDEDT
     C                     MOVE USTP      RVUSTP
     C                     MOVE NTTP      RVNTTP
     C                     MOVE PBID      RVPBID
     C                     MOVE PANO      RVPANO
     C                     MOVE ACTP      RVACTP
     C                     MOVE ACNO      RVACNO
     C                     MOVE RLNO      RVRLNO
     C                     MOVE PLAC      RVPLAC
     C                     MOVE NTNO      RVNTNO
     C                     Z-ADDDUDT      RVDUDT
     C                     Z-ADDRAMT      RVRAMT
     C                     MOVE SBID      RVSBID
     C                     MOVE SANO      RVSANO
     C                     MOVE AMCD      RVAMCD
     C                     MOVE WRNO      RVWRNO
     C                     MOVE NTCD      RVNTCD
     C                     Z-ADDNTDT      RVNTDT
     C                     MOVE PRCD      RVPRCD
     C                     Z-ADDPRDT      RVPRDT
     C                     MOVE TBID      RVTBID
     C                     MOVE TANO      RVTANO
     C                     MOVE VNO2      RVVNO2
     C                     MOVE TXAR      RVTXAR
     C                     Z-ADDTXDT      RVTXDT
     C                     MOVE AREA      RVAREA
     C                     MOVE RVID      RVRVID
     C                     MOVE RESV      RVRESV
8905 C                     MOVE OLRV      RVOLRV
 .   C                     Z-ADDOLDT      RVOLDT
 .   C                     MOVE RES2      RVRES2
9810AC                     MOVELCURR      RVCURR
9810AC                     Z-ADDCAMT      RVCAMT
     C   31                WRITERVREC
     C  N31                UPDATRVREC
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     ORVRECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
