     H            Y                                     1                 BR100
     FARSTAT  UP  E                    DISK
     F            ARREC                             KRENAMEARRECD
     FARSTATP UF  E           K        DISK                      A
     FQPRINT  O   F     198     OV     PRINTER
     IARRECD      01
     I              ARFLAG                          FLAG
     I              ARCUNO                          CUNO
     I              ARCUNM                          CUNM
     I              ARORNO                          ORNO
     I              ARAAMT                          AAMT
     I              ARATAX                          ATAX
     I              ARAQTY                          AQTY
     I              ARBAMT                          BAMT
     I              ARCAMT                          CAMT
     I              ARCTAX                          CTAX
     I              ARDAMT                          DAMT
     I              ARDTAX                          DTAX
     I              AREAMT                          EAMT
     I              ARETAX                          ETAX
     I              ARFAMT                          FAMT
     I              ARFTAX                          FTAX
     I              ARGAMT                          GAMT
     I              ARGTAX                          GTAX
     I              ARHAMT                          HAMT
     I              ARHTAX                          HTAX
     I              ARIAMT                          IAMT
     I              ARJAMT                          JAMT
     I              ARKAMT                          KAMT
     I              ARLAMT                          LAMT
     I              ARNBAL                          NBAL
     I              ARPBAL                          PBAL
     I              ARMAMT                          MAMT
     I              AROAMT                          OAMT
     I              ARFL01                          FL01
     I              ARFL02                          FL02
     I              ARRESV                          RESV
     I           UDS
     I                                       21  21 FAC
     C           KEY       KLIST
     C                     KFLD           ORNO
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINARREC                31
     C                     MOVE FLAG      ARFLAG
     C                     MOVE CUNO      ARCUNO
     C                     MOVE CUNM      ARCUNM
9008 C                     MOVELORNO      ARORNO
     C                     Z-ADDAAMT      ARAAMT
     C                     Z-ADDATAX      ARATAX
     C                     Z-ADDAQTY      ARAQTY
     C                     Z-ADDBAMT      ARBAMT
     C                     Z-ADDCAMT      ARCAMT
     C                     Z-ADDCTAX      ARCTAX
     C                     Z-ADDDAMT      ARDAMT
     C                     Z-ADDDTAX      ARDTAX
     C                     Z-ADDEAMT      AREAMT
     C                     Z-ADDETAX      ARETAX
     C                     Z-ADDFAMT      ARFAMT
     C                     Z-ADDFTAX      ARFTAX
     C                     Z-ADDGAMT      ARGAMT
     C                     Z-ADDGTAX      ARGTAX
     C                     Z-ADDHAMT      ARHAMT
     C                     Z-ADDHTAX      ARHTAX
     C                     Z-ADDIAMT      ARIAMT
     C                     Z-ADDJAMT      ARJAMT
     C                     Z-ADDKAMT      ARKAMT
     C                     Z-ADDLAMT      ARLAMT
     C                     Z-ADDNBAL      ARNBAL
     C                     Z-ADDPBAL      ARPBAL
     C                     Z-ADDMAMT      ARMAMT
     C                     Z-ADDOAMT      AROAMT
     C                     MOVE FL01      ARFL01
     C                     MOVE FL02      ARFL02
     C                     MOVE RESV      ARRESV
     C   31                WRITEARREC
     C  N31                UPDATARREC
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     OARRECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
     C*--------------------------------------------------------------
     OQPRINT  H  103   1P
     O       OR        OV
     O                                   15 'RPT.ID: AR026'
     O                                  110 '東和鋼鐵股份有限公司'           X
     O                                  180 '印表日期'
     O                                  181 ':'
     O                         UDATE Y  194
     O        H  1     1P
     O       OR        OV
     O                                    9 'FROM :'
     O                         FAC     +  1
     O                                  111 '帳款統計檔傳輸核對清單'
     O                                  180 '頁　　數'
     O                                  181 ':'
     O                         PAGE     194
     O        H 11     1P
     O       OR        OV
     O                                    9 '處理碼'
     O                                 +  3 '客戶編號'
     O                                 +  2 '客戶名稱'
     O                                 +  1 '訂單號碼'
     O                                 +  1 '出貨數量'
     O                                 +  1 '出貨金額'
     O                                 +  1 '出貨稅額'
     O                                 +  5 '扣預收款'
     O                                 +  3 '調整金額'
     O                                 +  3 '調整稅額'
     O                                 +  3 '退貨金額'
     O                                 +  3 '退貨稅額'
     O                                 +  3 '退預收款'
     O                                 +  3 '退預收稅額'
     O                                 +  1 '折讓金額'
     O                                 +  1 '折讓稅額'
     O        H  1     1P
     O       OR        OV
     O                                   28 '扣預收金額沖回'
     O                                 +  1 '扣預收稅額沖回'
     O                                 +  1 '預收金額'
     O                                 +  1 '預收稅額'
     O                                 +  1 '繳款－貨款'
     O                                 +  1 '繳款－預收'
     O                                 +  1 '退票－貨款'
     O                                 +  1 '退票－預收'
     O                                 +  1 '預收轉入款'
     O                                 +  1 '餘額－貨款'
     O                                 +  1 '餘額－預收'
     O                                 +  1 '運費金額'
     O                                 +  1 '貨款結案碼'
     O                                 +  1 '預收結案碼'
     O        H  1     1P
     O       OR        OV
     O                                   21 '===================='
     O                                   41 '===================='
     O                                   61 '===================='
     O                                   81 '===================='
     O                                  101 '===================='
     O                                  121 '===================='
     O                                  141 '===================='
     O                                  161 '===================='
     O                                  181 '===================='
     O                                  195 '=============='
     O        D  1     01
     O                         ARFLAG     5
     O                         ARCUNO  +  8
     O                         ARCUNM    33
     O                         ARORNO    44
     O                         ARAQTY3   55
     O                         ARAAMT3   66
     O                         ARATAX3   77
     O                         ARBAMT3   92
     O                         ARCAMT3  105
     O                         ARCTAX3  118
     O                         ARDAMT3  131
     O                         ARDTAX3  144
     O                         AREAMT3  157
     O                         ARETAX3  172
     O                         ARFAMT3  183
     O                         ARFTAX3  194
     O        D  1     01
     O                         ARGAMT3   27
     O                         ARGTAX3 +  6
     O                         ARHAMT3   55
     O                         ARHTAX3   66
     O                         ARIAMT3   77
     O                         ARJAMT3   92
     O                         ARKAMT3  105
     O                         ARLAMT3  118
     O                         ARMAMT3  131
     O                         ARNBAL3  144
     O                         ARPBAL3  157
     O                         AROAMT3  172
     O                         ARFL01   180
     O                         ARFL02   190
     O        D  1     01
