     H            Y                                     1                 BR100
     FARCVDTW IP  E           K        DISK
     FARCVDT  UF  E           K        DISK                      A
     IRARCVDTW    01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C*
     C           K#CVDT    KLIST
     C                     KFLD           ATINNO
     C                     KFLD           ATITEM
     C*
     C                     MOVE AWINNO    ATINNO
     C                     MOVE AWITEM    ATITEM
     C           K#CVDT    CHAINRARCVDT              40
     C           U#AREA    IFNE 'P'                        廠區送台北
     C                     MOVE AWFLAG    ATFLAG
     C                     ELSE
     C                     MOVE *BLANK    ATFLAG
     C                     ENDIF
     C*
     C                     MOVE AWDELD    ATDELD
     C                     MOVE AWINNO    ATINNO
     C                     Z-ADDAWITEM    ATITEM
     C                     Z-ADDAWCVDT    ATCVDT
     C                     Z-ADDAWCAMT    ATCAMT
     C                     MOVE AWRLN1    ATRLN1
     C                     MOVE AWRLN2    ATRLN2
     C                     MOVE AWUPDM    ATUPDM
     C                     Z-ADDAWUPDD    ATUPDD
     C                     Z-ADDAWUPDT    ATUPDT
     C                     MOVE AWDLC1    ATDLC1
     C                     MOVE AWDLM1    ATDLM1
     C                     Z-ADDAWDLD1    ATDLD1
     C                     MOVE AWBHID    ATBHID
     C*
     C   40                WRITERARCVDT
     C  N40                UPDATRARCVDT
     C*
     C                     ENDSR
