     H        1   Y                                     1                 BR003
     FCURCPR  UF  E           K        DISK
     I*************************************************************
     IAADS        DS
     I                                       11  160YMD
     I                                       11  140YM
     I                                       15  160DD
     I****
     I           UDS
     I                                        1   1 START
     I                                        2   2 END
     I                                        4   4 AREA
     I                                        5  100YDATE
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           CUKEY     KLIST
     C                     KFLD           CUDATE
     C***
     C                     Z-ADDYDATE     CUDATE
     C           CUKEY     SETLLCURCPR               97
     C           *IN97     DOWEQ'0'
     C           CUKEY     READECURCPR                   97
     C   97                LEAVE
     C                     DELETCUREC
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
