     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP090R4A
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            4.FUNCTION     過入彙總檔(ACACHS)
     H*            5.DATE-WRITTEN  91/03/26
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARP090X IP  E           K        DISK
     FACACHS  O   E           K        DISK
     IRARP090X    01
     I                                              A1DAT2L1
     I           UDS
     I                                     10011010 U#USID
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C   L1                EXSR L1CLR
     C   01                EXSR DTLSR
     CL1                   EXSR L1SR
     CLR                   RETRN
     C*****************************************************************
     C           L1CLR     BEGSR
     C*****************************************************************
     C                     CLEARRACACHS
     C*
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     ADD  A1AMT     ASAMT
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1SR      BEGSR
     C*****************************************************************
     C                     Z-ADDA1DAT2    ASDATE           兌現日期
     C           A1CODE    IFEQ 'SA04'
     C                     MOVE 'TN'      ASFSYS           作業來源
     C                     ELSE
     C                     MOVE 'IN'      ASFSYS
     C                     ENDIF
     C*
     C           A1PROD    IFNE '2'                        型鋼
     C                     MOVE 'H'       ASFSYS
     C                     ENDIF
     C*
     C                     MOVE '1'       ASCODE           類別
     C                     MOVE '1134'    ASACNO           會計科目
     C                     MOVE U#USID    ASENDM           建檔人員
     C                     MOVE UDATE     ASENDD           建檔日期
     C                     TIME           ASENDT           建檔時間
     C*
     C                     WRITERACACHS
     C*
     C           L1END     ENDSR
