     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP072R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     祇布籔綪砯肂畉钵秨
     H*            5.DATE-WRITTEN  92/08/19
     H*            6.UPDATE  DATE  99/02/02 2010AR431 S00WCJ (9902A)
     H*                            99/03/02 2010AR444 S00WCJ (9903A)
     H*                           101/03/03 S00WCJ (0103A)
     H*                            蔼动砯э秨参絪祇布阁
     H*                            紀USER秨祇布盢い絊虫
     H*                            籔蔼动絊虫秨眎祇布硑Θ秨
     H*                            肂Τ粇
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FINVMST  IP  E           K        DISK
     FTRNDTLL2IF  E           K        DISK
     FARP072F O   E                    DISK
     I*****************************************************************
     I           UDS
     I                                        1   60U#YYMM
     I                                        5   60U#MM
     I                                        7   7 U#AREA
     I            DS
     I                                        1   8 D#TXNO
     I                                        1   1 D#TXN1
     I                                        2   8 D#TXN2
     I            DS
     I                                        1  10 D#IVNO
     I                                        1   2 D#IVN1
     I                                        3  10 D#IVN2
     C*****************************************************************
     C                     MOVELINNO      D#IVNO
     C           D#IVN1    IFEQ 'UX'
     C           D#IVN2    ANDEQ'28138534'
     C                     Z-ADD0         W#TMP   10
     C                     ENDIF
     C*
     C           INNO      SETLLTXREC
     C                     MOVE *OFF      *IN40
     C           *IN40     DOWEQ*OFF
     C                     READ TXREC                    40
     C   40                LEAVE
     C*
     C           TXIVNO    IFNE INNO
     C                     LEAVE
     C                     ENDIF
     C*
     C                     MOVELTXNO      D#TXNO
     C           D#TXN1    IFEQ U#AREA
9902AC           TXNO      OREQ 'K1184847'
9902AC           TXNO      OREQ 'K1184848'
9902AC           TXNO      OREQ 'K1184878'
9902AC           TXNO      OREQ 'K1184879'
9902AC           TXNO      OREQ 'K1184884'
9902AC           TXNO      OREQ 'K1184885'
9902AC           TXNO      OREQ 'K1184912'
9902AC           TXNO      OREQ 'K1184913'
9902AC           TXNO      OREQ 'K1184914'
9902AC           TXNO      OREQ 'K1184921'
9902AC           TXNO      OREQ 'K1184922'
9902AC           TXNO      OREQ 'K1185132'
9902AC           TXNO      OREQ 'K1185133'
9902AC           TXNO      OREQ 'K1185134'
9902AC           TXNO      OREQ 'K1185148'
9902AC           TXNO      OREQ 'K1185149'
9902AC           TXNO      OREQ 'K1185156'
9902AC           TXNO      OREQ 'K1185157'
9902AC           TXNO      OREQ 'K1185158'
9903AC           TXNO      OREQ 'K1185926'
9903AC           TXNO      OREQ 'K1185927'
9903AC           TXNO      OREQ 'K1186064'
9903AC           TXNO      OREQ 'K1186065'
9903AC           TXNO      OREQ 'K1186080'
9903AC           TXNO      OREQ 'K1186081'
0103AC           TXNO      OREQ 'K1131941'
0103AC           TXNO      OREQ 'K1132314'
0103AC           TXNO      OREQ 'K1132350'
0103AC           TXNO      OREQ 'K1131413'
     C                     MOVELTXCODE    A1CODE
     C                     MOVELTXNO      A1TXNO
     C                     Z-ADDTXITEM    A1ITEM
     C                     MOVELTXACNT    A1ACNT
     C                     Z-ADDTXDATE    A1DATE
     C                     Z-ADDTXACDT    A1ACDT
     C                     MOVELTXCUNO    A1CUNO
     C                     MOVELTXCUNM    A1CUNM
     C                     MOVELTXORNO    A1ORNO
     C                     MOVELTXIVNO    A1IVNO
     C                     MOVELTXRVID    A1RVID
     C                     MOVELTXSALE    A1SALE
     C                     MOVELTXPDNM    A1PDNM
     C                     Z-ADDTXQTY     A1QTY
     C                     Z-ADDTXUPRC    A1UPRC
     C                     Z-ADDTXAMT     A1AMT
     C                     Z-ADDTXTAX     A1TAX
     C                     WRITERARP072F
     C                     ENDIF
     C*
     C                     ENDDO
