     H        1   Y                                     1                 BR003
     FINVDTL  IP  E                    DISK
     FINVMST  IF  E           K        DISK
     FAFCBAL  UF  E           K        DISK
     IIVREC
     I                                              IVRESVL4
     I                                              IVNO  L2
     I           UDS
     I                                        1   1 AREA
     C*----------------------------------------------------
     C           INKEY     KLIST
     C                     KFLD           INNO
     C   L4                EXSR D#L4
     C   L2                EXSR D#L2
     C*
     C     N97             EXSR D#PR
     C*
     CL4   N97             EXSR T#L4
     C****
     CSR         D#L4      BEGSR
     C                     Z-ADD0         EAMT   110
     C                     Z-ADD0         HAMT   110
     CSR         D#L4Z     ENDSR
     C****
     CSR         D#L2      BEGSR
     C           IVNO      CHAININVMST               97
     CSR         D#L2Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C           INDECD    IFNE ' '
     C           INTYPE    OREQ '9'
     C                     GOTO D#PRZ
     C                     ENDIF
     C                     SELEC
     C           IVACNT    WHEQ '4'
     C                     EXSR C4#RTN
     C                     ENDSL
     C***
     CSR         D#PRZ     ENDSR
     C****
     CSR         C4#RTN    BEGSR
     C                     SELEC
     C           IVFL03    WHEQ 'E'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'H'
     C                     ADD  IVAMT     HAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     CSR         T#L4      BEGSR
     C           IVRESV    CHAINAFCBAL               96
     C  N96                EXSR UP#AR
     C****
     CSR                   ENDSR
     C****
     CSR         UP#AR     BEGSR
     C                     MOVEL'C'       AFFLAG
     C                     Z-SUBEAMT      EAMT
     C                     ADD  EAMT      AFEAMT
     C                     ADD  HAMT      AFHAMT
     C                     SUB  EAMT      AFNBAL
     C                     ADD  HAMT      AFNBAL
     C                     MOVE UDATE     AFCHDT
     C                     UPDATAFREC
     CSR         UP#ARZ    ENDSR
