     H            Y                                     1                 BR100
     FBALFT   IP  E                    DISK
     FCPRBAL  UF  E           K        DISK                      A
     C           BORNO     CHAINCPRBAL               31
     C           *IN31     IFEQ '1'
     C                     MOVE BFLAG     CPFLAG
     C                     MOVE BCUNO     CPCUNO
     C                     MOVE BCUNM     CPCUNM
     C                     MOVE BORNO     CPORNO
     C                     Z-ADDBPBAL     CPPBAL
     C                     Z-ADDBAAMT     CPAAMT
     C                     Z-ADDBBAMT     CPBAMT
     C                     Z-ADDBNBAL     CPNBAL
     C                     Z-ADDBAMT1     CPAMT1
     C                     Z-ADDBAMT2     CPAMT2
     C                     Z-ADDBAMT3     CPAMT3
     C                     MOVE BRESV     CPRESV
     C                     WRITECPREC
     C                     END
