     H            Y                                     1                 BR100
     FRCVDTLT IP  E                    DISK
     F            RVREC                             KRENAMERVRECD
     FRCVDTL  UF  E           K        DISK                      A
     FQPRINT  O   F     198     OV     PRINTER
     IRVRECD      01
     I              RVFLAG                          FLAG
     I              RVNO                            NO
     I              RVITEM                          ITEM
     I              RVDATE                          DATE
     I              RVCUNO                          CUNO
     I              RVCUNM                          CUNM
     I              RVTYPE                          TYPE
     I              RVDPNO                          DPNO
     I              RVVNO1                          VNO1
     I              RVDECD                          DECD
     I              RVDEDT                          DEDT
     I              RVUSTP                          USTP
     I              RVNTTP                          NTTP
     I              RVPBID                          PBID
     I              RVPANO                          PANO
     I              RVACTP                          ACTP
     I              RVACNO                          ACNO
     I              RVRLNO                          RLNO
     I              RVPLAC                          PLAC
     I              RVNTNO                          NTNO
     I              RVDUDT                          DUDT
     I              RVRAMT                          RAMT
     I              RVSBID                          SBID
     I              RVSANO                          SANO
     I              RVAMCD                          AMCD
     I              RVWRNO                          WRNO
     I              RVNTCD                          NTCD
     I              RVNTDT                          NTDT
     I              RVPRCD                          PRCD
     I              RVPRDT                          PRDT
     I              RVTBID                          TBID
     I              RVTANO                          TANO
     I              RVVNO2                          VNO2
     I              RVTXAR                          TXAR
     I              RVTXDT                          TXDT
     I              RVAREA                          AREA
     I              RVRVID                          RVID
     I              RVRESV                          RESV
8905 I              RVOLRV                          OLRV
 .   I              RVOLDT                          OLDT
 .   I              RVRES2                          RES2
     I           UDS
     I                                       21  21 FAC
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           ITEM
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRVREC                31
     C                     MOVE *BLANK    RVFLAG
     C                     MOVE NO        RVNO
     C                     Z-ADDITEM      RVITEM
     C                     Z-ADDDATE      RVDATE
     C                     MOVE CUNO      RVCUNO
     C                     MOVE CUNM      RVCUNM
     C                     MOVE TYPE      RVTYPE
     C                     MOVE DPNO      RVDPNO
     C                     MOVE VNO1      RVVNO1
     C                     MOVE DECD      RVDECD
     C                     Z-ADDDEDT      RVDEDT
     C                     MOVE USTP      RVUSTP
     C                     MOVE NTTP      RVNTTP
     C                     MOVE PBID      RVPBID
     C                     MOVE PANO      RVPANO
     C                     MOVE ACTP      RVACTP
     C                     MOVE ACNO      RVACNO
     C                     MOVE RLNO      RVRLNO
     C                     MOVE PLAC      RVPLAC
     C                     MOVE NTNO      RVNTNO
     C                     Z-ADDDUDT      RVDUDT
     C                     Z-ADDRAMT      RVRAMT
     C                     MOVE SBID      RVSBID
     C                     MOVE SANO      RVSANO
     C                     MOVE AMCD      RVAMCD
     C                     MOVE WRNO      RVWRNO
     C                     MOVE NTCD      RVNTCD
     C                     Z-ADDNTDT      RVNTDT
     C                     MOVE PRCD      RVPRCD
     C                     Z-ADDPRDT      RVPRDT
     C                     MOVE TBID      RVTBID
     C                     MOVE TANO      RVTANO
     C                     MOVE VNO2      RVVNO2
     C                     MOVE TXAR      RVTXAR
     C                     Z-ADDTXDT      RVTXDT
     C                     MOVE AREA      RVAREA
     C                     MOVE RVID      RVRVID
     C                     MOVE RESV      RVRESV
8905 C                     MOVE OLRV      RVOLRV
 .   C                     Z-ADDOLDT      RVOLDT
 .   C                     MOVE RES2      RVRES2
     C   11 31
     COR 12 31             WRITERVREC
     C   11N31
     COR 12N31             UPDATRVREC
     C   13N31             EXCPTDEL#A
     ORVREC   EDEL             DEL#A
     C*--------------------------------------------------------------
     OQPRINT  H  103   1P
     O       OR        OV
     O                                   15 'RPT.ID: AR024'
     O                                  110 '東和鋼鐵股份有限公司'           X
     O                                  180 '印表日期'
     O                                  181 ':'
     O                         UDATE Y  194
     O        H  1     1P
     O       OR        OV
     O                                    9 'FROM :'
     O                         FAC     +  1
     O                                  111 '繳款明細檔傳輸核對清單'
     O                                  180 '頁　　數'
     O                                  181 ':'
     O                         PAGE     194
     O        H 11     1P
     O       OR        OV
     O                                   11 '處理代號'
     O                                   22 '繳款編號'
     O                                   29 '項次'
     O                                   40 '繳款日期'
     O                                   52 '客戶編號'
     O                                   64 '客戶名稱'
     O                                   74 '繳款別'
     O                                   86 '繳款部門'
     O                                   98 '收入傳票'
     O                                  108 '刪除碼'
     O                                  120 '刪除日期'
     O                                  130 '款項別'
     O                                  140 '票據別'
     O                                  152 '付款銀行'
     O                                  164 '付款帳號'
     O                                  174 '借貸別'
     O                                  185 '會計科目'
     O                                  196 '相關號碼'
     O        H  1     1P
     O       OR        OV
     O                                    9 '付款地'
     O                                   18 '票據碼'
     O                                   29 '到期日期'
     O                                   40 '收款金額'
     O                                   51 '存入銀行'
     O                                   62 '存入帳號'
     O                                   73 '資金代號'
     O                                   82 '退回單'
     O                                   91 '異動別'
     O                                  102 '異動日期'
     O                                  111 '托收碼'
     O                                  123 '托收日期'
     O                                  134 '托收銀行'
     O                                  145 '托收帳號'
     O                                  156 '票據號碼'
     O                                  167 '異動廠'
     O                                  178 '異動日期'
     O                                  187 '出納別'
     O                                  196 '收款員'
     O        H  1     1P
     O       OR        OV
     O                                   21 '===================='
     O                                   41 '===================='
     O                                   61 '===================='
     O                                   81 '===================='
     O                                  101 '===================='
     O                                  121 '===================='
     O                                  141 '===================='
     O                                  161 '===================='
     O                                  181 '===================='
     O                                  197 '================'
     O        D  1     01
     O                         RVFLAG     4
     O                         RVNO      21
     O                         RVITEM    28
     O                         RVDATEY   39
     O                         RVCUNO    51
     O                         RVCUNM    63
     O                         RVTYPE    73
     O                         RVDPNO    85
     O                         RVVNO1    97
     O                         RVDECD   107
     O                         RVDEDTY  119
     O                         RVUSTP   129
     O                         RVNTTP   139
     O                         RVPBID   154
     O                         RVPANO   165
     O                         RVACTP   173
     O                         RVACNO   184
     O                         RVRLNO   195
     O        D  1     01
     O                         RVPLAC     6
     O                         RVNTNO    20
     O                         RVDUDTY   28
     O                         RVRAMT3   39
     O                         RVSBID    50
     O                         RVSANO    61
     O                         RVAMCD    72
     O                         RVWRNO    81
     O                         RVNTCD    90
     O                         RVNTDTY  101
     O                         RVPRCD   110
     O                         RVPRDTY  122
     O                         RVTBID   133
     O                         RVTANO   144
     O                         RVVNO2   155
     O                         RVTXAR   166
     O                         RVTXDTY  177
     O                         RVAREA   186
     O                         RVRVID   195
     O        D  1     01
