     H        1   Y                                     1                 BR003
     FARP002S CF  E                    WORKSTN
     FGENSEQ  UF  E           K        DISK                      A
     E*************************************************************
     E                    ERR     1   3 70
     I*************************************************************
     IBBDS        DS
     I                                        1  10 GRP
     I                                        1   1 GE1
     I                                        2  10 GE2
     I                                       11  16 NOG
     I                                       11  11 NOA
     I                                       12  160NOB
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
9008 C                     PARM DATE      EDATE   80
     C                     PARM AREA      AREAC   1
     C           GEKEY     KLIST
     C                     KFLD           GEKIND
     C                     KFLD           GEPRIN
     C**************************************************************
     C                     MOVELTXAR      AREA
     C                     SETON                     70
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C****
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C                     MOVE '0'       FLAG    1
     C*                    CALL 'C01'
     C*                    PARM           DATE
     C*                    PARM           FLAG    1
     C*                    FREE 'C01'
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE DATE      P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM           FLAG    1
     C*
     C           FLAG      IFNE '0'
     C                     SETON                     4299
     C                     MOVE ERR,1     ERRMSG
     C                     ELSE
     C           DATE      IFGT UDATE
     C                     SETON                     4299
     C                     MOVE ERR,2     ERRMSG
     C                     ENDIF
     C                     ENDIF
     C******
     C   99                GOTO CK#01Z
     C******
     C                     CLEARGEREC
     C                     MOVEL'99'      GEKIND
     C                     MOVE *BLANK    GEPRIN
     C                     MOVE *BLANK    GRP
     C                     MOVELTXAR      GE1
     C                     MOVELGRP       GEPRIN
     C           GEKEY     CHAINGENSEQ               97
     C   97                Z-ADDDATE      GECUNO
     C   97                WRITEGEREC
     C  N97                Z-ADDGECUNO    DATE1   60
     C  N97      DATE      IFLT DATE1
     C                     SETON                     9941
     C                     MOVELERR,3     ERRMSG
     C                     ELSE
     C                     Z-ADDDATE      GECUNO
     C                     UPDATGEREC
     C                     ENDIF
     CSR         CK#01Z    ENDSR
     C******
** ERR
日期錯誤．
日期不可大於系統日期
日期不可小於已開立發票日期
