     H        1   Y                                     1                 BR003
     FINVMSTP UP  E                    DISK
     I            DS
     I                                        1   5 INORNO
     I                                        1   1 ORNO
     C*----------------------------------------------------
     C*          ORNO      IFEQ 'H'
     C                     DELETINREC
     C*                    ENDIF
