     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP069R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     銷貨帳款每日應收統計結論傳輸
     H*            5.DATE-WRITTEN  88/07/29
     H*
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARSTRM  UF  E           K        DISK
     FARSTTX  IF  E           K        DISK
     F*****************************************************************
     I           UDS
     I                                     10011010 U#USID
     I                                     10011003 U#DPID
     C*****************************************************************
     C*        搜尋關鍵
     C*****************************************************************
     C           K#AX      KLIST
     C                     KFLD           AXTXCD
     C                     KFLD           AXTXNO
     C                     KFLD           AXINNO
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C           *LOVAL    SETLLAMREC                69
     C                     READ AMREC                    69
     C           *IN69     DOWEQ'0'
     C           K#AX      CHAINAXREC                69
     C           *IN69     IFEQ '1'
     C                     DELETAMREC
     C                     ENDIF
     C                     READ AMREC                    69
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*****************************************************************
