     H        1   Y                                     1                 BR003
     FINVMST  IP  E                    DISK
     FINVDTL  IF  E           K        DISK
     FRCVDTL  IF  E           K        DISK
     FAFCBAL  UF  E           K        DISK
     IINREC
     I                                              INORNOL4
     I                                              INNO  L2
     I            DS
     I                                        1  20 CHDT
     I                                        1   60TPDT
     I                                        7  120TYDT
     I                                       13  180KSDT
     I           UDS
     I                                        1   1 AREA
     C*----------------------------------------------------
     C           AFKEY     KLIST
     C                     KFLD           AFORNO
     C           IVKEY     KLIST
     C                     KFLD           IVNO
     C           RVKEY     KLIST
     C                     KFLD           RVNO
     C                     KFLD           RVITEM
     C   L4                EXSR D#L4
     C*
     C                     EXSR D#PR
     C*
     CL4                   EXSR T#L4
     C****
     CSR         D#L4      BEGSR
     C                     Z-ADD0         GAMT   110
     C                     Z-ADD0         NAMT   110
     C                     Z-ADD0         NBAL   110
     CSR         D#L4Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C                     MOVELINNO      IVNO
     C           IVKEY     SETLLINVDTL               95
     C           *IN95     DOWEQ'0'
     C           IVKEY     READEINVDTL                   95
     C         95          LEAVE
     C                     SELEC
     C           IVACNT    WHEQ '4'
     C                     EXSR C4#RTN
     C           IVACNT    WHEQ '6'
     C                     EXSR C6#RTN
     C                     ENDSL
     C                     ENDDO
     C***
     CSR         D#PRZ     ENDSR
     C****
     CSR         C4#RTN    BEGSR
     C                     SELEC
     C           IVFL03    WHEQ 'G'
     C                     ADD  IVAMT     GAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     CSR         C6#RTN    BEGSR
     C                     MOVELIVAPNO    RVNO
     C                     MOVELIVAPNO    APNO    6
     C                     Z-ADD0         RVITEM
     C           RVKEY     SETLLRCVDTL               97
     C           *IN97     DOWEQ'0'
     C           APNO      READERCVDTL                   97
     C         97          LEAVE
     C           RVUSTP    IFEQ 'A2'
     C           RVNTCD    ANDEQ'1'
     C                     ADD  IVAMT     NAMT
     C                     ENDIF
     C                     ENDDO
     CSR                   ENDSR
     C****
     CSR         T#L4      BEGSR
     C           INORNO    CHAINAFCBAL               96
     C  N96                EXSR UP#AR
     CSR                   ENDSR
     C****
     CSR         UP#AR     BEGSR
     C                     MOVEL'C'       AFFLAG
     C                     Z-SUBGAMT      AFGAMT
     C                     Z-SUBNAMT      AFNAMT
     C           AFNAMT    SUB  AFGAMT    AFNBAL
     C                     MOVE UDATE     AFCHDT
     C                     UPDATAFREC
     CSR         UP#ARZ    ENDSR
