     FRCVDTL  UP  E                    DISK
     F            RVREC                             KRENAMERVRECD
     IRVRECD      01
     I              RVFLAG                          FLAG
     I              RVNO                            NO
     I              RVITEM                          ITEM
     I              RVDATE                          DATE
     I              RVCUNO                          CUNO
     I              RVCUNM                          CUNM
     I              RVTYPE                          TYPE
     I              RVDPNO                          DPNO
     I              RVVNO1                          VNO1
     I              RVDECD                          DECD
     I              RVDEDT                          DEDT
     I              RVUSTP                          USTP
     I              RVNTTP                          NTTP
     I              RVPBID                          PBID
     I              RVPANO                          PANO
     I              RVACTP                          ACTP
     I              RVACNO                          ACNO
     I              RVRLNO                          RLNO
     I              RVPLAC                          PLAC
     I              RVNTNO                          NTNO
     I              RVDUDT                          DUDT
     I              RVRAMT                          RAMT
     I              RVSBID                          SBID
     I              RVSANO                          SANO
     I              RVAMCD                          AMCD
     I              RVWRNO                          WRNO
     I              RVNTCD                          NTCD
     I              RVNTDT                          NTDT
     I              RVPRCD                          PRCD
     I              RVPRDT                          PRDT
     I              RVTBID                          TBID
     I              RVTANO                          TANO
     I              RVVNO2                          VNO2
     I              RVTXAR                          TXAR
     I              RVTXDT                          TXDT
     I              RVAREA                          AREA
     I              RVRVID                          RVID
     I              RVRESV                          RESV
8905 I              RVOLRV                          OLRV
 .   I              RVOLDT                          OLDT
 .   I              RVRES2                          RES2
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           ITEM
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     ORVRECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
