     H            Y                                     1                 BR100
     FARINVMW IP  E           K        DISK
     FARINVM  UF  E           K        DISK                      A
     IRARINVMW    01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C           AWINNO    CHAINRARINVM              40
     C*
     C   40                CLEARRARINVM
     C*
     C           U#AREA    IFNE 'P'                        廠區送台北
     C                     MOVE AWFLAG    AMFLAG
 9203C                     MOVE *ON       *IN50
     C                     ELSE
     C                     MOVE *BLANK    AMFLAG
 9203C                     MOVE *OFF      *IN50            台北
     C                     ENDIF
     C*
     C                     MOVE AWINNO    AMINNO           發票號碼
     C                     Z-ADDAWINDT    AMINDT           發票日期
     C                     Z-ADDAWDUDT    AMDUDT           到期日期
     C                     MOVE AWINTP    AMINTP           發票聯式
     C                     MOVE AWDELT    AMDELT           作廢碼
     C                     MOVE AWDELD    AMDELD           作廢日期
     C                     MOVE AWCUNO    AMCUNO           客戶編號
     C                     MOVE AWCUNM    AMCUNM           客戶簡稱
     C                     Z-ADDAWAAMT    AMAAMT           銷貨金額
     C                     Z-ADDAWATAX    AMATAX           銷貨稅額
     C                     Z-ADDAWBAMT    AMBAMT           折讓金額
     C                     Z-ADDAWBTAX    AMBTAX           折讓稅額
     C                     Z-ADDAWCAMT    AMCAMT           預收金額
     C                     Z-ADDAWDAMT    AMDAMT           發票金額
     C                     Z-ADDAWEAMT    AMEAMT           已融資金額
     C                     Z-ADDAWFAMT    AMFAMT           已沖銷金額
     C                     MOVE AWAPN1    AMAPN1           承購單號
     C                     Z-ADDAWAPD1    AMAPD1           承購日期
     C                     MOVE AWAPN2    AMAPN2           請款單號
     C                     Z-ADDAWAPD2    AMAPD2           請款日期
     C                     MOVE AWORNO    AMORNO           訂單編號
     C                     MOVE AWAREA    AMAREA           開立廠區
     C  N50                MOVE AWACN1    AMACN1           手續費傳票號碼
     C  N50                MOVE AWAPCD    AMAPCD           承購確認碼
     C  N50                Z-ADDAWDAT1    AMDAT1           手續費代開日期
     C  N50                MOVE AWDLC1    AMDLC1           承購下載碼
     C  N50                MOVE AWDLM1    AMDLM1           承購下載人員
     C  N50                Z-ADDAWDLD1    AMDLD1           承購下載日期
     C  N50                MOVE AWBLCB    AMBLCB           承購下載批號
     C  N50                MOVE AWCHKC    AMCHKC           對帳碼
     C  N50                MOVE AWCHKM    AMCHKM           對帳人員
     C  N50                Z-ADDAWCHKD    AMCHKD           對帳日期
     C  N50                MOVE AWDLC2    AMDLC2           對帳下載碼
     C  N50                MOVE AWDLM2    AMDLM2           對帳下載人員
     C  N50                Z-ADDAWDLD2    AMDLD2           對帳下載日期
     C  N50                MOVE AWCLOC    AMCLOC           結案碼
     C  N50                MOVE AWCLOM    AMCLOM           結案人員
     C  N50                Z-ADDAWCLOD    AMCLOD           結案日期
     C                     MOVE AWUPDM    AMUPDM           異動人員
     C                     Z-ADDAWUPDD    AMUPDD           異動日期
     C                     Z-ADDAWUPDT    AMUPDT           異動時間
     C           U#AREA    IFEQ 'P'                        台北下傳
     C           AWFLAG    IFEQ 'D'                        刪除
     C  N40                DELETRARINVM
     C                     ELSE
     C   40                WRITERARINVM
     C  N40                UPDATRARINVM
     C                     ENDIF
     C                     ELSE
     C   40                WRITERARINVM
     C  N40                UPDATRARINVM
     C                     ENDIF
     C*
     C                     ENDSR
