     FINVMSTP IP  E                    DISK
     F            INREC                             KRENAMEINRECD
     FINVMST  UF  E           K        DISK                      A
     IINRECD      01
     I              INFLAG                          FLAG
     I              INTYPE                          TYPE
     I              INDECD                          DECD
     I              INDEDT                          DEDT
     I              INNO                            NO
     I              INCUNO                          CUNO
     I              INCUNM                          CUNM
     I              INORNO                          ORNO
     I              ININDT                          INDT
     I              INKIND                          KIND
     I              INRVID                          RVID
     I              INSALE                          SALE
     I              INSATP                          SATP
     I              INAREA                          AREA
     I              INTXTP                          TXTP
     I              INAAMT                          AAMT
     I              INATAX                          ATAX
     I              INBAMT                          BAMT
     I              INCAMT                          CAMT
     I              INCTAX                          CTAX
     I              INDAMT                          DAMT
     I              INDTAX                          DTAX
     I              INEAMT                          EAMT
     I              INFAMT                          FAMT
     I              INNBAL                          NBAL
     I              INMAMT                          MAMT
     I              INAPNO                          APNO
     I              INAPDT                          APDT
     I              INRCNO                          RCNO
     I              INRCDT                          RCDT
     I              INFL01                          FL01
     I              INTXAR                          TXAR
     I              INTXDT                          TXDT
     I              INRESV                          RESV
     C           KEY       KLIST
     C                     KFLD           NO
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAININREC                31
     C                     MOVE *BLANK    INFLAG
     C                     MOVE TYPE      INTYPE
     C                     MOVE DECD      INDECD
     C                     Z-ADDDEDT      INDEDT
     C                     MOVE NO        INNO
     C                     MOVE CUNO      INCUNO
     C                     MOVE CUNM      INCUNM
     C                     MOVE ORNO      INORNO
     C                     Z-ADDINDT      ININDT
     C                     MOVE KIND      INKIND
     C                     MOVE RVID      INRVID
     C                     MOVE SALE      INSALE
     C                     MOVE SATP      INSATP
     C                     MOVE AREA      INAREA
     C                     MOVE TXTP      INTXTP
     C                     Z-ADDAAMT      INAAMT
     C                     Z-ADDATAX      INATAX
     C                     Z-ADDBAMT      INBAMT
     C                     Z-ADDCAMT      INCAMT
     C                     Z-ADDCTAX      INCTAX
     C                     Z-ADDDAMT      INDAMT
     C                     Z-ADDDTAX      INDTAX
     C                     Z-ADDEAMT      INEAMT
     C                     Z-ADDFAMT      INFAMT
     C                     Z-ADDNBAL      INNBAL
     C                     Z-ADDMAMT      INMAMT
     C                     MOVE APNO      INAPNO
     C                     Z-ADDAPDT      INAPDT
     C                     MOVE RCNO      INRCNO
     C                     Z-ADDRCDT      INRCDT
     C                     MOVE FL01      INFL01
     C                     MOVE TXAR      INTXAR
     C                     Z-ADDTXDT      INTXDT
     C                     MOVE RESV      INRESV
     C   11 31
     COR 12 31             WRITEINREC
     C   11N31
     COR 12N31             UPDATINREC
     C   13N31             EXCPTDEL#A
     OINREC   EDEL             DEL#A
