     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP071R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     客戶暫收統計檔期初設定─合計未兌現
     H*            5.DATE-WRITTEN  88/11/30
     H*
     H*****************************************************************
     FRCVDTL  UP  E                    DISK
     FAR2159F UF  E           K        DISK                      A
     I*****************************************************************
     IRVREC
     I                                              RVCUNOL1
     I*----------------------------------------------------------------
     I           UDS
     I                                        1   1 U#AREA
     I            DS
     I                                        1  12 RVRESV
     I                                       12  12 D#RESV
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C  N99                SETON                     99
     C   L1                EXSR L1CLR
     C                     EXSR DTLSR
     CL1 99                EXSR L1SR
     CLR 99                EXSR LRSR
     CLRN99                EXSR MSGSR
     C*
     C*********************************
     C*  初始程式
     C*********************************
     CSR         INISR     BEGSR
     C           K#AR      KLIST
     C                     KFLD           ARCUNO
     C                     KFLD           ARAREA
     CSR                   ENDSR
     C*
     C*********************************
     C*  L1清除函式     (換了客戶)
     C*********************************
     CSR         L1CLR     BEGSR
     C                     Z-ADD0         W#AMT  110
     CSR                   ENDSR
     C*
     C*********************************
     C*  DETAIL TIME 函式
     C*********************************
     CSR         DTLSR     BEGSR
     C                     CALL 'ARQ015R'
     C                     PARM RVNO      P#RVNO  6
     C                     PARM RVITEM    P#ITEM  20
9011 C                     PARM '0'       P#MODE  1
     C                     PARM 0         P#RAMT 110
     C*
     C           P#RAMT    IFNE 0                          應轉暫收
     C                     MOVEL'#'       D#RESV
     C                     UPDATRVREC
     C                     ADD  P#RAMT    W#AMT            累計
     C                     ENDIF
     CSR                   ENDSR
     C*
     C*********************************
     C*  L1 函式  換了客戶
     C*********************************
     CSR         L1SR      BEGSR
     C           W#AMT     IFEQ 0                          無應轉暫收
     C                     GOTO ESL1
     C                     ENDIF
     C*
     C                     MOVELRVCUNO    ARCUNO
     C                     MOVELU#AREA    ARAREA
     C           K#AR      CHAINARREC                69
     C*
     C           *IN69     IFEQ '0'
     C                     Z-ADDW#AMT     ARAMT3
     C                     UPDATARREC
     C*
     C                     ELSE
     C                     CLEARARREC
     C                     MOVELRVCUNO    ARCUNO
     C                     MOVELU#AREA    ARAREA
     C                     Z-ADDW#AMT     ARAMT3
     C                     WRITEARREC
     C                     ENDIF
     CSR         ESL1      ENDSR
     C*
     C*********************************
     C*  LR 函式  印核覆
     C*********************************
     CSR         LRSR      BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  查無資料函式
     C*********************************
     CSR         MSGSR     BEGSR
     CSR                   ENDSR
     C*
     C*****************************************************************
