     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARP002RA
     H*            2.PROGRAM-TYPE  RPG
     H*            3.AUTHOR        ERIC  LEE
     H*            4.FUNCTION     發票開立作業TRNDTL --> TRNDTLW
     H*            5.DATE-WRITTEN  85/10/15
     H*            6.UPDATE  DATE 104/09/23  2015AR953  S00WCJ (0409A)
     H*                            產品代碼3碼擴5碼
     H*
     H*****************************************************************
     FTRNDTL  IP  E           K        DISK
     FARODCT  IF  E           K        DISK
     FTRNDTLW UF  E           K        DISK                      A
     F            TXREC                             KRENAMETXRECW
     ITXRECW      01
     I              TXFLAG                          TWFLAG
     I              TXCODE                          TWCODE
     I              TXNO                            TWNO
     I              TXITEM                          TWITEM
     I              TXACNT                          TWACNT
     I              TXDATE                          TWDATE
     I              TXACDT                          TWACDT
     I              TXCUNO                          TWCUNO
     I              TXCUNM                          TWCUNM
     I              TXORNO                          TWORNO
     I              TXIVNO                          TWIVNO
     I              TXPCNO                          TWPCNO
     I              TXVUNO                          TWVUNO
     I              TXRVID                          TWRVID
     I              TXSALE                          TWSALE
     I              TXSATP                          TWSATP
     I              TXIVTP                          TWIVTP
     I              TXPDNM                          TWPDNM
     I              TXQTY                           TWQTY
     I              TXUPRC                          TWUPRC
     I              TXAMT                           TWAMT
     I              TXTAX                           TWTAX
     I              TXFL01                          TWFL01
     I              TXFL02                          TWFL02
     I              TXTXAR                          TWTXAR
     I              TXTXDT                          TWTXDT
     I              TXRESV                          TWRESV
     I              TXHOLD                          TWHOLD
     C*
     C           KEY01     KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C                     KFLD           TXITEM
     C           KEY02     KLIST
9009 C                     KFLD           ORNO    9
     C                     KFLD           CTKD    2
     C*
     C                     SETOF                     3031
     C           KEY01     CHAINTXRECW               30
     C                     EXSR MOVE1
9008 C                     MOVELTXORNO    ORNO
     C                     MOVE '04'      CTKD
     C           KEY02     SETLLRARODCT              31
     C                     READ RARODCT                  31
     C           *IN31     IFEQ '0'
     C           ORNO      ANDEQA2ORNO
     C           CTKD      ANDEQA2CTKD
     C           A2MTHD    ANDEQ'05'
     C                     MOVE 'Y'       TWHOLD
     C                     ELSE
     C                     MOVE 'N'       TWHOLD
     C                     END
     C           *IN30     IFEQ '0'
     C                     UPDATTXRECW
     C                     ELSE
     C                     WRITETXRECW
     C                     END
     C**************************************************************
     C           MOVE1     BEGSR
     C                     MOVE TXFLAG    TWFLAG
     C   30                MOVE TXCODE    TWCODE
     C   30                MOVE TXNO      TWNO
     C   30                Z-ADDTXITEM    TWITEM
     C                     MOVE TXACNT    TWACNT
     C                     Z-ADDTXDATE    TWDATE
     C                     Z-ADDTXACDT    TWACDT
     C                     MOVE TXCUNO    TWCUNO
     C                     MOVE TXCUNM    TWCUNM
9008 C                     MOVELTXORNO    TWORNO
     C                     MOVE TXIVNO    TWIVNO
     C                     MOVE TXPCNO    TWPCNO
     C                     MOVE TXVUNO    TWVUNO
     C                     MOVE TXRVID    TWRVID
     C                     MOVE TXSALE    TWSALE
     C                     MOVE TXSATP    TWSATP
     C                     MOVE TXIVTP    TWIVTP
0409AC                     MOVELTXPDNM    TWPDNM
     C                     Z-ADDTXQTY     TWQTY
     C                     Z-ADDTXUPRC    TWUPRC
     C                     Z-ADDTXAMT     TWAMT
     C                     Z-ADDTXTAX     TWTAX
     C                     MOVE TXFL01    TWFL01
     C                     MOVE TXFL02    TWFL02
     C                     MOVE TXTXAR    TWTXAR
     C                     Z-ADDTXTXDT    TWTXDT
0409AC                     MOVELTXRESV    TWRESV
     C                     ENDSR
