     H        1   Y                                     1                 BR003
     FINVDTL  UP  E                    DISK
     FINVMST  IF  E           K        DISK
     FSAMAST  IF  E           K        DISK
     FARSTAT  UF  E           K        DISK                      A
     IIVREC
     I                                              IVRESVL2
     I                                              IVNO  L1
     IAADS        DS
9008 I                                        1   9 IVORNO
LYW  I                                        1   1 ORNO1
 .   I                                        2   6 ORNO21
 .   I                                        7   90ORNO3
     I           UDS
9008 I                                        1   80YMD
     C*----------------------------------------------------
     C           SAKEY     KLIST
     C                     KFLD           ORNO1
     C                     KFLD           ORNO2   50
     C                     KFLD           ORNO3
     C           ARKEY     KLIST
     C                     KFLD           ARORNO
     C   L2                EXSR D#L2
     C   L1N97             EXSR D#L1
     C*
     C     N97             EXSR D#PR
     C*
     CL2   N96             EXSR T#L2
     C****
     C****
     CSR         D#L2      BEGSR
     C                     Z-ADD0         AQTY   110
     C                     Z-ADD0         AAMT   110
     C                     Z-ADD0         ATAX   110
     C                     Z-ADD0         BAMT   110
     C                     Z-ADD0         CAMT   110
     C                     Z-ADD0         CTAX   110
     C                     Z-ADD0         DAMT   110
     C                     Z-ADD0         DTAX   110
     C                     Z-ADD0         EAMT   110
     C                     Z-ADD0         ETAX   110
     C                     Z-ADD0         FAMT   110
     C                     Z-ADD0         FTAX   110
     C                     Z-ADD0         GAMT   110
     C                     Z-ADD0         GTAX   110
     C                     Z-ADD0         HAMT   110
     C                     Z-ADD0         HTAX   110
     C                     Z-ADD0         IAMT   110
     C                     Z-ADD0         JAMT   110
     C                     Z-ADD0         KAMT   110
     C                     Z-ADD0         LAMT   110
     C                     Z-ADD0         NBAL   110
     C                     Z-ADD0         PBAL   110
     C                     Z-ADD0         CNT     20
     C                     TESTN          ORNO21     55
     C   55                MOVELORNO21    ORNO2
     C  N55                Z-ADD0         ORNO2
     C                     Z-ADD1         ORNO3
     C           SAKEY     CHAINSAMAST               96
     CSR         D#L2Z     ENDSR
     C****
     CSR         D#L1      BEGSR
     C           IVNO      CHAININVMST               97
     CSR         D#L1Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C                     SELEC
     C           IVACNT    WHEQ '1'
     C                     EXSR C1#RTN
     C           IVACNT    WHEQ '2'
     C           IVDECD    IFEQ ' '
     C                     ADD  IVAMT     DAMT
     C                     ELSE
     C                     SUB  IVAMT     DAMT
     C                     ENDIF
     C           IVACNT    WHEQ '3'
     C           IVDECD    IFEQ ' '
     C                     ADD  IVAMT     FAMT
     C                     ELSE
     C                     SUB  IVAMT     FAMT
     C                     ENDIF
     C           IVACNT    WHEQ '4'
     C                     EXSR C4#RTN
     C           IVACNT    WHEQ '5'
     C                     EXSR C5#RTN
     C           IVACNT    WHEQ '6'
     C                     EXSR C6#RTN
     C           IVACNT    WHEQ '7'
     C                     EXSR C7#RTN
     C                     ENDSL
     C***
     C           IVDECD    IFEQ ' '
     C                     MOVEL'Y'       IVFL01
     C                     ELSE
     C                     MOVEL' '       IVFL01
     C                     ENDIF
     C                     UPDATIVREC
     CSR         D#PRZ     ENDSR
     C****
     CSR         C1#RTN    BEGSR
     C           IVDECD    IFEQ ' '
     C                     ADD  IVQTY     AQTY
     C                     SELEC
     C           IVFL03    WHEQ 'A'
     C                     ADD  IVAMT     AAMT
     C           IVFL03    WHEQ 'B'
     C                     ADD  IVAMT     CAMT
     C           IVFL03    WHEQ 'C'
     C                     ADD  IVAMT     DAMT
     C                     ENDSL
     C                     ELSE
     C                     SUB  IVQTY     AQTY
     C                     SELEC
     C           IVFL03    WHEQ 'A'
     C                     SUB  IVAMT     AAMT
     C           IVFL03    WHEQ 'B'
     C                     SUB  IVAMT     CAMT
     C           IVFL03    WHEQ 'C'
     C                     SUB  IVAMT     DAMT
     C                     ENDSL
     C                     ENDIF
     CSR                   ENDSR
     C****
     CSR         C4#RTN    BEGSR
     C           IVDECD    IFEQ ' '
     C                     SELEC
     C           IVFL03    WHEQ 'E'
     C                     ADD  IVAMT     BAMT
     C           IVFL03    WHEQ 'F'
     C                     ADD  IVAMT     HAMT
     C           IVFL03    WHEQ 'G'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'H'
     C                     ADD  IVAMT     GAMT
     C                     ENDSL
     C                     ELSE
     C                     SELEC
     C           IVFL03    WHEQ 'E'
     C                     SUB  IVAMT     BAMT
     C           IVFL03    WHEQ 'F'
     C                     SUB  IVAMT     HAMT
     C           IVFL03    WHEQ 'G'
     C                     SUB  IVAMT     EAMT
     C           IVFL03    WHEQ 'H'
     C                     SUB  IVAMT     GAMT
     C                     ENDSL
     C                     ENDIF
     CSR                   ENDSR
     C****
     CSR         C5#RTN    BEGSR
     C           IVDECD    IFEQ ' '
     C                     SELEC
     C           IVFL03    WHEQ 'A'
     C                     ADD  IVAMT     ATAX
     C           IVFL03    WHEQ 'B'
     C                     ADD  IVAMT     CTAX
     C           IVFL03    WHEQ 'C'
     C                     ADD  IVAMT     DTAX
     C           IVFL03    WHEQ 'D'
     C                     ADD  IVAMT     FTAX
     C           IVFL03    WHEQ 'F'
     C                     ADD  IVAMT     HTAX
     C           IVFL03    WHEQ 'G'
     C                     ADD  IVAMT     ETAX
     C           IVFL03    WHEQ 'H'
     C                     ADD  IVAMT     GTAX
     C                     ENDSL
     C                     ELSE
     C                     SELEC
     C           IVFL03    WHEQ 'A'
     C                     SUB  IVAMT     ATAX
     C           IVFL03    WHEQ 'B'
     C                     SUB  IVAMT     CTAX
     C           IVFL03    WHEQ 'C'
     C                     SUB  IVAMT     DTAX
     C           IVFL03    WHEQ 'D'
     C                     SUB  IVAMT     FTAX
     C           IVFL03    WHEQ 'F'
     C                     SUB  IVAMT     HTAX
     C           IVFL03    WHEQ 'G'
     C                     SUB  IVAMT     ETAX
     C           IVFL03    WHEQ 'H'
     C                     SUB  IVAMT     GTAX
     C                     ENDSL
     C                     ENDIF
     CSR                   ENDSR
     C****
     CSR         C6#RTN    BEGSR
     C           IVDECD    IFEQ ' '
     C                     SELEC
     C           INTYPE    WHEQ '1'
     C           INTYPE    OREQ '3'
     C                     ADD  IVAMT     IAMT
     C           INTYPE    WHEQ '2'
     C                     ADD  IVAMT     JAMT
     C                     ENDSL
     C                     ELSE
     C                     SELEC
     C           INTYPE    WHEQ '1'
     C           INTYPE    OREQ '3'
     C                     SUB  IVAMT     IAMT
     C           INTYPE    WHEQ '2'
     C                     SUB  IVAMT     JAMT
     C                     ENDSL
     C                     ENDIF
     CSR                   ENDSR
     C****
     CSR         C7#RTN    BEGSR
     C                     SELEC
     C           INTYPE    WHEQ '1'
     C           INTYPE    OREQ '3'
     C                     ADD  IVAMT     KAMT
     C           INTYPE    WHEQ '2'
     C                     ADD  IVAMT     LAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     C****
     CSR         T#L2      BEGSR
     C                     MOVELIVRESV    ARORNO
     C           ARKEY     CHAINARSTAT               96
     C  N96                EXSR UP#AR
     C   96                EXSR WR#AR
     C****
     CSR                   ENDSR
     C*****
     CSR         WR#AR     BEGSR
     C                     CLEARARREC
     C                     MOVEL'A'       ARFLAG
     C                     MOVELINCUNO    ARCUNO
     C                     MOVELINCUNM    ARCUNM
     C                     MOVELIVRESV    ARORNO
     C                     Z-ADDAQTY      ARAQTY
     C                     Z-ADDAAMT      ARAAMT
     C                     Z-ADDATAX      ARATAX
     C                     Z-ADDBAMT      ARBAMT
     C                     Z-ADDCAMT      ARCAMT
     C                     Z-ADDCTAX      ARCTAX
     C                     Z-ADDDAMT      ARDAMT
     C                     Z-ADDDTAX      ARDTAX
     C                     Z-ADDEAMT      AREAMT
     C                     Z-ADDETAX      ARETAX
     C                     Z-ADDFAMT      ARFAMT
     C                     Z-ADDFTAX      ARFTAX
     C                     Z-ADDGAMT      ARGAMT
     C                     Z-ADDGTAX      ARGTAX
     C                     Z-ADDHAMT      ARHAMT
     C                     Z-ADDHTAX      ARHTAX
     C                     Z-ADDIAMT      ARIAMT
     C                     Z-ADDJAMT      ARJAMT
     C                     Z-ADDKAMT      ARKAMT
     C                     Z-ADDLAMT      ARLAMT
     C                     Z-ADDARAAMT    ARNBAL
     C                     ADD  ARATAX    ARNBAL
     C                     ADD  ARBAMT    ARNBAL
     C                     ADD  ARCAMT    ARNBAL
     C                     ADD  ARCTAX    ARNBAL
     C                     ADD  ARDAMT    ARNBAL
     C                     ADD  ARDTAX    ARNBAL
     C                     ADD  ARFAMT    ARNBAL
     C                     ADD  ARFTAX    ARNBAL
     C                     ADD  ARGAMT    ARNBAL
     C                     ADD  ARGTAX    ARNBAL
     C                     ADD  ARIAMT    ARNBAL
     C                     ADD  ARKAMT    ARNBAL
     C                     ADD  ARHAMT    ARNBAL
     C                     ADD  ARHTAX    ARNBAL
     C                     ADD  ARJAMT    ARNBAL
     C                     ADD  AREAMT    ARNBAL
     C                     ADD  ARETAX    ARNBAL
     C                     ADD  ARLAMT    ARNBAL
     C***
     C           ARHAMT    ADD  ARJAMT    PREBAL 110
     C                     ADD  ARLAMT    PREBAL
     C                     ADD  AREAMT    PREBAL
     C           PREBAL    IFLE 0
     C                     Z-ADDARHAMT    ARPBAL
     C                     ADD  AREAMT    ARPBAL
     C                     ELSE
     C                     Z-SUBARJAMT    ARPBAL
     C                     SUB  ARLAMT    ARPBAL
     C                     ENDIF
     C                     ADD  ARBAMT    ARPBAL
     C                     ADD  ARGAMT    ARPBAL
     C                     ADD  ARMAMT    ARPBAL
     C           ARNBAL    IFEQ 0
     C                     MOVE 'Y'       ARFL01
     C                     ENDIF
     C           ARPBAL    IFEQ 0
     C                     MOVE 'Y'       ARFL02
     C                     ENDIF
     C                     WRITEARREC
     CSR         WR#ARZ    ENDSR
     C****
     CSR         UP#AR     BEGSR
     C                     MOVEL'C'       ARFLAG
     C                     ADD  AQTY      ARAQTY
     C                     ADD  AAMT      ARAAMT
     C                     ADD  ATAX      ARATAX
     C                     ADD  BAMT      ARBAMT
     C                     ADD  CAMT      ARCAMT
     C                     ADD  CTAX      ARCTAX
     C                     ADD  DAMT      ARDAMT
     C                     ADD  DTAX      ARDTAX
     C                     ADD  EAMT      AREAMT
     C                     ADD  ETAX      ARETAX
     C                     ADD  FAMT      ARFAMT
     C                     ADD  FTAX      ARFTAX
     C                     ADD  GAMT      ARGAMT
     C                     ADD  GTAX      ARGTAX
     C                     ADD  HAMT      ARHAMT
     C                     ADD  HTAX      ARHTAX
     C                     ADD  IAMT      ARIAMT
     C                     ADD  JAMT      ARJAMT
     C                     ADD  KAMT      ARKAMT
     C                     ADD  LAMT      ARLAMT
     C                     Z-ADDARAAMT    ARNBAL
     C                     ADD  ARATAX    ARNBAL
     C                     ADD  ARBAMT    ARNBAL
     C                     ADD  ARCAMT    ARNBAL
     C                     ADD  ARCTAX    ARNBAL
     C                     ADD  ARDAMT    ARNBAL
     C                     ADD  ARDTAX    ARNBAL
     C                     ADD  ARFAMT    ARNBAL
     C                     ADD  ARFTAX    ARNBAL
     C                     ADD  ARGAMT    ARNBAL
     C                     ADD  ARGTAX    ARNBAL
     C                     ADD  ARIAMT    ARNBAL
     C                     ADD  ARKAMT    ARNBAL
     C           ARHAMT    ADD  ARJAMT    PREBAL 110
     C                     ADD  ARLAMT    PREBAL
     C                     ADD  AREAMT    PREBAL
     C           PREBAL    IFLE 0
     C                     Z-ADDARHAMT    ARPBAL
     C                     ADD  AREAMT    ARPBAL
     C                     ELSE
     C                     Z-SUBARJAMT    ARPBAL
     C                     SUB  ARLAMT    ARPBAL
     C                     ENDIF
     C                     ADD  ARBAMT    ARPBAL
     C                     ADD  ARGAMT    ARPBAL
     C                     ADD  ARMAMT    ARPBAL
     C           ARNBAL    IFEQ 0
     C                     MOVE 'Y'       ARFL01
     C                     ENDIF
     C           ARPBAL    IFEQ 0
     C                     MOVE 'Y'       ARFL02
     C                     ENDIF
     C                     UPDATARREC
     CSR         UP#ARZ    ENDSR
