     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP071R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     客戶暫收統計檔期初設定─合計暫收
     H*            5.DATE-WRITTEN  88/11/30
     H*
     H*****************************************************************
     FRCVDTL  IP  E                    DISK
     FAR2159F O   E           K        DISK
     I*****************************************************************
     IRVREC
     I                                              RVCUNOL1
     I*----------------------------------------------------------------
     I           UDS
     I                                        1   1 U#AREA
     C*****************************************************************
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C  N99                SETON                     99
     C   L1                EXSR L1CLR
     C                     EXSR DTLSR
     CL1 99                EXSR L1SR
     CLR 99                EXSR LRSR
     CLRN99                EXSR MSGSR
     C*
     C*********************************
     C*  初始程式
     C*********************************
     CSR         INISR     BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  L1清除函式     (換了客戶)
     C*********************************
     CSR         L1CLR     BEGSR
     C                     Z-ADD0         D#2159 110
     C                     Z-ADD0         C#2159 110
     CSR                   ENDSR
     C*
     C*********************************
     C*  DETAIL TIME 函式
     C*********************************
     CSR         DTLSR     BEGSR
     C           RVACTP    IFEQ 'D'
     C                     ADD  RVRAMT    D#2159
     C                     ENDIF
     C*
     C           RVACTP    IFEQ 'C'
     C                     ADD  RVRAMT    C#2159
     C                     ENDIF
     CSR                   ENDSR
     C*
     C*********************************
     C*  L1 函式  換了客戶
     C*********************************
     CSR         L1SR      BEGSR
     C           C#2159    SUB  D#2159    W#AMT  110       貸減借
     C           W#AMT     IFEQ 0
     C                     GOTO ESL1
     C                     ENDIF
     C*
     C                     CLEARARREC
     C                     MOVELRVCUNO    ARCUNO
     C                     MOVELU#AREA    ARAREA
     C                     Z-ADDW#AMT     ARAMT4
     C                     WRITEARREC
     CSR         ESL1      ENDSR
     C*
     C*********************************
     C*  LR 函式  印核覆
     C*********************************
     CSR         LRSR      BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  查無資料函式
     C*********************************
     CSR         MSGSR     BEGSR
     CSR                   ENDSR
     C*
     C*****************************************************************
