     H        1   Y                                     1                 BR003
     FINVMST  IP  E                    DISK
     FINVDTLL2IF  E           K        DISK
     FRCVDTL  IF  E           K        DISK
     FAFCBAL  O   E           K        DISK
     IINREC
     I                                              INORNOL4
     I                                              INNO  L2
     I            DS
     I                                        1  20 CHDT
     I                                        1   60TPDT
     I                                        7  120TYDT
     I                                       13  180KSDT
     I            DS
     I                                        1   7 IVORNO
     I                                        1   5 ORNO
     I           UDS
     I                                        1   1 AREA
     C*----------------------------------------------------
     C           AFKEY     KLIST
     C                     KFLD           AFORNO
     C           IVKEY     KLIST
     C                     KFLD           IVORNO
     C                     KFLD           IVACNT
     C           RVKEY     KLIST
     C                     KFLD           RVNO
     C                     KFLD           RVITEM
     C   L4                EXSR D#L4
     CL4                   EXSR T#L4
     C****
     CSR         D#L4      BEGSR
     C                     Z-ADD0         FAMT   110
     C                     Z-ADD0         NAMT   110
     C                     Z-ADD0         EAMT   110
     C                     Z-ADD0         GAMT   110
     C                     Z-ADD0         HAMT   110
     C*
     C                     MOVELINORNO    IVORNO
     C                     MOVEL*BLANK    IVACNT
     C           IVKEY     SETLLINVDTLL2             95
     C           *IN95     DOWEQ'0'
     C                     READ INVDTLL2                 95
     C           INORNO    COMP ORNO                 9595
     C         95          LEAVE
     C                     SELEC
     C           IVACNT    WHEQ '4'
     C                     EXSR C4#RTN
     C           IVACNT    WHEQ '6'
     C                     EXSR C6#RTN
     C                     ENDSL
     C                     ENDDO
     CSR         D#L4Z     ENDSR
     C****
     CSR         C4#RTN    BEGSR
     C                     SELEC
     C           IVFL03    WHEQ 'E'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'F'
     C                     ADD  IVAMT     FAMT
     C           IVFL03    WHEQ 'G'
     C                     ADD  IVAMT     GAMT
     C           IVFL03    WHEQ 'H'
     C                     ADD  IVAMT     HAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     CSR         C6#RTN    BEGSR
     C                     MOVELIVAPNO    RVNO
     C                     MOVELIVAPNO    APNO    6
     C                     Z-ADD0         RVITEM
     C           RVKEY     SETLLRCVDTL               97
     C           *IN97     DOWEQ'0'
     C           APNO      READERCVDTL                   97
     C         97          LEAVE
     C           RVUSTP    IFEQ 'A2'
     C           RVNTCD    ANDEQ'1'
     C                     ADD  IVAMT     NAMT
     C                     ENDIF
     C                     ENDDO
     CSR                   ENDSR
     C****
     CSR         T#L4      BEGSR
     C                     EXSR WR#AR
     CSR                   ENDSR
     C****
     CSR         WR#AR     BEGSR
     C                     CLEARAFREC
     C                     Z-SUBGAMT      AFGAMT
     C                     Z-SUBEAMT      AFEAMT
     C                     Z-SUBNAMT      AFNAMT
     C                     MOVEL'A'       AFFLAG
     C                     MOVELINCUNO    AFCUNO
     C                     MOVELINCUNM    AFCUNM
     C                     MOVELIVORNO    AFORNO
     C                     Z-ADDFAMT      AFFAMT
     C                     Z-ADDHAMT      AFHAMT
     C           AFNAMT    SUB  AFEAMT    AFNBAL
     C                     ADD  AFHAMT    AFNBAL
     C           AFFAMT    SUB  AFEAMT    AFFAMT
     C           AFFAMT    SUB  AFNBAL    WBAL   110
     C*          WBAL      IFEQ 0
     C*                    MOVE 'Y'       AFFL01
     C*                    ENDIF
     C                     MOVE UDATE     AFCHDT
     C                     WRITEAFREC
     CSR         WR#ARZ    ENDSR
