     H            Y                                     1                 BR100
     FINVDTLT IP  E                    DISK
     F            IVREC                             KRENAMEIVRECD
     FINVDTL  UF  E           K        DISK                      A
     F            IVREC                             KRENAMEIVRECA
     FINVDTLP UF  E           K        DISK                      A
     F            IVREC                             KRENAMEIVRECB
     FQPRINT  O   F     198     OV     PRINTER
     IIVRECD      01
     I              IVFLAG                          FLAG
     I              IVNO                            NO
     I              IVACNT                          ACNT
     I              IVITEM                          ITEM
     I              IVACDT                          ACDT
     I              IVORNO                          ORNO
     I              IVPDCD                          PDCD
     I              IVQTY                           QTY
     I              IVUPRC                          UPRC
     I              IVAMT                           AMT
     I              IVDECD                          DECD
     I              IVDEDT                          DEDT
     I              IVAPNO                          APNO
     I              IVACNO                          ACNO
     I              IVFL01                          FL01
     I              IVFL02                          FL02
     I              IVFL03                          FL03
     I              IVTXAR                          TXAR
     I              IVTXDT                          TXDT
     I              IVRESV                          RESV
     I           UDS
     I                                       21  21 FAC
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           ACNT
     C                     KFLD           ITEM
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINIVRECA               31
     C           KEY       CHAINIVRECB               32
     C                     MOVE FLAG      IVFLAG
     C                     MOVE NO        IVNO
     C                     MOVE ACNT      IVACNT
     C                     Z-ADDITEM      IVITEM
     C                     MOVE NO        IVNO
     C                     Z-ADDACDT      IVACDT
     C                     MOVE ORNO      IVORNO
     C                     MOVE PDCD      IVPDCD
     C                     Z-ADDQTY       IVQTY
     C                     Z-ADDUPRC      IVUPRC
     C                     Z-ADDAMT       IVAMT
     C                     MOVE DECD      IVDECD
     C                     Z-ADDDEDT      IVDEDT
     C                     MOVE APNO      IVAPNO
     C                     MOVE ACNO      IVACNO
     C                     MOVE FL01      IVFL01
     C                     MOVE FL02      IVFL02
     C                     MOVE FL03      IVFL03
     C                     MOVE TXAR      IVTXAR
     C                     Z-ADDTXDT      IVTXDT
     C                     MOVE RESV      IVRESV
     C      32             WRITEIVRECB
     C     N32             UPDATIVRECB
     C                     MOVE *BLANK    IVFLAG
     C   11 31
     COR 12 31             WRITEIVRECA
     C   11N31
     COR 12N31             UPDATIVRECA
     C   13N31             EXCPTDEL#A
     OIVRECA  EDEL             DEL#A
     C*--------------------------------------------------------------
     OQPRINT  H  103   1P
     O       OR        OV
     O                                   15 'RPT.ID: AR022'
     O                                  110 '東和鋼鐵股份有限公司'           X
     O                                  180 '印表日期'
     O                                  181 ':'
     O                         UDATE Y  194
     O        H  1     1P
     O       OR        OV
     O                                    9 'FROM :'
     O                         FAC     +  1
     O                                  110 '發票明細傳輸核對清單'
     O                                  180 '頁　　數'
     O                                  181 ':'
     O                         PAGE     194
     O        H  1     1P
     O       OR        OV
     O                                   11 '處理代碼'
     O                                 +  1 '發票號碼'
     O                                 +  1 '類別'
     O                                 +  1 '項次'
     O                                 +  1 '入帳日期'
     O                                 +  1 '訂單號碼'
     O                                 +  1 '品名代號'
     O                                 +  1 '數量'
     O                                 +  1 '單價'
     O                                 +  1 '金額'
     O                                 +  1 '作廢碼'
     O                                 +  1 '作廢日期'
     O                                 +  1 '憑證編號'
     O                                 +  1 '傳票編號'
     O                                 +  1 '過訂單碼'
     O                                 +  1 '過發票碼'
     O                                 +  1 '類別碼'
     O                                 +  1 '異動廠區'
     O                                 +  1 '異動日期'
     O                                 +  1 '保留碼'
     O        H  1     1P
     O       OR        OV
     O                                   21 '===================='
     O                                   41 '===================='
     O                                   61 '===================='
     O                                   81 '===================='
     O                                  101 '===================='
     O                                  121 '===================='
     O                                  141 '===================='
     O                                  161 '===================='
     O                                  181 '===================='
     O                                  195 '=============='
     O        D  1     01
     O                         FLAG       6
     O                         IVNO      21
     O                         IVACNT    26
     O                         IVITEM3   33
     O                         IVACDTY   46
     O                         IVORNO    57
     O                         IVPDCD    64
     O                         IVQTY 4   75
     O                         IVUPRC4   82
     O                         IVAMT 4   94
     O                         IVDECD    98
     O                         IVDEDTY  109
     O                         IVAPNO   122
     O                         IVACNO   132
     O                         IVFL01   142
     O                         IVFL02   152
     O                         IVFL03   162
     O                         IVTXAR   172
     O                         IVTXDTY  184
     O                         IVRESV   192
     O        D  1     01
