     H            Y                                     1                 BR100
     FARINVMW IP  E           K        DISK
     FARINVM  UF  E           K        DISK                      A
     IRARINVMW    01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C           AWINNO    CHAINRARINVM              40
     C           U#AREA    IFNE 'P'                        廠區送台北
     C                     MOVE AWFLAG    AMFLAG
     C                     ELSE
     C                     MOVE *BLANK    AMFLAG
     C                     ENDIF
     C*
     C                     MOVE AWINNO    AMINNO
     C                     Z-ADDAWINDT    AMINDT
     C                     Z-ADDAWDUDT    AMDUDT
     C                     MOVE AWINTP    AMINTP
     C                     MOVE AWDELT    AMDELT
     C                     MOVE AWDELD    AMDELD
     C                     MOVE AWCUNO    AMCUNO
     C                     MOVE AWCUNM    AMCUNM
     C                     Z-ADDAWAAMT    AMAAMT
     C                     Z-ADDAWATAX    AMATAX
     C                     Z-ADDAWBAMT    AMBAMT
     C                     Z-ADDAWBTAX    AMBTAX
     C                     Z-ADDAWCAMT    AMCAMT
     C                     Z-ADDAWDAMT    AMDAMT
     C                     Z-ADDAWEAMT    AMEAMT
     C                     Z-ADDAWFAMT    AMFAMT
     C                     MOVE AWAPN1    AMAPN1
     C                     Z-ADDAWAPD1    AMAPD1
     C                     MOVE AWAPCD    AMAPCD
     C                     MOVE AWAPN2    AMAPN2
     C                     Z-ADDAWAPD2    AMAPD2
     C                     MOVE AWORNO    AMORNO
     C                     MOVE AWAREA    AMAREA
     C                     MOVE AWACN1    AMACN1
     C                     Z-ADDAWDAT1    AMDAT1
     C                     MOVE AWDLC1    AMDLC1
     C                     MOVE AWDLM1    AMDLM1
     C                     Z-ADDAWDLD1    AMDLD1
     C                     MOVE AWBLCB    AMBLCB
     C                     MOVE AWCHKC    AMCHKC
     C                     MOVE AWCHKM    AMCHKM
     C                     Z-ADDAWCHKD    AMCHKD
     C                     MOVE AWDLC2    AMDLC2
     C                     MOVE AWDLM2    AMDLM2
     C                     Z-ADDAWDLD2    AMDLD2
     C                     MOVE AWCLOC    AMCLOC
     C                     MOVE AWCLOM    AMCLOM
     C                     Z-ADDAWCLOD    AMCLOD
     C                     MOVE AWUPDM    AMUPDM
     C                     Z-ADDAWUPDD    AMUPDD
     C                     Z-ADDAWUPDT    AMUPDT
     C           U#AREA    IFEQ 'P'                        台北下傳
     C           AWFLAG    IFEQ 'D'                        刪除
     C  N40                DELETRARINVM
     C                     ELSE
     C   40                WRITERARINVM
     C  N40                UPDATRARINVM
     C                     ENDIF
     C                     ELSE
     C   40                WRITERARINVM
     C  N40                UPDATRARINVM
     C                     ENDIF
     C*
     C                     ENDSR
