     FARSTATP IP  E                    DISK
     F            ARREC                             KRENAMEARRECD
     FARSTAT  UF  E           K        DISK                      A
     IARRECD      01
     I              ARFLAG                          FLAG
     I              ARCUNO                          CUNO
     I              ARCUNM                          CUNM
     I              ARORNO                          ORNO
     I              ARAAMT                          AAMT
     I              ARATAX                          ATAX
     I              ARBAMT                          BAMT
     I              ARCAMT                          CAMT
     I              ARCTAX                          CTAX
     I              ARDAMT                          DAMT
     I              ARDTAX                          DTAX
     I              AREAMT                          EAMT
     I              ARETAX                          ETAX
     I              ARFAMT                          FAMT
     I              ARFTAX                          FTAX
     I              ARGAMT                          GAMT
     I              ARGTAX                          GTAX
     I              ARHAMT                          HAMT
     I              ARHTAX                          HTAX
     I              ARIAMT                          IAMT
     I              ARJAMT                          JAMT
     I              ARKAMT                          KAMT
     I              ARLAMT                          LAMT
     I              ARNBAL                          NBAL
     I              ARPBAL                          PBAL
     I              ARMAMT                          MAMT
     I              ARFL01                          FL01
     I              ARFL02                          FL02
     I              ARRESV                          RESV
     C           KEY       KLIST
     C                     KFLD           ORNO
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINARREC                31
     C                     MOVE *BLANK    ARFLAG
     C                     MOVE CUNO      ARCUNO
     C                     MOVE CUNM      ARCUNM
9008 C                     MOVELORNO      ARORNO
     C                     Z-ADDAAMT      ARAAMT
     C                     Z-ADDATAX      ARATAX
     C                     Z-ADDBAMT      ARBAMT
     C                     Z-ADDCAMT      ARCAMT
     C                     Z-ADDCTAX      ARCTAX
     C                     Z-ADDDAMT      ARDAMT
     C                     Z-ADDDTAX      ARDTAX
     C                     Z-ADDEAMT      AREAMT
     C                     Z-ADDETAX      ARETAX
     C                     Z-ADDFAMT      ARFAMT
     C                     Z-ADDFTAX      ARFTAX
     C                     Z-ADDGAMT      ARGAMT
     C                     Z-ADDGTAX      ARGTAX
     C                     Z-ADDHAMT      ARHAMT
     C                     Z-ADDHTAX      ARHTAX
     C                     Z-ADDIAMT      ARIAMT
     C                     Z-ADDJAMT      ARJAMT
     C                     Z-ADDKAMT      ARKAMT
     C                     Z-ADDLAMT      ARLAMT
     C                     Z-ADDNBAL      ARNBAL
     C                     Z-ADDPBAL      ARPBAL
     C                     Z-ADDMAMT      ARMAMT
     C                     MOVE FL01      ARFL01
     C                     MOVE FL02      ARFL01
     C                     MOVE RESV      ARRESV
     C   11 31
     COR 12 31             WRITEARREC
     C   11N31
     COR 12N31             UPDATARREC
     C   13N31             EXCPTDEL#A
     OARREC   EDEL             DEL#A
