     H            Y                                     1                 BR100
     FBALF    O   E                    DISK
     I           UDS
     I                                        3   7 ORNO
     C                     CLEARBREC
     C                     MOVE ORNO      BORNO
     C                     WRITEBREC
     C                     SETON                     LR
