     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP002RV
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     發票可用票軌剩十分之一之檢測
     H*            5.DATE-WRITTEN  87/06/24
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FGENSEQ  IF  E           K        DISK
     F*****************************************************************
     I           UDS
     I                                        1   1 U#RTN2
     I                                        2   2 U#RTN3
     I                                        3  10 U#IVN2
     I                                       11  18 U#IVN3
     I                                      951 985 S#COMP
     I                                     10111020 S#DEVI
     I                                     10011010 U#USID
     I                                     10211021 U#AREA
     I*
     I            DS
     I                                        1   5 W#PRIN
     I                                        1   1 D#AREA
     I                                        2   5 D#YYMM
     C**************************************************************
     C*   檔案搜尋關鍵
     C**************************************************************
     C           K#GE      KLIST
     C                     KFLD           GEKIND
     C                     KFLD           GEPRIN
     C**************************************************************
     C*   主程式開始
     C**************************************************************
     C                     MOVELU#AREA    D#AREA
     C                     MOVELUDATE     D#YYMM
     C*
     C                     MOVEL'01'      GEKIND
     C                     MOVELW#PRIN    GEPRIN
     C                     MOVEL'F'       U#RTN2
     C           K#GE      CHAINGEREC                69
     C           *IN69     IFEQ '0'
     C           GEENNO    SUB  GESTNO    W#IVNO  80
     C                     ADD  1         W#IVNO
     C           W#IVNO    MULT 0.9       W#IVNO    H
     C                     ADD  GESTNO    W#IVNO
     C*
     C           GECUNO    IFGT W#IVNO
     C                     MOVEL'T'       U#RTN2
     C           GEENNO    SUB  GECUNO    W#IVNO
     C                     MOVELW#IVNO    U#IVN2
     C                     ENDIF
     C                     ENDIF
     C*
     C*---------------------------------------------------------------
     C*
     C                     MOVEL'02'      GEKIND
     C                     MOVELW#PRIN    GEPRIN
     C                     MOVEL'F'       U#RTN3
     C           K#GE      CHAINGEREC                69
     C           *IN69     IFEQ '0'
     C           GEENNO    SUB  GESTNO    W#IVNO  80
     C                     ADD  1         W#IVNO
     C           W#IVNO    MULT 0.9       W#IVNO    H
     C                     ADD  GESTNO    W#IVNO
     C*
     C           GECUNO    IFGT W#IVNO
     C                     MOVEL'T'       U#RTN3
     C           GEENNO    SUB  GECUNO    W#IVNO
     C                     MOVELW#IVNO    U#IVN3
     C                     ENDIF
     C                     ENDIF
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
