     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP075R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            4.FUNCTION     折讓退回代開
     H*            5.DATE-WRITTEN  90/01/03
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FINVMST  IP  E           K        DISK
     IINREC
     I           UDS
     I                                      301 301 P#CODE
     C                     EXSR DTLSR
     CLRN99                EXSR LRSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     MOVE *ON       *IN99
     C                     MOVE 'Y'       P#CODE
     C                     ENDSR
     C*****************************************************************
     C           LRSR      BEGSR
     C*****************************************************************
     C                     MOVE 'N'       P#CODE
     C                     ENDSR
