     H            Y                                     1                 BR100
     FCPRBAL  IF  E           K        DISK
     FBALFT   O   E           K        DISK
     I           UDS
     I                                        3   7 ORNO
     C           ORNO      CHAINCPREC                31
     C           *IN31     IFEQ '0'
     C                     CLEARBREC
     C                     MOVE CPFLAG    BFLAG
     C                     MOVE CPCUNO    BCUNO
     C                     MOVE CPCUNM    BCUNM
     C                     MOVE CPORNO    BORNO
     C                     Z-ADDCPPBAL    BPBAL
     C                     Z-ADDCPAAMT    BAAMT
     C                     Z-ADDCPBAMT    BBAMT
     C                     Z-ADDCPNBAL    BNBAL
     C                     Z-ADDCPAMT1    BAMT1
     C                     Z-ADDCPAMT2    BAMT2
     C                     Z-ADDCPAMT3    BAMT3
     C                     MOVE CPRESV    BRESV
     C                     WRITEBREC
     C                     END
     C                     SETON                     LR
