     H            Y                                     1                 BR100
     FARCVDT  UP  E           K        DISK
     IRARCVDT     01
     I           UDS
     I                                      301 304 U#CONT
     I                                     10011010 U#USER
     C  N99                EXSR INISR
     C   01                EXSR DTLSR
     CLR                   EXSR LRSR
     CLR                   RETRN
     CSR         INISR     BEGSR
     C                     Z-ADD0         W#CONT  40
     C                     MOVE *ON       *IN99
     C                     ENDSR
     C*
     CSR         DTLSR     BEGSR
     C                     MOVE *BLANK    ATDLC1
     C                     MOVE UDATE     ATDLD1           下載日期
     C                     MOVE U#USER    ATDLM1           下載人員
     C                     MOVE *BLANK    ATBHID
     C                     UPDATRARCVDT
     C                     ADD  1         W#CONT
     C                     ENDSR
     C*
     CSR         LRSR      BEGSR
     C                     MOVE W#CONT    U#CONT
     C                     ENDSR
