     FTRNDTL  UP  E                    DISK
     F            TXREC                             KRENAMETXRECD
     FTRNDTLP UF  E           K        DISK                      A
     ITXRECD      01
     I              TXFLAG                          FLAG
     I              TXCODE                          CODE
     I              TXNO                            NO
     I              TXITEM                          ITEM
     I              TXACNT                          ACNT
     I              TXDATE                          DATE
     I              TXACDT                          ACDT
     I              TXCUNO                          CUNO
     I              TXCUNM                          CUNM
     I              TXORNO                          ORNO
     I              TXIVNO                          IVNO
     I              TXPCNO                          PCNO
     I              TXVUNO                          VUNO
     I              TXRVID                          RVID
     I              TXSALE                          SALE
     I              TXSATP                          SATP
     I              TXIVTP                          IVTP
     I              TXPDNM                          PDNM
     I              TXQTY                           QTY
     I              TXUPRC                          UPRC
     I              TXAMT                           AMT
     I              TXTAX                           TAX
     I              TXFL01                          FL01
     I              TXFL02                          FL02
     I              TXTXAR                          TXAR
     I              TXTXDT                          TXDT
     I              TXRESV                          RESV
     C           KEY       KLIST
     C                     KFLD           CODE
     C                     KFLD           NO
     C                     KFLD           ITEM
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINTXREC                31
     C                     MOVE FLAG      TXFLAG
     C                     MOVE CODE      TXCODE
     C                     MOVE NO        TXNO
     C                     Z-ADDITEM      TXITEM
     C                     MOVE ACNT      TXACNT
     C                     Z-ADDDATE      TXDATE
     C                     Z-ADDACDT      TXACDT
     C                     MOVE CUNO      TXCUNO
     C                     MOVE CUNM      TXCUNM
9008 C                     MOVELORNO      TXORNO
     C                     MOVE IVNO      TXIVNO
     C                     MOVE PCNO      TXPCNO
     C                     MOVE VUNO      TXVUNO
     C                     MOVE RVID      TXRVID
     C                     MOVE SALE      TXSALE
     C                     MOVE SATP      TXSATP
     C                     MOVE IVTP      TXIVTP
     C                     MOVE PDNM      TXPDNM
     C                     Z-ADDQTY       TXQTY
     C                     Z-ADDUPRC      TXUPRC
     C                     Z-ADDAMT       TXAMT
     C                     Z-ADDTAX       TXTAX
     C                     MOVE FL01      TXFL01
     C                     MOVE FL02      TXFL02
     C                     MOVE TXAR      TXTXAR
     C                     Z-ADDTXDT      TXTXDT
     C                     MOVE RESV      TXRESV
     C   31                WRITETXREC
     C  N31                UPDATTXREC
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     OTXRECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
