     H***************************************************************
     H*
     H*       UPDATE  DATE  104/09/24  2015AR953  S00WCJ (0409A)
     H*                      產品代碼3碼擴5碼
     H*
     H***************************************************************
     H            Y                                     1                 BR100
     FARINVDW IP  E           K        DISK
     FARINVD  UF  E           K        DISK                      A
     IRARINVDW    01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C*
     C           K#INVD    KLIST
     C                     KFLD           AVINNO
     C                     KFLD           AVACNT
     C                     KFLD           AVITEM
     C*
     C                     MOVE AWINNO    AVINNO
     C                     MOVE AWACNT    AVACNT
     C                     MOVE AWITEM    AVITEM
     C           K#INVD    CHAINRARINVD              40
     C           U#AREA    IFNE 'P'                        廠區送台北
     C                     MOVE AWFLAG    AVFLAG
     C                     ELSE
     C                     MOVE *BLANK    AVFLAG
     C                     ENDIF
     C                     MOVE AWINNO    AVINNO
     C                     MOVE AWACNT    AVACNT
     C                     Z-ADDAWITEM    AVITEM
     C                     Z-ADDAWACDT    AVACDT
     C                     MOVE AWORNO    AVORNO
0409AC                     MOVELAWPDCD    AVPDCD
     C                     Z-ADDAWQTY     AVQTY
     C                     Z-ADDAWUPRC    AVUPRC
     C                     Z-ADDAWAMT     AVAMT
     C                     MOVE AWDECD    AVDECD
     C                     Z-ADDAWDEDT    AVDEDT
     C                     MOVE AWAPNO    AVAPNO
     C                     MOVE AWACNO    AVACNO
     C                     MOVE AWFL01    AVFL01
     C                     MOVE AWFL02    AVFL02
     C                     MOVE AWFL03    AVFL03
     C                     MOVE AWTXAR    AVTXAR
     C                     Z-ADDAWTXDT    AVTXDT
     C                     MOVE AWRESV    AVRESV
     C*
     C           U#AREA    IFEQ 'P'                        台北下傳
     C           AWFLAG    IFEQ 'D'                        刪除
     C           K#INVD    CHAINRARINVD              40
     C  N40                DELETRARINVD
     C                     ELSE
     C   40                WRITERARINVD
     C  N40                UPDATRARINVD
     C                     ENDIF
     C                     ELSE
     C   40                WRITERARINVD
     C  N40                UPDATRARINVD
     C                     ENDIF
     C*
     C                     ENDSR
