     H            Y                                     1                 BR100
     FARINVM  UP  E           K        DISK
     FCBCUST  IF  E           K        DISK
     FARCUDT  IF  E           K        DISK
     FARDLOD  O   E                    DISK
     IRARINVM     01
     I            DS
     I                                        1  46 D#CUM1
     I                                        1  20 D#MUI1
     I                                       21  30 D#CONT
     I                                       31  43 D#SAMT
     I                                       44  44 D#DOT1
     I                                       45  46 D#ZER1
     I            DS
     I                                        1  99 D#CUM2
     I                                        1  20 D#MUI2
     I                                       21  40 D#MUI3
     I                                       41  60 D#INNO
     I                                       61  63 D#PRCE
     I                                       64  76 D#DAMT
     I                                       77  77 D#DOT2
     I                                       78  79 D#ZER2
     I                                       80  83 D#INYR
     I                                       84  84 D#DAS1
     I                                       85  86 D#INMN
     I                                       87  87 D#DAS2
     I                                       88  89 D#INDT
     I                                       90  93 D#DUYR
     I                                       94  94 D#DAS3
     I                                       95  96 D#DUMN
     I                                       97  97 D#DAS4
     I                                       98  99 D#DUDT
     I            DS
     I                                        1   8 D#DATE
     I                                        1   4 D#YY
     I                                        5   6 D#MM
     I                                        7   8 D#DD
     I           UDS
     I                                      301 303 U#BKID
     I                                     10011010 U#USER
     C  N99                MOVE *ON       *IN99
     C   01                EXSR DTLSR
     CLR 99                EXSR LRSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C*浪┯潦蝗︽
     C           AMCUNO    CHAINRARCUDT             N41
     C           ACBKID    IFNE U#BKID
     C                     GOTO DTLEND
     C                     ENDIF
     C*
     C                     CLEARRARDLOD
     C                     MOVE *BLANK    D#CUM2
     C                     MOVE '1'       ADCUM1
     C                     MOVEL'75280209'D#MUI2           狥葵参絪
     C           AMCUNO    CHAINCBREC                41
     C                     MOVELCBMUID    D#MUI3           禦絪腹
     C                     MOVELAMINNO    D#INNO           祇布腹絏
     C                     MOVE 'TWD'     D#PRCE           刽
     C                     MOVE *ALL'0'   D#DAMT           祇布肂
     C                     MOVE AMDAMT    D#DAMT           祇布肂
     C                     MOVE '.'       D#DOT2           计翴
     C                     MOVE *ALL'0'   D#ZER2           计肂
     C*
     C           19110000  ADD  AMINDT    W#DATE  80       祇布ら戳
     C                     MOVE W#DATE    D#DATE           祇布ら戳
     C                     MOVE D#YY      D#INYR
     C                     MOVE '/'       D#DAS1
     C                     MOVE D#MM      D#INMN
     C                     MOVE '/'       D#DAS2
     C                     MOVE D#DD      D#INDT
     C*
     C           19110000  ADD  AMDUDT    W#DATE           祇布ら戳
     C                     MOVE W#DATE    D#DATE           祇布ら戳
     C                     MOVE D#YY      D#DUYR
     C                     MOVE '/'       D#DAS3
     C                     MOVE D#MM      D#DUMN
     C                     MOVE '/'       D#DAS4
     C                     MOVE D#DD      D#DUDT
     C*
     C                     MOVE D#CUM2    ADCUM2
     C                     WRITERARDLOD
     C*
     C                     ADD  1         W#CONT  40
     C                     ADD  AMDAMT    W#TAMT 120
     C*
     C                     MOVE 'Y'       AMDLC1           ┯潦更絏
     C                     MOVE UDATE     AMDLD1           ┯潦ら戳
     C                     MOVE U#USER    AMDLM1           更
     C                     UPDATRARINVM
     C           DTLEND    ENDSR
     C*
     CSR         LRSR      BEGSR
     C           W#CONT    IFNE 0
     C                     CLEARRARDLOD
     C                     MOVE *BLANK    D#CUM1
     C                     MOVE '0'       ADCUM1
     C                     MOVEL'75280209'D#MUI1           狥葵参絪
     C                     MOVE *ALL'0'   D#CONT           祇布眎计
     C                     MOVE W#CONT    D#CONT           祇布眎计
     C                     MOVE *ALL'0'   D#SAMT           祇布肂
     C                     MOVE W#TAMT    D#SAMT           祇布肂
     C                     MOVE '.'       D#DOT1           计翴
     C                     MOVE *ALL'0'   D#ZER1           计肂
     C                     MOVELD#CUM1    ADCUM2
     C                     WRITERARDLOD
     C                     ENDIF
     C*
     C                     ENDSR
