     H        1   Y                                     1                 BR003
     FINVDTLP UP  E                    DISK
     I            DS
9008 I                                        1   9 IVORNO
     I                                        1   1 ORNO
     C*----------------------------------------------------
     C*          ORNO      IFEQ 'H'
     C                     DELETIVREC
     C*                    ENDIF
