     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP093R
     H*            2.PROGRAM-TYPE  RPG
     H*            3.AUTHOR        S02LYW
     H*            4.FUNCTION     轉暫收手切傳票傳輸->台北抓廠區
     H*            5.DATE-WRITTEN  91/10/04
     H*
     H*****************************************************************
     H            Y                                     1                 BR100
     FAR2159TXIP  E           K        DISK
     FAR2159T UF  E           K        DISK
     F             RAR2159T                         KRENAMERAR2159A
     IRAR2159A    01
     I              ARTRFL                          AATRFL
     I              ARFLAG                          AAFLAG
     I              ARYMD                           AAYMD
     I              ARAREA                          AAAREA
     I              ARCUNO                          AACUNO
     I              ARCUNM                          AACUNM
     I              ARVUNO                          AAVUNO
     I              ARITEM                          AAITEM
     I              ARACDC                          AAACDC
     I              ARAMT                           AAAMT
     I*
     F             RAR2159T                         KRENAMERAR2159B
     IRAR2159B    01
     I              ARTRFL                          ABTRFL
     I              ARFLAG                          ABFLAG
     I              ARYMD                           ABYMD
     I              ARAREA                          ABAREA
     I              ARCUNO                          ABCUNO
     I              ARCUNM                          ABCUNM
     I              ARVUNO                          ABVUNO
     I              ARITEM                          ABITEM
     I              ARACDC                          ABACDC
     I              ARAMT                           ABAMT
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C   01                EXSR DTLSR
     C                     RETRN
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C*-----處理AR2159T資料-----
     C           K#2159    KLIST
     C                     KFLD           AAYMD
     C                     KFLD           AAVUNO
     C                     KFLD           AAITEM
     C                     KFLD           AACUNO
     C*
     C           K#2159    CHAINRAR2159T             40
     C*
     C                     MOVELAATRFL    ARTRFL           傳輸碼
     C                     MOVELAAFLAG    ARFLAG           處理代碼
     C                     Z-ADDAAYMD     ARYMD            資料日期
     C                     MOVELAAAREA    ARAREA           廠區別
     C                     MOVELAACUNO    ARCUNO           客戶編號
     C                     MOVELAACUNM    ARCUNM           客戶名稱
     C                     MOVELAAVUNO    ARVUNO           傳票號碼
     C                     Z-ADDAAITEM    ARITEM           資料項次
     C                     MOVELAAACDC    ARACDC           借貸別
     C                     Z-ADDAAAMT     ARAMT            傳票金額
     C*
     C   40                WRITERAR2159T
     C  N40                UPDATRAR2159T
     C*
     C*-----處理AR2159切傳票金額-----
     C*已兌現、切傳票金額不等於繳貨款金額＝＞已兌現－繳貨款＋切傳票
     C*保留金額3 (ARAMT6)存放客戶現金餘額
     C                     MOVEL'Y'       ARFLAG           處理代碼
     C*
     C           ARAMT2    IFGE ARAMT1                     貨款較多
     C           ARAMT2    SUB  ARAMT1    W#AMT  100       減已兌現
     C           W#AMT     SUB  ARAMT     ARAMT6           減切傳票
     C                     Z-ADD0         ARAMT1
     C                     ELSE                            現金較多
     C           ARAMT1    SUB  ARAMT2    W#AMT            減繳貨款
     C           W#AMT     ADD  ARAMT     ARAMT6           加切傳票
     C                     Z-ADD0         ARAMT2
     C                     ENDIF
     C*
     C   40                WRITERAR2159T
     C  N40                UPDATRAR2159T
     C*
     C* -----UPDTE廠區傳輸碼與處理代碼-----
     C                     MOVE 'Y'       ARTRFL            傳輸碼
     C                     MOVE 'Y'       ARFLAG            處理代碼
     C*
     C   40                WRITERAR2159T
     C  N40                UPDATRAR2159T
     C*
     C                     ENDSR
