     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP092R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LYW
     H*            4.FUNCTION     作廢發票辦理專案退稅->更新台北資料
     H*            5.DATE-WRITTEN  91/07/22
     H*
     H*****************************************************************
     H            Y                                     1                 BR100
     FARBTAXT IP  E           K        DISK
     FARBTAX  UF  E           K        DISK                      A
     IRARBTAXT    01
     I              AXTRFL                          ATTRFL
     I              AXFLAG                          ATFLAG
     I              AXAREA                          ATAREA
     I              AXYYMM                          ATYYMM
     I              AXCUNO                          ATCUNO
     I              AXCUNM                          ATCUNM
     I              AXORNO                          ATORNO
     I              AXITEM                          ATITEM
     I              AXIVNO                          ATIVNO
     I              AXDLDT                          ATDLDT
     I              AXATTX                          ATATTX
     I              AXCODE                          ATCODE
     I              AXVNNO                          ATVNNO
     I              AXVUNO                          ATVUNO
     I              AXADDM                          ATADDM
     I              AXADDD                          ATADDD
     I              AXADDT                          ATADDT
     I              AXUPDM                          ATUPDM
     I              AXUPDD                          ATUPDD
     I              AXUPDT                          ATUPDT
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           K#BTAX    KLIST
     C                     KFLD           ATAREA
     C                     KFLD           ATORNO
     C                     KFLD           ATYYMM
     C                     KFLD           ATITEM
     C           K#BTAX    CHAINRARBTAX              40
     C                     MOVE ATTRFL    AXTRFL
     C                     MOVE ATFLAG    AXFLAG
     C                     MOVE ATAREA    AXAREA
     C                     Z-ADDATYYMM    AXYYMM
     C                     MOVE ATCUNO    AXCUNO
     C                     MOVE ATCUNM    AXCUNM
     C                     MOVE ATORNO    AXORNO
     C                     Z-ADDATITEM    AXITEM
     C                     MOVE ATIVNO    AXIVNO
     C                     MOVE ATDLDT    AXDLDT
     C                     MOVE ATATTX    AXATTX
     C                     MOVE ATCODE    AXCODE
     C                     MOVE ATVNNO    AXVNNO
     C                     MOVE ATVUNO    AXVUNO
     C                     MOVE ATADDM    AXADDM
     C                     MOVE ATADDD    AXADDD
     C                     MOVE ATADDT    AXADDT
     C                     MOVE ATUPDM    AXUPDM
     C                     MOVE ATUPDD    AXUPDD
     C                     MOVE ATUPDT    AXUPDT
     C*
     C   40                WRITERARBTAX
     C  N40                UPDATRARBTAX
     C*
     C                     ENDSR
