     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP079R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            4.FUNCTION     現金流出入彙總預估(TRNDTL->ARP079F)
     H*            5.DATE-WRITTEN  90/09/29
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARP079F IP  E           K        DISK
     FACACHS  O   E           K        DISK
     IRARP079     01
     I                                              WFDATEL1
     I                                              WFNOTPL1
     I           UDS
     I                                     10011010 U#USID
     C*****************************************************************
     C*         KEY  LIST
     C*****************************************************************
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                MOVE *ON       *IN99
     C   L1                EXSR L1CLR
     C   01                EXSR DTLSR
     CL1 99                EXSR L1SR
     CLR                   RETRN
     C*********************************
     C*  L1CLR       函式
     C*********************************
     CSR         L1CLR     BEGSR
     C                     CLEARRACACHS
     C                     ENDSR
     C*********************************
     C*  DETAIL TIME 函式
     C*********************************
     CSR         DTLSR     BEGSR
     C                     ADD  WFAMT     ASAMT
     C                     ENDSR
     C*********************************
     C*  L1SR        函式
     C*********************************
     CSR         L1SR      BEGSR
     C                     Z-ADDWFDATE    ASDATE           兌現日期
     C                     MOVE WFNOTP    ASFSYS           作業來源
     C                     MOVE '1'       ASCODE           類別
     C                     MOVE '1134'    ASACNO           會計科目
     C                     MOVE U#USID    ASENDM           建檔人員
     C                     MOVE UDATE     ASENDD           建檔日期
     C                     TIME           ASENDT           建檔時間
     C*
     C                     WRITERACACHS
     C*
     C           L1END     ENDSR
