     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP047R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     調整代開傳票還原
     H*            5.DATE-WRITTEN  86/04/20
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FTRNDTL  UF  E           K        DISK
     FTRNDTLW IF  E           K        DISK
     F            TXREC                             KRENAMETXRECW
     FACTRAN  UF  E           K        DISK
     FACTRANW IF  E           K        DISK
     F            RACVOUR                           KRENAMERACVOURW
     I*************************************************************
     I           UDS
     I                                      951 985 S#COMP
     I                                     10111020 S#DEVI
     I                                     10011010 U#USID
     I                                     10211021 U#AREA
     I            DS
     I                                        1   4 ACVRNO
     I                                        1   1 D#VRNO
     C**************************************************************
     C*   程式參數接收區
     C**************************************************************
     C           *ENTRY    PLIST
     C                     PARM           P#CNTT  6
     C                     PARM           P#CNTA  6
     C**************************************************************
     C*   資料搜尋關鍵
     C**************************************************************
     C           K#TX      KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C                     KFLD           TXITEM
     C*
     C           K#AC      KLIST
     C                     KFLD           ACVRNO
     C                     KFLD           ACITEM
     C**************************************************************
     C*   主程式開始
     C**************************************************************
     C                     Z-ADD0         W#CNTT  60
     C                     Z-ADD0         W#CNTA  60
     C*
     C                     EXSR SR1000                     清除銷貨檔
     C                     EXSR SR2000                     刪除傳票檔
     C*
     C                     MOVE W#CNTT    P#CNTT
     C                     MOVE W#CNTA    P#CNTA
     C                     SETON                     LR
     C************************************
     C*  清除銷貨明細之傳票號碼
     C************************************
     CSR         SR1000    BEGSR
     C           *LOVAL    SETLLTXRECW               69
     C  N69                READ TXRECW                   69
     C           *IN69     DOWEQ'0'
     C           K#TX      CHAINTXREC                69
     C                     MOVEL*BLANK    TXVUNO
     C                     UPDATTXREC
     C                     ADD  1         W#CNTT
     C                     READ TXRECW                   69
     C                     ENDDO
     CSR                   ENDSR
     C*
     C************************************
     C*  刪除傳票檔內的相關記錄
     C************************************
     CSR         SR2000    BEGSR
     C           *LOVAL    SETLLRACVOURW             69
     C  N69                READ RACVOURW                 69
     C           *IN69     DOWEQ'0'
     C           K#AC      CHAINRACVOUR              69
     C                     DELETRACVOUR
     C                     ADD  1         W#CNTA
     C                     READ RACVOURW                 69
     C                     ENDDO
     CSR                   ENDSR
     C*
     C**************************************************************
