     H        1   Y                                     1                 BR003
     FARP035S CF  E                    WORKSTN
     FRCVDTL  IF  E           K        DISK
     E*************************************************************
     E                    ERR     1   4 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           RVKEY     KLIST
     C                     KFLD           RVNO
     C                     KFLD           RVITEM
     C*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM WNO       WNOP    6
     C                     PARM WITEM     WITEMP  20
     C                     PARM AREA      WAREA   1
     C**************************************************************
     C                     SETON                     70
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C****
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C           WNO       IFEQ *BLANK
     C                     SETON                     4199
     C                     MOVE ERR,3     ERRMSG
     C                     ELSE
     C           AREA      IFEQ *BLANK
     C                     SETON                     4299
     C                     MOVE ERR,4     ERRMSG
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELWNO       RVNO
     C                     MOVELWITEM     RVITEM
     C           RVKEY     CHAINRCVDTL               33
     C           *IN33     IFEQ '1'
     C                     SETON                     4199
     C                     MOVE ERR,1     ERRMSG
     C                     ELSE
     C           AREA      IFNE RVAREA
     C                     SETON                     4299
     C                     MOVE ERR,2     ERRMSG
     C                     ENDIF
     C                     ENDIF
     C******
     CSR         CK#01Z    ENDSR
     C******
** ERR
查無該筆繳款書．
此繳款書非該地區資料
繳款書編號不可空白
所屬地區不可空白
