     H        1   Y                                     1                 BR003
     FARP013S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   2 70
     I*************************************************************
     IAADS        DS
9008 I                                       21  280DATE
LYW  I                                       21  260DATE1
 .   I                                       27  280DATE2
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
9008 C                     PARM           YMA     6
LYW  C                     PARM           ACYM    6
     C**************************************************************
9008 C                     MOVE UDATE     YM
     C                     MOVELTXAR      AREA
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
9008 C                     MOVE YM        APDT    80
     C                     MOVE 01        APDT
     C*                    CALL 'C01'
     C*                    PARM           APDT
     C*                    PARM ' '       FLAG    1
     C*                    FREE 'C01'
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE APDT      P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM '0'       FLAG    1
     C           FLAG      IFNE '0'
     C                     SETON                     9941
     C                     MOVELERR,1     ERRMSG
     C                     ENDIF
      *
9008 C                     MOVE YM        YMA
     C*          YMA       IFLT ACYM
     C*                    SETON                     9941
     C*                    MOVELERR,2     ERRMSG
     C*                    ENDIF
      *
     CSR         CK#01Z    ENDSR
     C******
** ERR
年月不合邏輯．
該年月會計帳已關帳請查核．
