     H            Y                                     1                 BR100
     FINVDTL  UP  E                    DISK
     F            IVREC                             KRENAMEIVRECD
     FINVDTLP UF  E           K        DISK                      A
     FQPRINT  O   F     198     OV     PRINTER
     IIVRECD      01
     I              IVFLAG                          FLAG
     I              IVNO                            NO
     I              IVACNT                          ACNT
     I              IVITEM                          ITEM
     I              IVACDT                          ACDT
     I              IVORNO                          ORNO
     I              IVPDCD                          PDCD
     I              IVQTY                           QTY
     I              IVUPRC                          UPRC
     I              IVAMT                           AMT
     I              IVDECD                          DECD
     I              IVDEDT                          DEDT
     I              IVAPNO                          APNO
     I              IVACNO                          ACNO
     I              IVFL01                          FL01
     I              IVFL02                          FL02
     I              IVFL03                          FL03
     I              IVTXAR                          TXAR
     I              IVTXDT                          TXDT
     I              IVRESV                          RESV
     I           UDS
     I                                       21  21 FAC
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           ACNT
     C                     KFLD           ITEM
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINIVREC                31
     C                     MOVE FLAG      IVFLAG
     C                     MOVE NO        IVNO
     C                     MOVE ACNT      IVACNT
     C                     Z-ADDITEM      IVITEM
     C                     MOVE NO        IVNO
     C                     Z-ADDACDT      IVACDT
9008 C                     MOVELORNO      IVORNO
     C                     MOVE PDCD      IVPDCD
     C                     Z-ADDQTY       IVQTY
     C                     Z-ADDUPRC      IVUPRC
     C                     Z-ADDAMT       IVAMT
     C                     MOVE DECD      IVDECD
     C                     Z-ADDDEDT      IVDEDT
     C                     MOVE APNO      IVAPNO
     C                     MOVE ACNO      IVACNO
     C                     MOVE FL01      IVFL01
     C                     MOVE FL02      IVFL02
     C                     MOVE FL03      IVFL03
     C                     MOVE TXAR      IVTXAR
     C                     Z-ADDTXDT      IVTXDT
     C                     MOVE RESV      IVRESV
     C   31                WRITEIVREC
     C  N31                UPDATIVREC
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     OIVRECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
     C*--------------------------------------------------------------
     OQPRINT  H  103   1P
     O       OR        OV
     O                                   15 'RPT.ID: AR022'
     O                                  110 '東和鋼鐵股份有限公司'           X
     O                                  180 '印表日期'
     O                                  181 ':'
     O                         UDATE Y  194
     O        H  1     1P
     O       OR        OV
     O                                    9 'FROM :'
     O                         FAC     +  1
     O                                  110 '發票明細傳輸核對清單'
     O                                  180 '頁　　數'
     O                                  181 ':'
     O                         PAGE     194
     O        H 11     1P
     O       OR        OV
     O                                   11 '處理代碼'
     O                                 +  1 '發票號碼'
     O                                 +  1 '類別'
     O                                 +  1 '項次'
     O                                   47 '入帳日期'
     O                                   58 '訂單號碼'
     O                                   69 '品名代號'
     O                                   78 '數　量'
     O                                   87 '單　價'
     O                                   98 '金　　額'
     O                                  107 '作廢碼'
     O                                  118 '作廢日期'
     O                                  129 '憑證編號'
     O                                  140 '傳票編號'
     O                                  151 '過訂單碼'
     O                                  162 '過發票碼'
     O                                  171 '類別碼'
     O                                  182 '異動廠區'
     O                                  193 '異動日期'
     O        H  1     1P
     O       OR        OV
     O                                   21 '===================='
     O                                   41 '===================='
     O                                   61 '===================='
     O                                   81 '===================='
     O                                  101 '===================='
     O                                  121 '===================='
     O                                  141 '===================='
     O                                  161 '===================='
     O                                  181 '===================='
     O                                  195 '=============='
     O        D  1     01
     O                         IVFLAG     6
     O                         IVNO      21
     O                         IVACNT    28
     O                         IVITEM3   35
     O                         IVACDTY   46
     O                         IVORNO    57
     O                         IVPDCD    68
     O                         IVQTY 4   77
     O                         IVUPRC4   86
     O                         IVAMT 4   97
     O                         IVDECD   106
     O                         IVDEDTY  117
     O                         IVAPNO   128
     O                         IVACNO   139
     O                         IVFL01   150
     O                         IVFL02   161
     O                         IVFL03   170
     O                         IVTXAR   181
     O                         IVTXDTY  192
     O        D  1     01
