     H            Y                                     1                 BR100
     FARCVDT  UP  E           K        DISK
     FARCVDTW UF  E           K        DISK                      A
     IRARCVDT     01
     I           UDS
     I                                      301 301 U#AREA
     C   01                EXSR DTLSR
     CLR                   RETRN
     CSR         DTLSR     BEGSR
     C           K#CVDT    KLIST
     C                     KFLD           AWINNO
     C                     KFLD           AWITEM
     C*
     C                     MOVE ATINNO    AWINNO
     C                     MOVE ATITEM    AWITEM
     C           K#CVDT    CHAINRARCVDTW             40
     C                     MOVE ATFLAG    AWFLAG
     C                     MOVE ATDELD    AWDELD
     C                     MOVE ATINNO    AWINNO
     C                     Z-ADDATITEM    AWITEM
     C                     Z-ADDATCVDT    AWCVDT
     C                     Z-ADDATCAMT    AWCAMT
     C                     MOVE ATRLN1    AWRLN1
     C                     MOVE ATRLN2    AWRLN2
     C                     MOVE ATUPDM    AWUPDM
     C                     Z-ADDATUPDD    AWUPDD
     C                     Z-ADDATUPDT    AWUPDT
     C                     MOVE ATDLC1    AWDLC1
     C                     MOVE ATDLM1    AWDLM1
     C                     Z-ADDATDLD1    AWDLD1
     C                     MOVE ATBHID    AWBHID
     C   40                WRITERARCVDTW
     C  N40                UPDATRARCVDTW
     C*
     C                     MOVE *BLANK    ATFLAG
     C                     UPDATRARCVDT
     C                     ENDSR
