     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP064R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     客戶訂單管制資料異動
     H*            5.DATE-WRITTEN  88/10/28
     H*
     H* 說明：依ARCUCTP內的資料來異動ARCUCT
     H* 說明：依ARODCTP內的資料來異動ARODCT
     H*
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARCUCTP IF  E           K        DISK
     F            RARCUCT                           KRENAMERARCW
     FARCUCT  UF  E           K        DISK                      A
     F*
     FARODCTP IF  E           K        DISK
     F            RARODCT                           KRENAMERAROW
     FARODCT  UF  E           K        DISK                      A
     F*****************************************************************
     IRARCW       01
     I              A1FLAG                          AXFLAG
     I              A1CUNO                          AXCUNO
     I              A1CTKD                          AXCTKD
     I              A1RFOR                          AXRFOR
     I              A1MTHD                          AXMTHD
     I              A1TYP1                          AXTYP1
     I              A1RAT1                          AXRAT1
     I              A1TYP2                          AXTYP2
     I              A1RAT2                          AXRAT2
     I              A1TYP3                          AXTYP3
     I              A1RAT3                          AXRAT3
     I*------------------------------------------------------
     IRAROW       01
     I              A2FLAG                          AWFLAG
     I              A2ORNO                          AWORNO
     I              A2CTKD                          AWCTKD
     I              A2MTHD                          AWMTHD
     I              A2TYP1                          AWTYP1
     I              A2RAT1                          AWRAT1
     I              A2TYP2                          AWTYP2
     I              A2RAT2                          AWRAT2
     I              A2TYP3                          AWTYP3
     I              A2RAT3                          AWRAT3
     I*------------------------------------------------------
     I           UDS
     I                                        1   1 U#FLAG
     I                                     10011010 U#USID
     I                                     10011003 U#DPID
     C*****************************************************************
     C*        搜尋關鍵區
     C*****************************************************************
     C           K#A1      KLIST
     C                     KFLD           AXCUNO
     C                     KFLD           AXCTKD
     C*
     C           K#A2      KLIST
     C                     KFLD           AWORNO
     C                     KFLD           AWCTKD
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C           *LOVAL    SETLLRARCW                      客戶管控
     C           1         DOWEQ1
     C                     READ RARCW                    69
     C           *IN69     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C*
     C           K#A1      CHAINRARCUCT              69
     C           AXFLAG    IFEQ 'D'                        刪除
     C  N69                DELETRARCUCT
     C                     ELSE                            修改
     C                     EXSR SR1000                     搬移變數
     C  N69                UPDATRARCUCT                    修改
     C   69                WRITERARCUCT                    新增
     C                     ENDIF
     C                     ENDDO
     C*
     C*
     C           *LOVAL    SETLLRAROW                      訂單管控
     C           1         DOWEQ1
     C                     READ RAROW                    69
     C           *IN69     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C*
     C           K#A2      CHAINRARODCT              69
     C           AWFLAG    IFEQ 'D'                        刪除
     C  N69                DELETRARODCT
     C                     ELSE                            修改
     C                     EXSR SR2000                     搬移變數
     C  N69                UPDATRARODCT                    修改
     C   69                WRITERARODCT                    新增
     C                     ENDIF
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*--------------------------------
     C*  公用子函式（搬移變數）
     C*--------------------------------
     CSR         SR1000    BEGSR
     C                     MOVEL*BLANK    A1FLAG
     C                     MOVELAXCUNO    A1CUNO
     C                     MOVELAXCTKD    A1CTKD
     C                     MOVELAXRFOR    A1RFOR
     C                     MOVELAXMTHD    A1MTHD
     C                     Z-ADDAXTYP1    A1TYP1
     C                     Z-ADDAXRAT1    A1RAT1
     C                     Z-ADDAXTYP2    A1TYP2
     C                     Z-ADDAXRAT2    A1RAT2
     C                     Z-ADDAXTYP3    A1TYP3
     C                     Z-ADDAXRAT3    A1RAT3
     CSR                   ENDSR
     C*
     C*--------------------------------
     C*  公用子函式（搬移變數）
     C*--------------------------------
     CSR         SR2000    BEGSR
     C                     MOVEL*BLANK    A2FLAG
     C                     MOVELAWORNO    A2ORNO
     C                     MOVELAWCTKD    A2CTKD
     C                     MOVELAWMTHD    A2MTHD
     C                     Z-ADDAWTYP1    A2TYP1
     C                     Z-ADDAWRAT1    A2RAT1
     C                     Z-ADDAWTYP2    A2TYP2
     C                     Z-ADDAWRAT2    A2RAT2
     C                     Z-ADDAWTYP3    A2TYP3
     C                     Z-ADDAWRAT3    A2RAT3
     CSR                   ENDSR
     C****************************************************************
     C*
