     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP136RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INENBU電子發票空白字軌傳輸
     A*            5.DATE-WRITTEN  107/07/04 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     FINENBU  UP  E                    DISK
     F            RINENBU                           KRENAMENBUECD
     FINENBUP UF  E           K        DISK                      A
     INBUECD      01
     I              NUFLAG                          FLAG
     I              NUMSTE                          MSTE
     I              NUHEBN                          HEBN
     I              NUBRBN                          BRBN
     I              NUINTE                          INTE
     I              NUYEMH                          YEMH
     I              NUINTK                          INTK
     I              NUINBN                          INBN
     I              NUINEN                          INEN
     I              NUFACT                          FACT
     I              NUYYMM                          YYMM
     I              NUKIND                          KIND
     I              NUTMDT                          TMDT
     I              NUTMTM                          TMTM
     I              NUTMOP                          TMOP
     I              NUTAWS                          TAWS
     I              NUSTCL                          STCL
     I              NUXPDD                          XPDD
     I              NUXPDT                          XPDT
     I              NUXUSR                          XUSR
     I              NUMAR1                          MAR1
     I              NUPTYN                          PTYN
     C*
     C           KEY       KLIST
     C                     KFLD           FACT
     C                     KFLD           YYMM
     C                     KFLD           KIND
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINENBU              31
     C                     MOVELFLAG      NUFLAG
     C                     MOVELMSTE      NUMSTE
     C                     MOVELHEBN      NUHEBN
     C                     MOVELBRBN      NUBRBN
     C                     MOVELINTE      NUINTE
     C                     MOVELYEMH      NUYEMH
     C                     MOVELINTK      NUINTK
     C                     MOVELINBN      NUINBN
     C                     MOVELINEN      NUINEN
     C                     MOVELFACT      NUFACT
     C                     MOVELYYMM      NUYYMM
     C                     MOVELKIND      NUKIND
     C                     Z-ADDTMDT      NUTMDT
     C                     Z-ADDTMTM      NUTMTM
     C                     MOVELTMOP      NUTMOP
     C                     MOVELTAWS      NUTAWS
     C                     MOVELSTCL      NUSTCL
     C                     Z-ADDXPDD      NUXPDD
     C                     Z-ADDXPDT      NUXPDT
     C                     MOVELXUSR      NUXUSR
     C                     MOVELMAR1      NUMAR1
     C                     MOVELPTYN      NUPTYN
     C*
     C   31                WRITERINENBU
     C  N31                UPDATRINENBU
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     ONBUECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
