     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP139RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     台北INEDIN-->INEDINT
     A*            5.DATE-WRITTEN  107/12/07 2018AR00031
     A*            6.UPDATE  DATE  108/05/09 S00WCJ (0805A)
     A*                            增加寫入電子發票介面LOG異動資訊
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINEDIN  UP  E           K        DISK
     F            RINEDIN                           KRENAMEDINECD
     FINEDINT UF  E           K        DISK                      A
     FINEDING O   E           K        DISK
     F            RINEDIN                           KRENAMEDING
     IDINECD      01
     I              DNFLAG                          FLAG
     I              DNAREA                          AREA
     I              DNMSTE                          MSTE
     I              DNNO                            NO
     I              DNINDT                          INDT
     I              DNBYID                          BYID
     I              DNSLID                          SLID
     I              DNDEDT                          DEDT
     I              DNDETM                          DETM
     I              DNCLRN                          CLRN
     I              DNRTDN                          RTDN
     I              DNREMK                          REMK
     I              DNTMDT                          TMDT
     I              DNTMTM                          TMTM
     I              DNTMOP                          TMOP
     I              DNTAWS                          TAWS
     I              DNSTCL                          STCL
     I              DNXPDD                          XPDD
     I              DNXPDT                          XPDT
     I              DNXUSR                          XUSR
     I              DNMAR1                          MAR1
     I              DNPTYN                          PTYN
     I*
0805AI           UDS
0805AI                                     10011010 U#USID
     C           KEY       KLIST
     C                     KFLD           NO
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           STCL      IFNE ' '
     C           KEY       CHAINRINEDIN              32
     C                     EXSR MOVE1
     C           *IN32     IFEQ '1'
     C           AREA      IFEQ 'U'
     C           AREA      OREQ 'H'
     C           AREA      OREQ 'K'
     C                     WRITERINEDIN
     C                     MOVEL'ARP139RA'DNAPNM
0805AC           *DATE     SUB  19000000  DNCHDD
0805AC                     TIME           DNCHDT
0805AC                     MOVELU#USID    DNCUSR
     C                     WRITEDING
     C                     END
     C                     END
     C*
     C           *IN32     IFEQ '0'
     C           AREA      IFEQ 'U'
     C           AREA      OREQ 'H'
     C           AREA      OREQ 'K'
     C                     UPDATRINEDIN
     C                     MOVEL'ARP139RA'DNAPNM
0805AC           *DATE     SUB  19000000  DNCHDD
0805AC                     TIME           DNCHDT
0805AC                     MOVELU#USID    DNCUSR
     C                     WRITEDING
     C                     END
     C                     END
     C                     ENDIF
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVE ' '       FLAG
     C                     UPDATDINECD
     C                     END
     C           *IN13     IFEQ '1'
     C                     DELETDINECD
     C                     END
     C**************************************************************
     C           MOVE1     BEGSR
     C                     MOVELFLAG      DNFLAG
     C                     MOVELAREA      DNAREA
     C                     MOVELMSTE      DNMSTE
     C                     MOVELNO        DNNO
     C                     MOVELINDT      DNINDT
     C                     MOVELBYID      DNBYID
     C                     MOVELSLID      DNSLID
     C                     MOVELDEDT      DNDEDT
     C                     MOVELDETM      DNDETM
     C                     MOVELCLRN      DNCLRN
     C                     MOVELRTDN      DNRTDN
     C                     MOVELREMK      DNREMK
     C                     Z-ADDTMDT      DNTMDT
     C                     Z-ADDTMTM      DNTMTM
     C                     MOVELTMOP      DNTMOP
     C                     MOVELTAWS      DNTAWS
     C                     MOVELSTCL      DNSTCL
     C                     Z-ADDXPDD      DNXPDD
     C                     Z-ADDXPDT      DNXPDT
     C                     MOVELXUSR      DNXUSR
     C                     MOVELMAR1      DNMAR1
     C                     MOVELPTYN      DNPTYN
     C                     ENDSR
