     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP104R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     修正TRNDTL銷貨類(SA04)項次
     H*            5.DATE-WRITTEN  92/09/09
     H*            6.DATE-MODIFY
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FTRNDTL  UP  E           K        DISK
     FARP104F O   E           K        DISK
     ITXREC
     I                                              TXNO  L1
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C  N99                EXSR INISR
     C   L1                EXSR L1CLR
     C                     EXSR DTLSR
     CL1 99                EXSR L1SR
     CLR 99                EXSR LRSR
     CLR                   RETRN
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     MOVE *ON       *IN99
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1CLR     BEGSR
     C*****************************************************************
     C                     Z-ADD1         W#CONT  20
     C*
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C*WRITE TO ARP104F
     C                     MOVELTXCODE    A4CODE
     C                     MOVELTXNO      A4NO
     C                     Z-ADDTXITEM    A4ITEM
     C                     Z-ADDTXDATE    A4DATE
     C                     Z-ADDTXACDT    A4ACDT
     C                     MOVELTXCUNO    A4CUNO
     C                     MOVELTXCUNM    A4CUNM
     C                     MOVELTXORNO    A4ORNO
     C                     MOVELTXIVNO    A4IVNO
     C                     MOVELTXPCNO    A4PCNO
     C                     MOVELTXVUNO    A4VUNO
     C                     MOVELTXRVID    A4RVID
     C                     MOVELTXSALE    A4SALE
     C                     MOVELTXSATP    A4SATP
     C                     MOVELTXPDNM    A4PDNM
     C                     Z-ADDTXQTY     A4QTY
     C                     Z-ADDTXUPRC    A4UPRC
     C                     Z-ADDTXAMT     A4AMT
     C                     Z-ADDTXTAX     A4TAX
     C                     MOVELTXFL01    A4FL01
     C                     MOVELTXFL02    A4FL02
     C                     MOVELTXRESV    A4RESV
     C                     WRITERARP104F
     C*UPDATE TRDNTL
     C                     Z-ADDW#CONT    TXITEM
     C                     UPDATTXREC
     C*項次加一
     C                     ADD  1         W#CONT
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1SR      BEGSR
     C*****************************************************************
     C*
     C                     ENDSR
     C*****************************************************************
     C           LRSR      BEGSR
     C*****************************************************************
     C*
     C                     ENDSR
