     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP133RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INEMST電子發票主檔傳輸
     A*            5.DATE-WRITTEN  107/07/02 2018AR1162
     A*            6.UPDATE  DATE  107/10/29 2018AR00025 S00WCJ (0710A)
     A*                            增加發票防偽隨機碼欄位
     A*
     A*
     A*****************************************************************
     FINEMST  UP  E                    DISK
     F            RINEMST                           KRENAMEMSTECD
     FINEMSTP UF  E           K        DISK                      A
     IMSTECD      01
     I              EMFLAG                          FLAG
     I              EMAREA                          AREA
     I              EMMSTE                          MSTE
     I              EMNO                            NO
     I              EMINDT                          INDT
     I              EMINTT                          INTT
     I              EMSLID                          SLID
     I              EMSLNM                          SLNM
     I              EMSLAS                          SLAS
     I              EMSLPE                          SLPE
     I              EMSLTL                          SLTL
     I              EMSLFC                          SLFC
     I              EMSLML                          SLML
     I              EMSLNO                          SLNO
     I              EMSLRK                          SLRK
     I              EMBYID                          BYID
     I              EMBYNM                          BYNM
     I              EMBYAS                          BYAS
     I              EMBYPE                          BYPE
     I              EMBYTL                          BYTL
     I              EMBYFC                          BYFC
     I              EMBYML                          BYML
     I              EMBYNO                          BYNO
     I              EMBYRK                          BYRK
     I              EMCKNR                          CKNR
     I              EMBURK                          BURK
     I              EMMARK                          MARK
     I              EMCUMK                          CUMK
     I              EMCTEY                          CTEY
     I              EMRLNR                          RLNR
     I              EMINTE                          INTE
     I              EMGRMK                          GRMK
     I              EMDNMK                          DNMK
     I              EMBDCD                          BDCD
     I              EMSAMT                          SAMT
     I              EMTXTP                          TXTP
     I              EMTXRT                          TXRT
     I              EMATAX                          ATAX
     I              EMAAMT                          AAMT
     I              EMDSAT                          DSAT
     I              EMOCAT                          OCAT
     I              EMEXAT                          EXAT
     I              EMCRRY                          CRRY
     I              EMTMDT                          TMDT
     I              EMTMTM                          TMTM
     I              EMTMOP                          TMOP
     I              EMTAWS                          TAWS
     I              EMSTCL                          STCL
     I              EMXPDD                          XPDD
     I              EMXPDT                          XPDT
     I              EMXUSR                          XUSR
     I              EMMAR1                          MAR1
     I              EMPTYN                          PTYN
0710AI              EMRADN                          RADN
     C*
     C           KEY       KLIST
     C                     KFLD           NO
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINEMST              31
     C                     MOVELFLAG      EMFLAG
     C                     MOVELAREA      EMAREA
     C                     MOVELMSTE      EMMSTE
     C                     MOVELNO        EMNO
     C                     MOVELINDT      EMINDT
     C                     MOVELINTT      EMINTT
     C                     MOVELSLID      EMSLID
     C                     MOVELSLNM      EMSLNM
     C                     MOVELSLAS      EMSLAS
     C                     MOVELSLPE      EMSLPE
     C                     MOVELSLTL      EMSLTL
     C                     MOVELSLFC      EMSLFC
     C                     MOVELSLML      EMSLML
     C                     MOVELSLNO      EMSLNO
     C                     MOVELSLRK      EMSLRK
     C                     MOVELBYID      EMBYID
     C                     MOVELBYNM      EMBYNM
     C                     MOVELBYAS      EMBYAS
     C                     MOVELBYPE      EMBYPE
     C                     MOVELBYTL      EMBYTL
     C                     MOVELBYFC      EMBYFC
     C                     MOVELBYML      EMBYML
     C                     MOVELBYNO      EMBYNO
     C                     MOVELBYRK      EMBYRK
     C                     MOVELCKNR      EMCKNR
     C                     MOVELBURK      EMBURK
     C                     MOVELMARK      EMMARK
     C                     MOVELCUMK      EMCUMK
     C                     MOVELCTEY      EMCTEY
     C                     MOVELRLNR      EMRLNR
     C                     MOVELINTE      EMINTE
     C                     MOVELGRMK      EMGRMK
     C                     MOVELDNMK      EMDNMK
     C                     MOVELBDCD      EMBDCD
     C                     Z-ADDSAMT      EMSAMT
     C                     MOVELTXTP      EMTXTP
     C                     Z-ADDTXRT      EMTXRT
     C                     Z-ADDATAX      EMATAX
     C                     Z-ADDAAMT      EMAAMT
     C                     Z-ADDDSAT      EMDSAT
     C                     Z-ADDOCAT      EMOCAT
     C                     Z-ADDEXAT      EMEXAT
     C                     MOVELCRRY      EMCRRY
     C                     Z-ADDTMDT      EMTMDT
     C                     Z-ADDTMTM      EMTMTM
     C                     MOVELTMOP      EMTMOP
     C                     MOVELTAWS      EMTAWS
     C                     MOVELSTCL      EMSTCL
     C                     Z-ADDXPDD      EMXPDD
     C                     Z-ADDXPDT      EMXPDT
     C                     MOVELXUSR      EMXUSR
     C                     MOVELMAR1      EMMAR1
     C                     MOVELPTYN      EMPTYN
0710AC                     MOVELRADN      EMRADN
     C*
     C   31                WRITERINEMST
     C  N31                UPDATRINEMST
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     OMSTECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
