     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP110R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     電子商務--發票與銷貨資料重新下載處理
     H*            5.DATE-WRITTEN  93/09/02
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     H        1   Y                                     1
     FINDLOG  IP  E           K        DISK
     FARIVDW  UF  E           K        DISK                      A
     IRINDLOG     01
     C*****************************************************************
     C*          KEY   LIST
     C*****************************************************************
     C*FILE==>ARIVDW
     C           K#IVDW    KLIST
     C                     KFLD           AVVNNO
     C                     KFLD           AVFILE
     C                     KFLD           AVSEQN
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C  N99                EXSR INISR
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     MOVE *ON       *IN99
     C*
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     MOVELIDVNNO    AVVNNO
     C                     MOVELIDFILE    AVFILE
     C                     Z-ADDIDSEQN    AVSEQN
     C           K#IVDW    CHAINRARIVDW              40
     C                     MOVELIDFLAG    AVFLAG
     C                     MOVELIDNO      AVNO
     C                     MOVELIDACNT    AVACNT
     C                     Z-ADDIDITEM    AVITEM
     C                     Z-ADDIDACDT    AVACDT
     C                     MOVELIDORNO    AVORNO
     C                     MOVELIDPDCD    AVPDCD
     C                     Z-ADDIDQTY     AVQTY
     C                     Z-ADDIDUPRC    AVUPRC
     C                     Z-ADDIDAMT     AVAMT
     C                     MOVELIDDECD    AVDECD
     C                     Z-ADDIDDEDT    AVDEDT
     C                     Z-ADDIDSEQN    AVSEQN
     C                     Z-ADDIDFILE    AVFILE
     C                     MOVELIDVNNO    AVVNNO
     C   40                WRITERARIVDW
     C  N40                UPDATRARIVDW
     C*
     C                     ENDSR
