     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP102R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     銷貨利息計算
     H*            5.DATE-WRITTEN  92/04/14
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     H        1   Y                                     1
     FARP101F4IP  E           K        DISK
     FARP101F5UF  E           K        DISK                      A
     IRAR101F4
     I                                              A4YM2 L1
     I                                              A4ORNOL1
     I                                              A4PDNML1
     C*****************************************************************
     C*          KEY   LIST
     C*****************************************************************
     C*FILE==>ARP101F5
     C           W#ARP5    KLIST
     C                     KFLD           A5YM2
     C                     KFLD           A5ORNO
     C                     KFLD           A5PDNM
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C  N99                EXSR INISR
     C   L1                EXSR L1CLR
     C                     EXSR DTLSR
     CL1 99                EXSR L1SR
     CLR 99                EXSR LRSR
     CLR                   RETRN
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     MOVE *ON       *IN99
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1CLR     BEGSR
     C*****************************************************************
     C                     CLEARRAR101F5
     C                     Z-ADD0         W#RAMT 110
     C*
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           A4RAMT    IFNE 0
     C                     ADD  A4RAMT    W#RAMT
     C                     ENDIF
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1SR      BEGSR
     C*****************************************************************
     C           W#RAMT    IFNE 0
     C                     Z-ADDA4YM2     A5YM2
     C                     MOVELA4ORNO    A5ORNO
     C                     MOVELA4PDNM    A5PDNM
     C           W#ARP5    CHAINRAR101F5             40
     C*                    Z-ADDA4YM1     A5YM1            銷貨年月
     C                     Z-ADDA4YM2     A5YM2            利息年月
     C                     MOVELA4CUNO    A5CUNO           客戶代號
     C                     MOVELA4CUNM    A5CUNM           客戶名稱
     C                     MOVELA4ORNO    A5ORNO           訂單編號
     C                     MOVELA4PDNM    A5PDNM           品名
     C                     Z-ADDW#RAMT    A5RAMT           利息
     C*
     C   40                WRITERAR101F5
     C  N40                UPDATRAR101F5
     C                     ENDIF
     C*
     C                     ENDSR
     C*****************************************************************
     C           LRSR      BEGSR
     C*****************************************************************
     C*
     C                     ENDSR
