     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP112RFA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     營業退款檔製票資料傳輸作業
     H*            5.DATE-WRITTEN  93/11/08
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     FARRETNX IP  E           K        DISK
     FARRETN  UF  E           K        DISK
     IRARRETX     01
     I*
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*         KEY    LIST
     C*****************************************************************
     C           K#ARTN    KLIST
     C                     KFLD           ANRTNO
     C                     KFLD           ANITEM
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     C*****************************************************************
     CSR         INISR     BEGSR
     C*****************************************************************
     C  N99                SETON                     99
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           AXFLAG    COMP 'C'                      12
     C*
     C                     MOVELAXRTNO    ANRTNO
     C                     MOVELAXITEM    ANITEM
     C           K#ARTN    CHAINRARRETN              40
     C                     MOVELAXFL03    ANFL03           過入製票碼
     C                     MOVELAXTRUS    ANTRUS           過入人員
     C                     Z-ADDAXTRDT    ANTRDT           過入日期
     C                     MOVELAXGLNO    ANGLNO           製票號碼
     C*
     C           *IN40     IFEQ *OFF                       已存在
     C           *IN12     ANDEQ'0'
     C                     UPDATRARRETN
     C                     ENDIF
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         LRSR      BEGSR
     C*****************************************************************
     C*
     CSR                   ENDSR
     C*****************************************************************
