     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP113RB
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     發票作廢記錄主檔傳輸作業－抓廠區
     H*            5.DATE-WRITTEN  94/01/04
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     FDELMSTX IP  E           K        DISK
     FDELMST  UF  E           K        DISK                      A
     IRDELMSTX    01
     I*
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     C*****************************************************************
     CSR         INISR     BEGSR
     C*****************************************************************
     C  N99                SETON                     99
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           DXFLAG    COMP 'A'                      11
     C           DXFLAG    COMP 'C'                      12
     C           DXFLAG    COMP 'D'                      13
     C*
     C           DXINNO    CHAINRDELMST              40
     C*
     C                     MOVELDXFLAG    DMFLAG           處理代碼
     C                     MOVELDXINNO    DMINNO           發票號碼
     C                     Z-ADDDXINDT    DMINDT           發票日期
     C                     MOVELDXAREA    DMAREA           廠區
     C                     MOVELDXDECD    DMDECD           作廢碼
     C                     Z-ADDDXDEDT    DMDEDT           作廢日期
     C                     MOVELDXCUN1    DMCUN1           原客戶代號
     C                     MOVELDXCUM1    DMCUM1           原客戶名稱
     C                     MOVELDXORN1    DMORN1           原訂單編號
     C                     Z-ADDDXAAMT    DMAAMT           原出貨金額
     C                     Z-ADDDXATAX    DMATAX           原出貨稅額
     C                     Z-ADDDXBAMT    DMBAMT           原扣預收金額
     C                     Z-ADDDXNBAL    DMNBAL           原未收餘額
     C                     MOVELDXCODE    DMCODE           承購發票
     C                     MOVELDXDEPT    DMDEPT           作廢部門
     C                     MOVELDXDLNO    DMDLNO           作廢申請單號
     C                     MOVELDXRVID    DMRVID           作廢申請業務員
     C                     MOVELDXDESP    DMDESP           異常原因說明
     C                     MOVELDXCUN2    DMCUN2           新客戶編號
     C                     MOVELDXCUM2    DMCUM2           新客戶名稱
     C                     MOVELDXORN2    DMORN2           新訂單編號
     C                     MOVELDXAPUS    DMAPUS           申請人員
     C                     Z-ADDDXAPDT    DMAPDT           申請日期
     C                     Z-ADDDXAPTM    DMAPTM           申請時間
     C                     MOVELDXUPUS    DMUPUS           異動人員
     C                     Z-ADDDXUPDT    DMUPDT           異動日期
     C                     Z-ADDDXUPTM    DMUPTM           異動時間
     C                     MOVELDXRESV    DMRESV           保留碼
     C*
     C           *IN40     IFEQ '1'                        不存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     WRITERDELMST
     C                     ENDIF
     C*
     C                     ELSE                            已存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     UPDATRDELMST
     C                     ENDIF
     C           *IN13     IFEQ '1'                        要刪除
     C                     DELETRDELMST
     C                     ENDIF
     C                     ENDIF
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         LRSR      BEGSR
     C*****************************************************************
     C*
     CSR                   ENDSR
     C*****************************************************************
