     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP122R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     折扣折讓磅單分攤檔傳輸作業
     H*            5.DATE-WRITTEN  103/01/22 2014AR796
     H*            6.DATE-MODIFY   104/07/24 S00WCJ (0407A)
     H*****************************************************************
     H            Y                                     1                 BR100
     FARDSDTW UF  E           K        DISK
     F            RARDSDT                           KRENAMERDSDTW
     FARDSDT  UF  E           K        DISK                      A
     IRDSDTW
     I              ASFLAG                          F#FLAG
     I              ASKIND                          F#KIND
     I              ASCUNO                          F#CUNO
     I              ASCUNM                          F#CUNM
     I              ASORNO                          F#ORNO
     I              ASYYMM                          F#YYMM
     I              ASCONT                          F#CONT
     I              ASTYPE                          F#TYPE
     I              ASSALE                          F#SALE
     I              ASAREA                          F#AREA
     I              ASAMT4                          F#AMT4
     I              ASINNO                          F#INNO
     I              ASACNT                          F#ACNT
     I              ASITEM                          F#ITEM
     I              ASINDT                          F#INDT
     I              ASDECD                          F#DECD
     I              ASDEDT                          F#DEDT
     I              ASTXNO                          F#TXNO
     I              ASTXIT                          F#TXIT
     I              ASDATE                          F#DATE
     I              ASPDNM                          F#PDNM
     I              ASQTY1                          F#QTY1
     I              ASPRC1                          F#PRC1
     I              ASAMT1                          F#AMT1
     I              ASKTY2                          F#KTY2
     I              ASKRC2                          F#KRC2
     I              ASKMT2                          F#KMT2
     I              ASDMT1                          F#DMT1
     I              ASDMT2                          F#DMT2
     I              ASDXNO                          F#DXNO
     I              ASUPDM                          F#UPDM
     I              ASUPDD                          F#UPDD
     I              ASUPDT                          F#UPDT
     I              ASRESV                          F#RESV
     C*
     C           K#DSLG    KLIST
     C                     KFLD           F#KIND
     C                     KFLD           F#INNO
     C                     KFLD           F#ACNT
     C                     KFLD           F#ITEM
     C                     KFLD           F#TXNO
     C                     KFLD           F#TXIT
     C*
     C           *LOVAL    SETLLRDSDTW
     C                     MOVE *OFF      *IN40
     C           *IN40     DOWEQ*OFF
     C                     READ RDSDTW                   40
     C   40                LEAVE
     C*
0407AC           F#FLAG    COMP 'A'                      11
0407AC           F#FLAG    COMP 'C'                      12
0407AC           F#FLAG    COMP 'D'                      13
     C*
     C           K#DSLG    CHAINRARDSDT              41
     C*
     C                     EXSR MOVESR
     C*
     C   41                WRITERARDSDT
     C  N41N13             UPDATRARDSDT
0407AC   13N41             DELETRARDSDT
     C*
0407AC                     MOVEL*BLANKS   F#FLAG
0407AC                     UPDATRDSDTW
     C                     ENDDO
     C*
     C                     RETRN
     C*****************************************************************
     C           MOVESR    BEGSR
     C*****************************************************************
0407AC                     MOVEL*BLANKS   ASFLAG
     C                     MOVELF#KIND    ASKIND           分攤類別
     C                     MOVELF#CUNO    ASCUNO           客戶編號
     C                     MOVELF#CUNM    ASCUNM           客戶簡稱
     C                     MOVELF#ORNO    ASORNO           訂單號碼
     C                     Z-ADDF#YYMM    ASYYMM           處理年月
     C                     Z-ADDF#CONT    ASCONT           處理次數
     C                     MOVELF#TYPE    ASTYPE           發票聯式
     C                     MOVELF#SALE    ASSALE           業務員別
     C                     MOVELF#AREA    ASAREA           廠區別
     C                     Z-ADDF#AMT4    ASAMT4           折讓單價
     C                     MOVELF#INNO    ASINNO           發票號碼
     C                     MOVELF#ACNT    ASACNT           類別
     C                     Z-ADDF#ITEM    ASITEM           項次
     C                     Z-ADDF#INDT    ASINDT           發票日期
     C                     MOVELF#DECD    ASDECD           發票作廢碼
     C                     Z-ADDF#DEDT    ASDEDT           作廢日期
     C                     MOVELF#TXNO    ASTXNO           磅單號碼
     C                     Z-ADDF#TXIT    ASTXIT           磅單項次
     C                     Z-ADDF#DATE    ASDATE           出貨日期
     C                     MOVELF#PDNM    ASPDNM           品名
     C                     Z-ADDF#QTY1    ASQTY1           銷貨數量
     C                     Z-ADDF#PRC1    ASPRC1           銷貨單價
     C                     Z-ADDF#AMT1    ASAMT1           銷貨金額
     C                     Z-ADDF#KTY2    ASKTY2           折扣數量
     C                     Z-ADDF#KRC2    ASKRC2           折扣單價
     C                     Z-ADDF#KMT2    ASKMT2           折扣金額
     C                     Z-ADDF#DMT1    ASDMT1           折讓金額
     C                     Z-ADDF#DMT2    ASDMT2           折讓稅額
     C                     MOVELF#DXNO    ASDXNO           折讓單號
     C                     MOVELF#UPDM    ASUPDM           異動人員
     C                     Z-ADDF#UPDD    ASUPDD           異動日期
     C                     Z-ADDF#UPDT    ASUPDT           異動時間
     C                     MOVELF#RESV    ASRESV           保留碼
     C*
     C                     ENDSR
