     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP125RA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     折讓單沖銷檔傳輸作業
     H*            5.DATE-WRITTEN  103/07/18 2014AR845
     H*            6.DATE-MODIFY
     H*****************************************************************
     H            Y                                     1                 BR100
     FARSRAE  UP  E           K        DISK
     F            RARSRAE                           KRENAMERSRAE
     FARSRAEW UF  E           K        DISK                      A
     IRSRAE       01
     I              ASFLAG                          F#FLAG
     I              ASFACT                          F#FACT
     I              ASAENO                          F#AENO
     I              ASTXNO                          F#TXNO
     I              ASITEM                          F#ITEM
     I              ASTXYM                          F#TXYM
     I              ASTXNS                          F#TXNS
     I              ASTXNE                          F#TXNE
     I              ASCUNO                          F#CUNO
     I              ASCUNM                          F#CUNM
     I              ASMUID                          F#MUID
     I              ASDATE                          F#DATE
     I              ASTYPE                          F#TYPE
     I              ASPYDE                          F#PYDE
     I              ASPANO                          F#PANO
     I              ASPAMT                          F#PAMT
     I              ASPAYN                          F#PAYN
     I              ASDECD                          F#DECD
     I              ASDEDT                          F#DEDT
     I              ASINDT                          F#INDT
     I              ASINNO                          F#INNO
     I              ASIAMT                          F#IAMT
     I              ASITAX                          F#ITAX
     I              ASEAMT                          F#EAMT
     I              ASACNO                          F#ACNO
     I              ASGLNO                          F#GLNO
     I              ASMARK                          F#MARK
     I              ASMAR1                          F#MAR1
     I              ASENTM                          F#ENTM
     I              ASENTD                          F#ENTD
     I              ASENTT                          F#ENTT
     I              ASUPDM                          F#UPDM
     I              ASUPDD                          F#UPDD
     I              ASUPDT                          F#UPDT
     C*
     C           K#SRLG    KLIST
     C                     KFLD           F#FACT
     C                     KFLD           F#AENO
     C                     KFLD           F#CUNO
     C                     KFLD           F#TXNO
     C                     KFLD           F#ITEM
     C*
     C   01                EXSR MOVESR
     CLR                   RETRN
     C*****************************************************************
     C           MOVESR    BEGSR
     C*****************************************************************
     C                     MOVE *BLANK    F#FLAG
     C                     UPDATRSRAE
     C*
     C           K#SRLG    CHAINRARSRAE              41
     C                     MOVELF#FACT    ASFACT           廠區
     C                     MOVELF#AENO    ASAENO           沖銷單號
     C                     MOVELF#TXNO    ASTXNO           折讓單號
     C                     MOVELF#ITEM    ASITEM           折讓單項次
     C                     Z-ADDF#TXYM    ASTXYM           折讓單入帳年月
     C                     MOVELF#TXNS    ASTXNS           折讓單起號
     C                     MOVELF#TXNE    ASTXNE           折讓單迄號
     C                     MOVELF#CUNO    ASCUNO           客戶代號
     C                     MOVELF#CUNM    ASCUNM           客戶名稱
     C                     MOVELF#MUID    ASMUID           客戶統編
     C                     MOVELF#TYPE    ASTYPE           付款方式
     C                     Z-ADDF#PYDE    ASPYDE           付款日
     C                     MOVELF#PANO    ASPANO           付款帳號
     C                     Z-ADDF#PAMT    ASPAMT           匯費
     C                     MOVELF#PAYN    ASPAYN           郵電外加Y/N
     C                     MOVELF#DECD    ASDECD           作廢碼
     C                     Z-ADDF#DEDT    ASDEDT           作廢日期
     C                     Z-ADDF#INDT    ASINDT           發票日期
     C                     MOVELF#INNO    ASINNO           發票日期
     C                     Z-ADDF#IAMT    ASIAMT           發票金額
     C                     Z-ADDF#ITAX    ASITAX           發票稅額
     C                     Z-ADDF#EAMT    ASEAMT           沖銷金額
     C                     MOVELF#ACNO    ASACNO           折讓退回傳票編號
     C                     MOVELF#GLNO    ASGLNO           製票號碼
     C                     MOVELF#MARK    ASMARK           保留一
     C                     Z-ADDF#MAR1    ASMAR1           保留二
     C                     MOVELF#ENTM    ASENTM           建檔人員
     C                     Z-ADDF#ENTD    ASENTD           建檔日期
     C                     Z-ADDF#ENTT    ASENTT           建檔時間
     C                     MOVELF#UPDM    ASUPDM           異動人員
     C                     Z-ADDF#UPDD    ASUPDD           異動日期
     C                     Z-ADDF#UPDT    ASUPDT           異動時間
     C   41                WRITERARSRAE
     C  N41                UPDATRARSRAE
     C*
     C                     ENDSR
