     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP110R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     電子商務--發票與銷貨資料重新下載處理
     H*            5.DATE-WRITTEN  93/09/02
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     H        1   Y                                     1
     FINMLOG  IP  E           K        DISK
     FARINDW  UF  E           K        DISK                      A
     IRINMLOG     01
     C*****************************************************************
     C*          KEY   LIST
     C*****************************************************************
     C*FILE==>ARINDW
     C           K#INDW    KLIST
     C                     KFLD           ANVNNO
     C                     KFLD           ANFILE
     C                     KFLD           ANSEQN
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C  N99                EXSR INISR
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     MOVE *ON       *IN99
     C*
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     MOVELIMVNNO    ANVNNO
     C                     MOVELIMFILE    ANFILE
     C                     Z-ADDIMSEQN    ANSEQN
     C           K#INDW    CHAINRARINDW              40
     C                     MOVELIMFLAG    ANFLAG
     C                     MOVELIMTYPE    ANTYPE
     C                     MOVELIMDECD    ANDECD
     C                     MOVELIMDEDT    ANDEDT
     C                     MOVELIMNO      ANNO
     C                     MOVELIMCUNO    ANCUNO
     C                     MOVELIMCUNM    ANCUNM
     C                     MOVELIMORNO    ANORNO
     C                     Z-ADDIMINDT    ANINDT
     C                     MOVELIMKIND    ANKIND
     C                     MOVELIMRVID    ANRVID
     C                     MOVELIMSALE    ANSALE
     C                     MOVELIMAREA    ANAREA
     C                     MOVELIMTXTP    ANTXTP
     C                     Z-ADDIMAAMT    ANAAMT
     C                     Z-ADDIMATAX    ANATAX
     C                     Z-ADDIMBAMT    ANBAMT
     C                     Z-ADDIMCAMT    ANCAMT
     C                     Z-ADDIMCTAX    ANCTAX
     C                     Z-ADDIMNBAL    ANNBAL
     C                     MOVELIMAPNO    ANAPNO
     C                     Z-ADDIMAPDT    ANAPDT
     C   40                WRITERARINDW
     C  N40                UPDATRARINDW
     C*
     C                     ENDSR
