     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP137RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     台北INEMST-->INEMSTP
     A*            5.DATE-WRITTEN  107/12/05 2018AR00031
     A*            6.UPDATE  DATE  107/12/14 2018AR00038 S00WCJ (0712A)
     A*                             增加列印日期、列印時間、列印人員
     A*                             營業單位
     A*                            108/05/09 S00WCJ (0805A)
     A*                            增加寫入電子發票介面LOG異動資訊
     A*                            112/04/11 S00WCJ (1204A)
     A*                             增加N廠傳輸
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINEMST  UP  E           K        DISK
     FINEMSTT UF  E           K        DISK                      A
     F            RINEMST                           KRENAMEMSTECD
     FINEMSTG O   E           K        DISK
     F            RINEMST                           KRENAMEMSTG
     IMSTECD      01
     I              EMFLAG                          FLAG
     I              EMAREA                          AREA
     I              EMMSTE                          MSTE
     I              EMNO                            NO
     I              EMINDT                          INDT
     I              EMINTT                          INTT
     I              EMSLID                          SLID
     I              EMSLNM                          SLNM
     I              EMSLAS                          SLAS
     I              EMSLPE                          SLPE
     I              EMSLTL                          SLTL
     I              EMSLFC                          SLFC
     I              EMSLML                          SLML
     I              EMSLNO                          SLNO
     I              EMSLRK                          SLRK
     I              EMBYID                          BYID
     I              EMBYNM                          BYNM
     I              EMBYAS                          BYAS
     I              EMBYPE                          BYPE
     I              EMBYTL                          BYTL
     I              EMBYFC                          BYFC
     I              EMBYML                          BYML
     I              EMBYNO                          BYNO
     I              EMBYRK                          BYRK
     I              EMCKNR                          CKNR
     I              EMBURK                          BURK
     I              EMMARK                          MARK
     I              EMCUMK                          CUMK
     I              EMCTEY                          CTEY
     I              EMRLNR                          RLNR
     I              EMINTE                          INTE
     I              EMGRMK                          GRMK
     I              EMDNMK                          DNMK
     I              EMBDCD                          BDCD
     I              EMSAMT                          SAMT
     I              EMTXTP                          TXTP
     I              EMTXRT                          TXRT
     I              EMATAX                          ATAX
     I              EMAAMT                          AAMT
     I              EMDSAT                          DSAT
     I              EMOCAT                          OCAT
     I              EMEXAT                          EXAT
     I              EMCRRY                          CRRY
     I              EMTMDT                          TMDT
     I              EMTMTM                          TMTM
     I              EMTMOP                          TMOP
     I              EMTAWS                          TAWS
     I              EMSTCL                          STCL
     I              EMXPDD                          XPDD
     I              EMXPDT                          XPDT
     I              EMXUSR                          XUSR
     I              EMMAR1                          MAR1
     I              EMPTYN                          PTYN
     I              EMRADN                          RADN
     I              EMPTAR                          PTAR
     I              EMPTMD                          PTMD
     I              EMPTCN                          PTCN
0712AI              EMPTDD                          PTDD
0712AI              EMPTDT                          PTDT
0712AI              EMPTSR                          PTSR
0712AI              EMBUMD                          BUMD
     I*
0805AI           UDS
0805AI                                     10011010 U#USID
     C           KEY       KLIST
     C                     KFLD           EMNO
     C*
     C                     MOVEA'000'     *IN,11
     C           EMFLAG    COMP 'A'                      11
     C           EMFLAG    COMP 'C'                      12
     C           EMFLAG    COMP 'D'                      13
     C*
     C           EMSTCL    IFNE ' '
     C           KEY       CHAINMSTECD               32
     C                     EXSR MOVE1
     C           *IN32     IFEQ '1'
     C           EMAREA    IFEQ 'U'
     C           EMAREA    OREQ 'H'
     C           EMAREA    OREQ 'K'
1204AC           EMAREA    OREQ 'N'
1204AC           EMAREA    OREQ 'I'
     C                     WRITEMSTECD
     C                     MOVEL'ARP137RA'EMAPNM
0805AC           *DATE     SUB  19000000  EMCHDD
0805AC                     TIME           EMCHDT
0805AC                     MOVELU#USID    EMCUSR
     C                     WRITEMSTG
     C                     END
     C                     END
     C*
     C           *IN32     IFEQ '0'
     C           EMAREA    IFEQ 'U'
     C           EMAREA    OREQ 'H'
     C           EMAREA    OREQ 'K'
1204AC           EMAREA    OREQ 'N'
1204AC           EMAREA    OREQ 'I'
     C                     UPDATMSTECD
     C                     MOVEL'ARP137RA'EMAPNM
0805AC           *DATE     SUB  19000000  EMCHDD
0805AC                     TIME           EMCHDT
0805AC                     MOVELU#USID    EMCUSR
     C                     WRITEMSTG
     C                     END
     C                     END
     C                     ENDIF
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVE ' '       EMFLAG
     C                     UPDATRINEMST
     C                     END
     C           *IN13     IFEQ '1'
     C                     DELETRINEMST
     C                     END
     C**************************************************************
     C           MOVE1     BEGSR
     C                     MOVELEMFLAG    FLAG
     C                     MOVELEMAREA    AREA
     C                     MOVELEMMSTE    MSTE
     C                     MOVELEMNO      NO
     C                     MOVELEMINDT    INDT
     C                     MOVELEMINTT    INTT
     C                     MOVELEMSLID    SLID
     C                     MOVELEMSLNM    SLNM
     C                     MOVELEMSLAS    SLAS
     C                     MOVELEMSLPE    SLPE
     C                     MOVELEMSLTL    SLTL
     C                     MOVELEMSLFC    SLFC
     C                     MOVELEMSLML    SLML
     C                     MOVELEMSLNO    SLNO
     C                     MOVELEMSLRK    SLRK
     C                     MOVELEMBYID    BYID
     C                     MOVELEMBYNM    BYNM
     C                     MOVELEMBYAS    BYAS
     C                     MOVELEMBYPE    BYPE
     C                     MOVELEMBYTL    BYTL
     C                     MOVELEMBYFC    BYFC
     C                     MOVELEMBYML    BYML
     C                     MOVELEMBYNO    BYNO
     C                     MOVELEMBYRK    BYRK
     C                     MOVELEMCKNR    CKNR
     C                     MOVELEMBURK    BURK
     C                     MOVELEMMARK    MARK
     C                     MOVELEMCUMK    CUMK
     C                     MOVELEMCTEY    CTEY
     C                     MOVELEMRLNR    RLNR
     C                     MOVELEMINTE    INTE
     C                     MOVELEMGRMK    GRMK
     C                     MOVELEMDNMK    DNMK
     C                     MOVELEMBDCD    BDCD
     C                     Z-ADDEMSAMT    SAMT
     C                     MOVELEMTXTP    TXTP
     C                     Z-ADDEMTXRT    TXRT
     C                     Z-ADDEMATAX    ATAX
     C                     Z-ADDEMAAMT    AAMT
     C                     Z-ADDEMDSAT    DSAT
     C                     Z-ADDEMOCAT    OCAT
     C                     Z-ADDEMEXAT    EXAT
     C                     MOVELEMCRRY    CRRY
     C*
     C                     Z-ADDEMTMDT    TMDT
     C                     Z-ADDEMTMTM    TMTM
     C                     MOVELEMTMOP    TMOP
     C                     MOVELEMTAWS    TAWS
     C                     MOVELEMSTCL    STCL
     C*
     C                     Z-ADDEMXPDD    XPDD
     C                     Z-ADDEMXPDT    XPDT
     C                     MOVELEMXUSR    XUSR
     C                     MOVELEMMAR1    MAR1
     C                     MOVELEMPTYN    PTYN
     C                     MOVELEMRADN    RADN
     C                     MOVELEMPTAR    PTAR
     C                     MOVELEMPTMD    PTMD
     C                     Z-ADDEMPTCN    PTCN
     C*
0712AC                     Z-ADDEMPTDD    PTDD
0712AC                     Z-ADDEMPTDT    PTDT
0712AC                     MOVELEMPTSR    PTSR
0712AC                     MOVELEMBUMD    BUMD
     C                     ENDSR
