     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP143RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     ¥x¥_INENBU-->INENBUT
     A*            5.DATE-WRITTEN  107/12/11 2018AR00031
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     FINENBU  UP  E           K        DISK
     F            RINENBU                           KRENAMENBUECD
     FINENBUT UF  E           K        DISK                      A
     FINENBUG O   E           K        DISK
     F            RINENBU                           KRENAMENBUG
     INBUECD      01
     I              NUFLAG                          FLAG
     I              NUMSTE                          MSTE
     I              NUHEBN                          HEBN
     I              NUBRBN                          BRBN
     I              NUINTE                          INTE
     I              NUYEMH                          YEMH
     I              NUINTK                          INTK
     I              NUINBN                          INBN
     I              NUINEN                          INEN
     I              NUFACT                          FACT
     I              NUYYMM                          YYMM
     I              NUKIND                          KIND
     I              NUTMDT                          TMDT
     I              NUTMTM                          TMTM
     I              NUTMOP                          TMOP
     I              NUTAWS                          TAWS
     I              NUSTCL                          STCL
     I              NUXPDD                          XPDD
     I              NUXPDT                          XPDT
     I              NUXUSR                          XUSR
     I              NUMAR1                          MAR1
     I              NUPTYN                          PTYN
     C           KEY       KLIST
     C                     KFLD           FACT
     C                     KFLD           YYMM
     C                     KFLD           KIND
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           STCL      IFNE ' '
     C           KEY       CHAINRINENBU              32
     C                     EXSR MOVE1
     C           *IN32     IFEQ '1'
     C           FACT      IFEQ 'U'
     C           FACT      OREQ 'H'
     C           FACT      OREQ 'K'
     C                     WRITERINENBU
     C                     MOVE 'ARP143RA'NUMAR1
     C                     WRITENBUG
     C                     END
     C                     END
     C*
     C           *IN32     IFEQ '0'
     C           FACT      IFEQ 'U'
     C           FACT      OREQ 'H'
     C           FACT      OREQ 'K'
     C                     UPDATRINENBU
     C                     MOVE 'ARP143RA'NUMAR1
     C                     WRITENBUG
     C                     END
     C                     END
     C                     ENDIF
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVE ' '       FLAG
     C                     UPDATNBUECD
     C                     END
     C           *IN13     IFEQ '1'
     C                     DELETNBUECD
     C                     END
     C**************************************************************
     C           MOVE1     BEGSR
     C                     MOVELFLAG      NUFLAG
     C                     MOVELMSTE      NUMSTE
     C                     MOVELHEBN      NUHEBN
     C                     MOVELBRBN      NUBRBN
     C                     MOVELINTE      NUINTE
     C                     MOVELYEMH      NUYEMH
     C                     MOVELINTK      NUINTK
     C                     MOVELINBN      NUINBN
     C                     MOVELINEN      NUINEN
     C                     MOVELFACT      NUFACT
     C                     MOVELYYMM      NUYYMM
     C                     MOVELKIND      NUKIND
     C                     Z-ADDTMDT      NUTMDT
     C                     Z-ADDTMTM      NUTMTM
     C                     MOVELTMOP      NUTMOP
     C                     MOVELTAWS      NUTAWS
     C                     MOVELSTCL      NUSTCL
     C                     Z-ADDXPDD      NUXPDD
     C                     Z-ADDXPDT      NUXPDT
     C                     MOVELXUSR      NUXUSR
     C                     MOVELMAR1      NUMAR1
     C                     MOVELPTYN      NUPTYN
     C                     ENDSR
