     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP131RB
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INEDIN電子發票作廢檔傳輸
     A*            5.DATE-WRITTEN  107/06/28 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINEDINT IP  E                    DISK
     F            RINEDIN                           KRENAMEDINECD
     FINEDIN  UF  E           K        DISK                      A
     IDINECD      01
     I              DNFLAG                          FLAG
     I              DNAREA                          AREA
     I              DNMSTE                          MSTE
     I              DNNO                            NO
     I              DNINDT                          INDT
     I              DNBYID                          BYID
     I              DNSLID                          SLID
     I              DNDEDT                          DEDT
     I              DNDETM                          DETM
     I              DNCLRN                          CLRN
     I              DNRTDN                          RTDN
     I              DNREMK                          REMK
     I              DNTMDT                          TMDT
     I              DNTMTM                          TMTM
     I              DNTMOP                          TMOP
     I              DNTAWS                          TAWS
     I              DNSTCL                          STCL
     I              DNXPDD                          XPDD
     I              DNXPDT                          XPDT
     I              DNXUSR                          XUSR
     I              DNMAR1                          MAR1
     I              DNPTYN                          PTYN
     I*
     I           UDS
     I                                       21  21 FAC
     I*
     C           KEY       KLIST
     C                     KFLD           NO
     C           *DATE     SUB  19000000  U#SYSD  80
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINEDIN              31
     C                     MOVEL*BLANK    DNFLAG
     C                     MOVELAREA      DNAREA
     C                     MOVELMSTE      DNMSTE
     C                     MOVELNO        DNNO
     C                     MOVELINDT      DNINDT
     C                     MOVELBYID      DNBYID
     C                     MOVELSLID      DNSLID
     C                     MOVELDEDT      DNDEDT
     C                     MOVELDETM      DNDETM
     C                     MOVELCLRN      DNCLRN
     C                     MOVELRTDN      DNRTDN
     C                     MOVELREMK      DNREMK
     C                     Z-ADDTMDT      DNTMDT
     C                     Z-ADDTMTM      DNTMTM
     C                     MOVELTMOP      DNTMOP
     C                     MOVELTAWS      DNTAWS
     C                     MOVELSTCL      DNSTCL
     C                     Z-ADDXPDD      DNXPDD
     C                     Z-ADDXPDT      DNXPDT
     C                     MOVELXUSR      DNXUSR
     C                     MOVELMAR1      DNMAR1
     C                     MOVELPTYN      DNPTYN
     C   11 31
     COR 12 31             WRITERINEDIN
     C   11N31
     COR 12N31             UPDATRINEDIN
     C   13N31             EXCPTDEL#A
     ORINEDIN EDEL             DEL#A
