     H*****************************************************************
     H*
     H*         *****   PROGRAM INTRODUCTION   *****
     H*
     H*       1.PROGRAM-ID    ARP155R
     H*       2.PROGRAM-TYPE  RPG/400
     H*       3.AUTHOR        S00WCJ
     H*       4.FUNCTION    型鋼外銷繳款金額統計
     H*       5.DATE-WRITTEN  113/10/04 2024AR00033
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARP155FAIP  E           K        DISK
     FARP155F O   E           K        DISK
     IRAR155FA    01
     I                                              FACUNOL1
     I                                              FAORNOL1
     I                                              FACURRL1
     I*
     I           UDS
     I                                      951 985 COMP
     I                                     10011010 D#USER
     I                                     10011001 D#DEPT
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C*****************************************************************
     C*          Parameter List
     C*****************************************************************
     C*
     C           KEY01     KLIST
     C                     KFLD           F1CUNO
     C                     KFLD           F1ORNO
     C                     KFLD           F1CURR
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C*
     C  N99                EXSR SR0000
     C   L1                EXSR SR1000
     C   01                EXSR SR2000
     CL1                   EXSR SR3000
     CLR                   RETRN
     C*
     C*****************************************************************
     C           SR0000    BEGSR
     C*****************************************************************
     C*
     C           *DATE     SUB  19000000  U#SYSD  80
     C                     MOVEL*ON       *IN99
     C                     ENDSR
     C*****************************************************************
     C           SR1000    BEGSR
     C*****************************************************************
     C*
     C                     Z-ADD0         W#CAMT 132       原幣
     C                     Z-ADD0         W#RAMT 110       台幣
     C                     Z-ADD0         W#ACAM 132       暫收原幣
     C                     Z-ADD0         W#ACRM 110       暫收台幣
     C*
     C                     CLEARRAR155F
     C*
     C                     ENDSR
     C*****************************************************************
     C           SR2000    BEGSR
     C*****************************************************************
     C*
     C                     MOVELFACUNO    F1CUNO
     C                     MOVELFAORNO    F1ORNO
     C                     MOVELFACURR    F1CURR
     C*
     C                     ADD  FACAMT    F1CAMT
     C                     ADD  FARAMT    F1RAMT
     C                     ADD  FAACAM    F1ACAM
     C                     ADD  FAACRM    F1ACRM
     C*
     C                     ENDSR
     C*****************************************************************
     C           SR3000    BEGSR
     C*****************************************************************
     C*
     C                     MOVELD#USER    F1ENTM           建檔人員
     C                     Z-ADDU#SYSD    F1ENTD           建檔日期
     C                     TIME           F1ENTT           建檔時間
     C                     MOVELD#USER    F1UPDM           異動人員
     C                     Z-ADDU#SYSD    F1UPDD           異動日期
     C                     TIME           F1UPDT           異動時間
     C*
     C                     WRITERAR155F
     C*
     C                     ENDSR
     C*****************************************************************
