     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP135RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INENRB電子發票分支機構配號檔
     A*            5.DATE-WRITTEN  107/07/03 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     FINENRB  UP  E                    DISK
     F            RINENRB                           KRENAMENRBECD
     FINENRBP UF  E           K        DISK                      A
     INRBECD      01
     I              NBFLAG                          FLAG
     I              NBMSTE                          MSTE
     I              NBHEBN                          HEBN
     I              NBBRBN                          BRBN
     I              NBINTE                          INTE
     I              NBYEMH                          YEMH
     I              NBINTK                          INTK
     I              NBINBN                          INBN
     I              NBINEN                          INEN
     I              NBINB1                          INB1
     I              NBINE1                          INE1
     I              NBINBT                          INBT
     I              NBFACT                          FACT
     I              NBTMDT                          TMDT
     I              NBTMTM                          TMTM
     I              NBTMOP                          TMOP
     I              NBTAWS                          TAWS
     I              NBSTCL                          STCL
     I              NBXPDD                          XPDD
     I              NBXPDT                          XPDT
     I              NBXUSR                          XUSR
     I              NBMAR1                          MAR1
     I              NBPTYN                          PTYN
     C*
     C           KEY       KLIST
     C                     KFLD           YEMH
     C                     KFLD           FACT
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINENRB              31
     C                     MOVELFLAG      NBFLAG
     C                     MOVELMSTE      NBMSTE
     C                     MOVELHEBN      NBHEBN
     C                     MOVELBRBN      NBBRBN
     C                     MOVELINTE      NBINTE
     C                     MOVELYEMH      NBYEMH
     C                     MOVELINTK      NBINTK
     C                     MOVELINBN      NBINBN
     C                     MOVELINEN      NBINEN
     C                     MOVELINB1      NBINB1
     C                     MOVELINE1      NBINE1
     C                     MOVELINBT      NBINBT
     C                     MOVELFACT      NBFACT
     C                     Z-ADDTMDT      NBTMDT
     C                     Z-ADDTMTM      NBTMTM
     C                     MOVELTMOP      NBTMOP
     C                     MOVELTAWS      NBTAWS
     C                     MOVELSTCL      NBSTCL
     C                     Z-ADDXPDD      NBXPDD
     C                     Z-ADDXPDT      NBXPDT
     C                     MOVELXUSR      NBXUSR
     C                     MOVELMAR1      NBMAR1
     C                     MOVELPTYN      NBPTYN
     C*
     C   31                WRITERINENRB
     C  N31                UPDATRINENRB
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     ONRBECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
