     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP132RB
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INEDTL電子發票明細檔傳輸
     A*            5.DATE-WRITTEN  107/06/29 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINEDTLT IP  E                    DISK
     F            RINEDTL                           KRENAMEDTLECD
     FINEDTL  UF  E           K        DISK                      A
     IDTLECD      01
     I              EDFLAG                          FLAG
     I              EDAREA                          AREA
     I              EDMSTE                          MSTE
     I              EDNO                            NO
     I              EDINDT                          INDT
     I              EDINTT                          INTT
     I              EDPDCD                          PDCD
     I              EDQTY                           QTY
     I              EDUNIT                          UNIT
     I              EDUPRC                          UPRC
     I              EDAMT                           AMT
     I              EDSENR                          SENR
     I              EDREMK                          REMK
     I              EDRENR                          RENR
     I              EDTMDT                          TMDT
     I              EDTMTM                          TMTM
     I              EDTMOP                          TMOP
     I              EDTAWS                          TAWS
     I              EDSTCL                          STCL
     I              EDXPDD                          XPDD
     I              EDXPDT                          XPDT
     I              EDXUSR                          XUSR
     I              EDMAR1                          MAR1
     I              EDPROD                          PROD
     I              EDPRNM                          PRNM
     I              EDPTYN                          PTYN
     I*
     I           UDS
     I                                       21  21 FAC
     I*
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           SENR
     C           *DATE     SUB  19000000  U#SYSD  80
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINEDTL              31
     C                     MOVEL*BLANK    EDFLAG
     C                     MOVELAREA      EDAREA
     C                     MOVELMSTE      EDMSTE
     C                     MOVELNO        EDNO
     C                     MOVELINDT      EDINDT
     C                     MOVELINTT      EDINTT
     C                     MOVELPDCD      EDPDCD
     C                     Z-ADDQTY       EDQTY
     C                     MOVELUNIT      EDUNIT
     C                     Z-ADDUPRC      EDUPRC
     C                     Z-ADDAMT       EDAMT
     C                     MOVELSENR      EDSENR
     C                     MOVELREMK      EDREMK
     C                     MOVELRENR      EDRENR
     C                     Z-ADDTMDT      EDTMDT
     C                     Z-ADDTMTM      EDTMTM
     C                     MOVELTMOP      EDTMOP
     C                     MOVELTAWS      EDTAWS
     C                     MOVELSTCL      EDSTCL
     C                     Z-ADDXPDD      EDXPDD
     C                     Z-ADDXPDT      EDXPDT
     C                     MOVELXUSR      EDXUSR
     C                     MOVELMAR1      EDMAR1
     C                     MOVELPROD      EDPROD
     C                     MOVELPRNM      EDPRNM
     C                     MOVELPTYN      EDPTYN
     C   11 31
     COR 12 31             WRITERINEDTL
     C   11N31
     COR 12N31             UPDATRINEDTL
     C   13N31             EXCPTDEL#A
     ORINEDTL EDEL             DEL#A
