     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP138RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     台北INEDTL-->INEDTLT
     A*            5.DATE-WRITTEN  107/12/05 2018AR00031
     A*            6.UPDATE  DATE  108/05/09 S00WCJ (0805A)
     A*                             增加寫入電子發票介面LOG異動資訊
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINEDTL  UP  E           K        DISK
     F            RINEDTL                           KRENAMEDTLECD
     FINEDTLT UF  E           K        DISK                      A
     FINEDTLG O   E           K        DISK
     F            RINEDTL                           KRENAMEDTLG
     IDTLECD      01
     I              EDFLAG                          FLAG
     I              EDAREA                          AREA
     I              EDMSTE                          MSTE
     I              EDNO                            NO
     I              EDINDT                          INDT
     I              EDINTT                          INTT
     I              EDPDCD                          PDCD
     I              EDQTY                           QTY
     I              EDUNIT                          UNIT
     I              EDUPRC                          UPRC
     I              EDAMT                           AMT
     I              EDSENR                          SENR
     I              EDREMK                          REMK
     I              EDRENR                          RENR
     I              EDTMDT                          TMDT
     I              EDTMTM                          TMTM
     I              EDTMOP                          TMOP
     I              EDTAWS                          TAWS
     I              EDSTCL                          STCL
     I              EDXPDD                          XPDD
     I              EDXPDT                          XPDT
     I              EDXUSR                          XUSR
     I              EDMAR1                          MAR1
     I              EDPROD                          PROD
     I              EDPRNM                          PRNM
     I              EDPTYN                          PTYN
     I*
0805AI           UDS
0805AI                                     10011010 U#USID
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           SENR
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           STCL      IFNE ' '
     C           KEY       CHAINRINEDTL              32
     C                     EXSR MOVE1
     C           *IN32     IFEQ '1'
     C           AREA      IFEQ 'U'
     C           AREA      OREQ 'H'
     C           AREA      OREQ 'K'
     C                     WRITERINEDTL
     C                     MOVEL'ARP138RA'EDAPNM
0805AC           *DATE     SUB  19000000  EDCHDD
0805AC                     TIME           EDCHDT
0805AC                     MOVELU#USID    EDCUSR
     C                     WRITEDTLG
     C                     END
     C                     END
     C*
     C           *IN32     IFEQ '0'
     C           AREA      IFEQ 'U'
     C           AREA      OREQ 'H'
     C           AREA      OREQ 'K'
     C                     UPDATRINEDTL
     C                     MOVEL'ARP138RA'EDAPNM
0805AC           *DATE     SUB  19000000  EDCHDD
0805AC                     TIME           EDCHDT
0805AC                     MOVELU#USID    EDCUSR
     C                     WRITEDTLG
     C                     END
     C                     END
     C                     ENDIF
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVE ' '       FLAG
     C                     UPDATDTLECD
     C                     END
     C           *IN13     IFEQ '1'
     C                     DELETDTLECD
     C                     END
     C**************************************************************
     C           MOVE1     BEGSR
     C                     MOVELFLAG      EDFLAG
     C                     MOVELAREA      EDAREA
     C                     MOVELMSTE      EDMSTE
     C                     MOVELNO        EDNO
     C                     MOVELINDT      EDINDT
     C                     MOVELINTT      EDINTT
     C                     MOVELPDCD      EDPDCD
     C                     Z-ADDQTY       EDQTY
     C                     MOVELUNIT      EDUNIT
     C                     Z-ADDUPRC      EDUPRC
     C                     Z-ADDAMT       EDAMT
     C                     MOVELSENR      EDSENR
     C                     MOVELREMK      EDREMK
     C                     MOVELRENR      EDRENR
     C                     Z-ADDTMDT      EDTMDT
     C                     Z-ADDTMTM      EDTMTM
     C                     MOVELTMOP      EDTMOP
     C                     MOVELTAWS      EDTAWS
     C                     MOVELSTCL      EDSTCL
     C                     Z-ADDXPDD      EDXPDD
     C                     Z-ADDXPDT      EDXPDT
     C                     MOVELXUSR      EDXUSR
     C                     MOVELMAR1      EDMAR1
     C                     MOVELPROD      EDPROD
     C                     MOVELPRNM      EDPRNM
     C                     MOVELPTYN      EDPTYN
     C                     ENDSR
