     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP134RB
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INETRN電子發票折讓傳輸
     A*            5.DATE-WRITTEN  107/07/02 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINETRNT IP  E                    DISK
     F            RINETRN                           KRENAMETRNECD
     FINETRN  UF  E           K        DISK                      A
     ITRNECD      01
     I              TRFLAG                          FLAG
     I              TRAREA                          AREA
     I              TRMSTE                          MSTE
     I              TRNO                            NO
     I              TRINDT                          INDT
     I              TRSLID                          SLID
     I              TRSLNM                          SLNM
     I              TRSLAS                          SLAS
     I              TRSLPE                          SLPE
     I              TRSLTL                          SLTL
     I              TRSLFC                          SLFC
     I              TRSLML                          SLML
     I              TRSLNO                          SLNO
     I              TRSLRK                          SLRK
     I              TRBYID                          BYID
     I              TRBYNM                          BYNM
     I              TRBYAS                          BYAS
     I              TRBYPE                          BYPE
     I              TRBYTL                          BYTL
     I              TRBYFC                          BYFC
     I              TRBYML                          BYML
     I              TRBYNO                          BYNO
     I              TRBYRK                          BYRK
     I              TRALTE                          ALTE
     I              TROIND                          OIND
     I              TROINO                          OINO
     I              TROISN                          OISN
     I              TRPDCD                          PDCD
     I              TRQTY                           QTY
     I              TRUNIT                          UNIT
     I              TRUPRC                          UPRC
     I              TRAMT                           AMT
     I              TRTAX                           TAX
     I              TRSENR                          SENR
     I              TRTXTP                          TXTP
     I              TRATAX                          ATAX
     I              TRAAMT                          AAMT
     I              TRTMDT                          TMDT
     I              TRTMTM                          TMTM
     I              TRTMOP                          TMOP
     I              TRTAWS                          TAWS
     I              TRSTCL                          STCL
     I              TRXPDD                          XPDD
     I              TRXPDT                          XPDT
     I              TRXUSR                          XUSR
     I              TRMAR1                          MAR1
     I              TRPTYN                          PTYN
     I*
     I           UDS
     I                                       21  21 FAC
     I*
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           SENR
     C*
     C           *DATE     SUB  19000000  U#SYSD  80
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINETRN              31
     C                     MOVEL*BLANK    TRFLAG
     C                     MOVELAREA      TRAREA
     C                     MOVELMSTE      TRMSTE
     C                     MOVELNO        TRNO
     C                     MOVELINDT      TRINDT
     C                     MOVELSLID      TRSLID
     C                     MOVELSLNM      TRSLNM
     C                     MOVELSLAS      TRSLAS
     C                     MOVELSLPE      TRSLPE
     C                     MOVELSLTL      TRSLTL
     C                     MOVELSLFC      TRSLFC
     C                     MOVELSLML      TRSLML
     C                     MOVELSLNO      TRSLNO
     C                     MOVELSLRK      TRSLRK
     C                     MOVELBYID      TRBYID
     C                     MOVELBYNM      TRBYNM
     C                     MOVELBYAS      TRBYAS
     C                     MOVELBYPE      TRBYPE
     C                     MOVELBYTL      TRBYTL
     C                     MOVELBYFC      TRBYFC
     C                     MOVELBYML      TRBYML
     C                     MOVELBYNO      TRBYNO
     C                     MOVELBYRK      TRBYRK
     C                     MOVELALTE      TRALTE
     C                     MOVELOIND      TROIND
     C                     MOVELOINO      TROINO
     C                     MOVELOISN      TROISN
     C                     MOVELPDCD      TRPDCD
     C                     Z-ADDQTY       TRQTY
     C                     MOVELUNIT      TRUNIT
     C                     Z-ADDUPRC      TRUPRC
     C                     Z-ADDAMT       TRAMT
     C                     Z-ADDTAX       TRTAX
     C                     MOVELSENR      TRSENR
     C                     MOVELTXTP      TRTXTP
     C                     Z-ADDATAX      TRATAX
     C                     Z-ADDAAMT      TRAAMT
     C                     Z-ADDTMDT      TRTMDT
     C                     Z-ADDTMTM      TRTMTM
     C                     MOVELTMOP      TRTMOP
     C                     MOVELTAWS      TRTAWS
     C                     MOVELSTCL      TRSTCL
     C                     Z-ADDXPDD      TRXPDD
     C                     Z-ADDXPDT      TRXPDT
     C                     MOVELXUSR      TRXUSR
     C                     MOVELMAR1      TRMAR1
     C                     MOVELPTYN      TRPTYN
     C   11 31
     COR 12 31             WRITERINETRN
     C   11N31
     COR 12N31             UPDATRINETRN
     C   13N31             EXCPTDEL#A
     ORINETRN EDEL             DEL#A
