     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP137RC
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     台北INEMSTP-->桃園、苗栗、高雄
     A*            5.DATE-WRITTEN  107/12/05 2018AR00031
     A*            6.UPDATE  DATE  107/12/14 2018AR00038 S00WCJ (0712A)
     A*                             增加列印日期、列印時間、列印人員
     A*                             營業單位
     A*                            108/05/09 S00WCJ (0805A)
     A*                             增加LOG檔
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINEMSTT UP  E           K        DISK
     F            RINEMST                           KRENAMEMSTECD
     FINEMST  UF  E           K        DISK                      A
0805AFINEMSTG O   E           K        DISK
0805AF            RINEMST                           KRENAMEMSTG
     IMSTECD      01
     I              EMFLAG                          FLAG
     I              EMAREA                          AREA
     I              EMMSTE                          MSTE
     I              EMNO                            NO
     I              EMINDT                          INDT
     I              EMINTT                          INTT
     I              EMSLID                          SLID
     I              EMSLNM                          SLNM
     I              EMSLAS                          SLAS
     I              EMSLPE                          SLPE
     I              EMSLTL                          SLTL
     I              EMSLFC                          SLFC
     I              EMSLML                          SLML
     I              EMSLNO                          SLNO
     I              EMSLRK                          SLRK
     I              EMBYID                          BYID
     I              EMBYNM                          BYNM
     I              EMBYAS                          BYAS
     I              EMBYPE                          BYPE
     I              EMBYTL                          BYTL
     I              EMBYFC                          BYFC
     I              EMBYML                          BYML
     I              EMBYNO                          BYNO
     I              EMBYRK                          BYRK
     I              EMCKNR                          CKNR
     I              EMBURK                          BURK
     I              EMMARK                          MARK
     I              EMCUMK                          CUMK
     I              EMCTEY                          CTEY
     I              EMRLNR                          RLNR
     I              EMINTE                          INTE
     I              EMGRMK                          GRMK
     I              EMDNMK                          DNMK
     I              EMBDCD                          BDCD
     I              EMSAMT                          SAMT
     I              EMTXTP                          TXTP
     I              EMTXRT                          TXRT
     I              EMATAX                          ATAX
     I              EMAAMT                          AAMT
     I              EMDSAT                          DSAT
     I              EMOCAT                          OCAT
     I              EMEXAT                          EXAT
     I              EMCRRY                          CRRY
     I              EMTMDT                          TMDT
     I              EMTMTM                          TMTM
     I              EMTMOP                          TMOP
     I              EMTAWS                          TAWS
     I              EMSTCL                          STCL
     I              EMXPDD                          XPDD
     I              EMXPDT                          XPDT
     I              EMXUSR                          XUSR
     I              EMMAR1                          MAR1
     I              EMPTYN                          PTYN
     I              EMRADN                          RADN
     I              EMPTAR                          PTAR
     I              EMPTMD                          PTMD
     I              EMPTCN                          PTCN
0712AI              EMPTDD                          PTDD
0712AI              EMPTDT                          PTDT
0712AI              EMPTSR                          PTSR
0712AI              EMBUMD                          BUMD
     I           UDS
     I                                        6   6 AREA
0805AI                                     10011010 U#USID
     C           KEY       KLIST
     C                     KFLD           NO
     C*
     C                     MOVEA'0000'    *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           KEY       CHAINRINEMST              31
     C                     EXSR MOVE1
     C           *IN31     IFEQ '1'
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     WRITERINEMST
0805AC                     EXSR MOVE2
0805AC                     WRITEMSTG
     C                     END
     C                     END
     C           *IN31     IFEQ '0'
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     UPDATRINEMST
0805AC                     EXSR MOVE2
0805AC                     WRITEMSTG
     C                     END
     C                     END
     C*
     C                     DELETMSTECD
     C*
     C****************************************************************
     C           MOVE1     BEGSR
     C****************************************************************
     C                     Z-ADDTMDT      EMTMDT
     C                     Z-ADDTMTM      EMTMTM
     C                     MOVELTMOP      EMTMOP
     C                     MOVELTAWS      EMTAWS
     C                     MOVELSTCL      EMSTCL
     C                     ENDSR
     C**************************************************************
0805AC           MOVE2     BEGSR
     C**************************************************************
0805AC                     MOVELFLAG      EMFLAG
0805AC                     MOVELAREA      EMAREA
0805AC                     MOVELMSTE      EMMSTE
0805AC                     MOVELNO        EMNO
0805AC                     MOVELINDT      EMINDT
0805AC                     MOVELINTT      EMINTT
0805AC                     MOVELSLID      EMSLID
0805AC                     MOVELSLNM      EMSLNM
0805AC                     MOVELSLAS      EMSLAS
0805AC                     MOVELSLPE      EMSLPE
0805AC                     MOVELSLTL      EMSLTL
0805AC                     MOVELSLFC      EMSLFC
0805AC                     MOVELSLML      EMSLML
0805AC                     MOVELSLNO      EMSLNO
0805AC                     MOVELSLRK      EMSLRK
0805AC                     MOVELBYID      EMBYID
0805AC                     MOVELBYNM      EMBYNM
0805AC                     MOVELBYAS      EMBYAS
0805AC                     MOVELBYPE      EMBYPE
0805AC                     MOVELBYTL      EMBYTL
0805AC                     MOVELBYFC      EMBYFC
0805AC                     MOVELBYML      EMBYML
0805AC                     MOVELBYNO      EMBYNO
0805AC                     MOVELBYRK      EMBYRK
0805AC                     MOVELCKNR      EMCKNR
0805AC                     MOVELBURK      EMBURK
0805AC                     MOVELMARK      EMMARK
0805AC                     MOVELCUMK      EMCUMK
0805AC                     MOVELCTEY      EMCTEY
0805AC                     MOVELRLNR      EMRLNR
0805AC                     MOVELINTE      EMINTE
0805AC                     MOVELGRMK      EMGRMK
0805AC                     MOVELDNMK      EMDNMK
0805AC                     MOVELBDCD      EMBDCD
0805AC                     Z-ADDSAMT      EMSAMT
0805AC                     MOVELTXTP      EMTXTP
0805AC                     Z-ADDTXRT      EMTXRT
0805AC                     Z-ADDATAX      EMATAX
0805AC                     Z-ADDAAMT      EMAAMT
0805AC                     Z-ADDDSAT      EMDSAT
0805AC                     Z-ADDOCAT      EMOCAT
0805AC                     Z-ADDEXAT      EMEXAT
0805AC                     MOVELCRRY      EMCRRY
0805AC*
0805AC                     Z-ADDTMDT      EMTMDT
0805AC                     Z-ADDTMTM      EMTMTM
0805AC                     MOVELTMOP      EMTMOP
0805AC                     MOVELTAWS      EMTAWS
0805AC                     MOVELSTCL      EMSTCL
0805AC*
0805AC                     Z-ADDXPDD      EMXPDD
0805AC                     Z-ADDXPDT      EMXPDT
0805AC                     MOVELXUSR      EMXUSR
0805AC                     MOVELMAR1      EMMAR1
0805AC                     MOVELPTYN      EMPTYN
0805AC                     MOVELRADN      EMRADN
0805AC                     MOVELPTAR      EMPTAR
0805AC                     MOVELPTMD      EMPTMD
0805AC                     Z-ADDPTCN      EMPTCN
0805AC*
0805AC                     Z-ADDPTDD      EMPTDD
0805AC                     Z-ADDPTDT      EMPTDT
0805AC                     MOVELPTSR      EMPTSR
0805AC                     MOVELBUMD      EMBUMD
0805AC                     MOVEL'ARP137RC'EMAPNM
0805AC           *DATE     SUB  19000000  EMCHDD
0805AC                     TIME           EMCHDT
0805AC                     MOVELU#USID    EMCUSR
0805AC                     ENDSR
