     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP132RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     INEDTL電子發票明細檔傳輸
     A*            5.DATE-WRITTEN  107/06/29 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     FINEDTL  UP  E                    DISK
     F            RINEDTL                           KRENAMEDTLECD
     FINEDTLP UF  E           K        DISK                      A
     IDTLECD      01
     I              EDFLAG                          FLAG
     I              EDAREA                          AREA
     I              EDMSTE                          MSTE
     I              EDNO                            NO
     I              EDINDT                          INDT
     I              EDINTT                          INTT
     I              EDPDCD                          PDCD
     I              EDQTY                           QTY
     I              EDUNIT                          UNIT
     I              EDUPRC                          UPRC
     I              EDAMT                           AMT
     I              EDSENR                          SENR
     I              EDREMK                          REMK
     I              EDRENR                          RENR
     I              EDTMDT                          TMDT
     I              EDTMTM                          TMTM
     I              EDTMOP                          TMOP
     I              EDTAWS                          TAWS
     I              EDSTCL                          STCL
     I              EDXPDD                          XPDD
     I              EDXPDT                          XPDT
     I              EDXUSR                          XUSR
     I              EDMAR1                          MAR1
     I              EDPROD                          PROD
     I              EDPRNM                          PRNM
     I              EDPTYN                          PTYN
     C*
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           SENR
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C           KEY       CHAINRINEDTL              31
     C                     MOVELFLAG      EDFLAG
     C                     MOVELAREA      EDAREA
     C                     MOVELMSTE      EDMSTE
     C                     MOVELNO        EDNO
     C                     MOVELINDT      EDINDT
     C                     MOVELINTT      EDINTT
     C                     MOVELPDCD      EDPDCD
     C                     Z-ADDQTY       EDQTY
     C                     MOVELUNIT      EDUNIT
     C                     Z-ADDUPRC      EDUPRC
     C                     Z-ADDAMT       EDAMT
     C                     MOVELSENR      EDSENR
     C                     MOVELREMK      EDREMK
     C                     MOVELRENR      EDRENR
     C                     Z-ADDTMDT      EDTMDT
     C                     Z-ADDTMTM      EDTMTM
     C                     MOVELTMOP      EDTMOP
     C                     MOVELTAWS      EDTAWS
     C                     MOVELSTCL      EDSTCL
     C                     Z-ADDXPDD      EDXPDD
     C                     Z-ADDXPDT      EDXPDT
     C                     MOVELXUSR      EDXUSR
     C                     MOVELMAR1      EDMAR1
     C                     MOVELPROD      EDPROD
     C                     MOVELPRNM      EDPRNM
     C                     MOVELPTYN      EDPTYN
     C   31                WRITERINEDTL
     C  N31                UPDATRINEDTL
     C                     MOVE *BLANK    FLAG
     C   11
     COR 12                EXCPTUPD#U
     C   13                EXCPTDEL#U
     ODTLECD  E                UPD#U
     O                         FLAG
     O        EDEL             DEL#U
