     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP112RA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     營業退款檔傳輸作業(ARRETN)－廠區異動
     H*            5.DATE-WRITTEN  93/11/01
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     FARRETN  UP  E           K        DISK
     FARRETNX UF  E           K        DISK                      A
     IRARRETN     01
     I*
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*          KEY   LIST
     C*****************************************************************
     C           K#ARTX    KLIST
     C                     KFLD           AXRTNO
     C                     KFLD           AXITEM
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     C*****************************************************************
     CSR         INISR     BEGSR
     C*****************************************************************
     C  N99                SETON                     99
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           ANFLAG    COMP 'A'                      11
     C           ANFLAG    COMP 'C'                      12
     C           ANFLAG    COMP 'D'                      13
     C*
     C                     MOVELANRTNO    AXRTNO
     C                     Z-ADDANITEM    AXITEM
     C           K#ARTX    CHAINRARRETX              41
     C*
     C                     MOVELANFLAG    AXFLAG           處理代碼
     C                     MOVELANRTNO    AXRTNO           退款編號
     C                     Z-ADDANITEM    AXITEM           退款項次
     C                     MOVELANCUNO    AXCUNO           客戶代號
     C                     MOVELANCUNM    AXCUNM           客戶名稱
     C                     MOVELANORNO    AXORNO           訂單編號
     C                     MOVELANAREA    AXAREA           退款廠區
     C                     MOVELANDECD    AXDECD           刪除碼
     C                     Z-ADDANDEDT    AXDEDT           刪除日期
     C                     MOVELANDC      AXDC             借貸方
     C                     MOVELANUSTP    AXUSTP           款項別
     C                     MOVELANACNO    AXACNO           會計科目
     C                     MOVELANDPNO    AXDPNO           部門代號
     C                     MOVELANRLNO    AXRLNO           相關號碼
     C                     Z-ADDANDUDT    AXDUDT           到期日
     C                     MOVELANCSNM    AXCSNM           對象別
     C                     MOVELANDSC1    AXDSC1           摘要
     C                     MOVELANDSC2    AXDSC2           輔助摘要
     C                     MOVELANSAID    AXSAID           領款人
     C                     MOVELANRTUS    AXRTUS           退款人員
     C                     Z-ADDANRTDT    AXRTDT           退款日期
     C                     Z-ADDANRTTM    AXRTTM           退款時間
     C                     Z-ADDANAAMT    AXAAMT           退款金額
     C                     MOVELANFL01    AXFL01           營業確認碼
     C                     MOVELANCFUS    AXCFUS           營業確認人員
     C                     Z-ADDANCFDT    AXCFDT           營業確認日期
     C                     MOVELANFL02    AXFL02           營業列印碼
     C                     MOVELANRESV    AXRESV           預留
     C*
     C   41                WRITERARRETX
     C  N41                UPDATRARRETX
     C*
     C                     MOVEL*BLANK    ANFLAG
     C   11
     COR 12                UPDATRARRETN
     C   13                DELETRARRETN
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         LRSR      BEGSR
     C*****************************************************************
     C*
     CSR                   ENDSR
