     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP139RC
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     ¥x¥_INEDINT-->®ç¶é¡B­]®ß¡B°ª¶¯
     A*            5.DATE-WRITTEN  107/12/07 2018AR00031
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     FINEDINT UP  E           K        DISK
     F            RINEDIN                           KRENAMEDINECD
     FINEDIN  UF  E           K        DISK                      A
     IDINECD      01
     I              DNFLAG                          FLAG
     I              DNAREA                          AREA
     I              DNMSTE                          MSTE
     I              DNNO                            NO
     I              DNINDT                          INDT
     I              DNBYID                          BYID
     I              DNSLID                          SLID
     I              DNDEDT                          DEDT
     I              DNDETM                          DETM
     I              DNCLRN                          CLRN
     I              DNRTDN                          RTDN
     I              DNREMK                          REMK
     I              DNTMDT                          TMDT
     I              DNTMTM                          TMTM
     I              DNTMOP                          TMOP
     I              DNTAWS                          TAWS
     I              DNSTCL                          STCL
     I              DNXPDD                          XPDD
     I              DNXPDT                          XPDT
     I              DNXUSR                          XUSR
     I              DNMAR1                          MAR1
     I              DNPTYN                          PTYN
     I           UDS
     I                                        6   6 AREA
     C           KEY       KLIST
     C                     KFLD           NO
     C*
     C                     MOVEA'0000'    *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           KEY       CHAINRINEDIN              31
     C                     EXSR MOVE1
     C           *IN31     IFEQ '1'
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     WRITERINEDIN
     C                     END
     C                     END
     C           *IN31     IFEQ '0'
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     UPDATRINEDIN
     C                     END
     C                     END
     C*
     C                     DELETDINECD
     C*
     C****************************************************************
     C           MOVE1     BEGSR
     C****************************************************************
     C                     Z-ADDTMDT      DNTMDT
     C                     Z-ADDTMTM      DNTMTM
     C                     MOVELTMOP      DNTMOP
     C                     MOVELTAWS      DNTAWS
     C                     MOVELSTCL      DNSTCL
     C                     ENDSR
