     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP112RB
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     營業退款檔傳輸作業(ARRETN)－抓廠區
     H*            5.DATE-WRITTEN  93/11/01
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     FARRETNX IP  E           K        DISK
     FARRETN  UF  E           K        DISK                      A
     IRARRETX     01
     I*
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*         KEY    LIST
     C*****************************************************************
     C           K#ARTN    KLIST
     C                     KFLD           ANRTNO
     C                     KFLD           ANITEM
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     C*****************************************************************
     CSR         INISR     BEGSR
     C*****************************************************************
     C  N99                SETON                     99
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           AXFLAG    COMP 'A'                      11
     C           AXFLAG    COMP 'C'                      12
     C           AXFLAG    COMP 'D'                      13
     C*
     C                     MOVELAXRTNO    ANRTNO
     C                     MOVELAXITEM    ANITEM
     C           K#ARTN    CHAINRARRETN              40
     C*
     C                     MOVELAXFLAG    ANFLAG           處理代碼
     C                     MOVELAXRTNO    ANRTNO           退款編號
     C                     Z-ADDAXITEM    ANITEM           退款項次
     C                     MOVELAXCUNO    ANCUNO           客戶代號
     C                     MOVELAXCUNM    ANCUNM           客戶名稱
     C                     MOVELAXORNO    ANORNO           訂單編號
     C                     MOVELAXAREA    ANAREA           退款廠區
     C                     MOVELAXDECD    ANDECD           刪除碼
     C                     Z-ADDAXDEDT    ANDEDT           刪除日期
     C                     MOVELAXDC      ANDC             借貸方
     C                     MOVELAXUSTP    ANUSTP           款項別
     C                     MOVELAXACNO    ANACNO           會計科目
     C                     MOVELAXDPNO    ANDPNO           部門代號
     C                     MOVELAXRLNO    ANRLNO           相關號碼
     C                     Z-ADDAXDUDT    ANDUDT           到期日
     C                     MOVELAXCSNM    ANCSNM           對象別
     C                     MOVELAXDSC1    ANDSC1           摘要
     C                     MOVELAXDSC2    ANDSC2           輔助摘要
     C                     MOVELAXSAID    ANSAID           領款人
     C                     MOVELAXRTUS    ANRTUS           退款人員
     C                     Z-ADDAXRTDT    ANRTDT           退款日期
     C                     Z-ADDAXRTTM    ANRTTM           退款時間
     C                     Z-ADDAXAAMT    ANAAMT           退款金額
     C                     MOVELAXFL01    ANFL01           營業確認碼
     C                     MOVELAXCFUS    ANCFUS           營業確認人員
     C                     Z-ADDAXCFDT    ANCFDT           營業確認日期
     C                     MOVELAXFL02    ANFL02           營業列印碼
     C                     MOVELAXFL03    ANFL03           過入製票碼
     C                     MOVELAXTRUS    ANTRUS           過入人員
     C                     Z-ADDAXTRDT    ANTRDT           過入日期
     C                     MOVELAXGLNO    ANGLNO           製票號碼
     C                     MOVELAXRESV    ANRESV           預留
     C*
     C           *IN40     IFEQ '1'                        不存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     WRITERARRETN
     C                     ENDIF
     C*
     C                     ELSE                            已存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     UPDATRARRETN
     C                     ENDIF
     C           *IN13     IFEQ '1'                        要刪除
     C                     DELETRARRETN
     C                     ENDIF
     C                     ENDIF
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         LRSR      BEGSR
     C*****************************************************************
     C*
     CSR                   ENDSR
     C*****************************************************************
