     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP145RA
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     台北INESEQ-->INESEQT
     A*            5.DATE-WRITTEN  107/12/20 2018AR00039
     A*            6.UPDATE  DATE  110/12/21 2021AR00047 S00WCJ (1012A)
     A*                             增加廠區I
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINESEQ  UP  E           K        DISK
     F            RINESEQ                           KRENAMESEQECD
     FINESEQT UF  E           K        DISK                      A
     ISEQECD      01
     I              SQFLAG                          FLAG
     I              SQYY                            YY
     I              SQYYMM                          YYMM
     I              SQINTK                          INTK
     I              SQINBN                          INBN
     I              SQINEN                          INEN
     I              SQFACT                          FACT
     I              SQINB1                          INB1
     I              SQINE1                          INE1
     I              SQENTM                          ENTM
     I              SQENTD                          ENTD
     I              SQENTT                          ENTT
     I              SQUPDM                          UPDM
     I              SQUPDD                          UPDD
     I              SQUPDT                          UPDT
     C           KEY       KLIST
     C                     KFLD           YY
     C                     KFLD           YYMM
     C                     KFLD           FACT
     C*
     C                     MOVEA'000'     *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           KEY       CHAINRINESEQ              32
     C                     EXSR MOVE1
     C           *IN32     IFEQ '1'
     C           FACT      IFEQ 'U'
     C           FACT      OREQ 'H'
     C           FACT      OREQ 'K'
1012AC           FACT      OREQ 'I'
     C                     WRITERINESEQ
     C                     END
     C                     END
     C*
     C           *IN32     IFEQ '0'
     C           FACT      IFEQ 'U'
     C           FACT      OREQ 'H'
     C           FACT      OREQ 'K'
1012AC           FACT      OREQ 'I'
     C                     UPDATRINESEQ
     C                     END
     C                     END
     C*
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVE ' '       FLAG
     C                     UPDATSEQECD
     C                     END
     C           *IN13     IFEQ '1'
     C                     DELETSEQECD
     C                     END
     C**************************************************************
     C           MOVE1     BEGSR
     C                     MOVELFLAG      SQFLAG
     C                     Z-ADDYY        SQYY
     C                     MOVELYYMM      SQYYMM
     C                     MOVELINTK      SQINTK
     C                     MOVELINBN      SQINBN
     C                     MOVELINEN      SQINEN
     C                     MOVELFACT      SQFACT
     C                     MOVELINB1      SQINB1
     C                     MOVELINE1      SQINE1
     C                     MOVELENTM      SQENTM
     C                     Z-ADDENTD      SQENTD
     C                     Z-ADDENTT      SQENTT
     C                     MOVELUPDM      SQUPDM
     C                     Z-ADDUPDD      SQUPDD
     C                     Z-ADDUPDT      SQUPDT
     C                     ENDSR
