     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP140RC
     A*            2.PROGRAM-TYPE  RPG
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     台北INETRNT-->桃園、苗栗、高雄
     A*            5.DATE-WRITTEN  107/12/07 2018AR00031
     A*            6.UPDATE  DATE  107/12/14 2018AR00038 S00WCJ (0712A)
     A*                             增加列印日期、列印時間、列印人員
     A*                             列印廠區
     A*                            107/12/24 S00WCJ (0712B)
     A*                            增加確認碼、確認日期、確認時間、確
     A*                            認人員
     A*                            108/05/09 S00WCJ (0805A)
     A*                             增加寫入LOG檔
     A*
     A*****************************************************************
     H            Y                                     1                 BR100
     FINETRNT UP  E           K        DISK
     F            RINETRN                           KRENAMETRNECD
     FINETRN  UF  E           K        DISK                      A
0805AFINETRNG O   E           K        DISK
0805AF            RINETRN                           KRENAMETRNG
     ITRNECD      01
     I              TRFLAG                          FLAG
     I              TRAREA                          AREA
     I              TRMSTE                          MSTE
     I              TRNO                            NO
     I              TRINDT                          INDT
     I              TRSLID                          SLID
     I              TRSLNM                          SLNM
     I              TRSLAS                          SLAS
     I              TRSLPE                          SLPE
     I              TRSLTL                          SLTL
     I              TRSLFC                          SLFC
     I              TRSLML                          SLML
     I              TRSLNO                          SLNO
     I              TRSLRK                          SLRK
     I              TRBYID                          BYID
     I              TRBYNM                          BYNM
     I              TRBYAS                          BYAS
     I              TRBYPE                          BYPE
     I              TRBYTL                          BYTL
     I              TRBYFC                          BYFC
     I              TRBYML                          BYML
     I              TRBYNO                          BYNO
     I              TRBYRK                          BYRK
     I              TRALTE                          ALTE
     I              TROIND                          OIND
     I              TROINO                          OINO
     I              TROISN                          OISN
     I              TRPDCD                          PDCD
     I              TRQTY                           QTY
     I              TRUNIT                          UNIT
     I              TRUPRC                          UPRC
     I              TRAMT                           AMT
     I              TRTAX                           TAX
     I              TRSENR                          SENR
     I              TRTXTP                          TXTP
     I              TRATAX                          ATAX
     I              TRAAMT                          AAMT
     I              TRTMDT                          TMDT
     I              TRTMTM                          TMTM
     I              TRTMOP                          TMOP
     I              TRTAWS                          TAWS
     I              TRSTCL                          STCL
     I              TRXPDD                          XPDD
     I              TRXPDT                          XPDT
     I              TRXUSR                          XUSR
     I              TRMAR1                          MAR1
     I              TRPTYN                          PTYN
0712AI              TRPTDD                          PTDD
0712AI              TRPTDT                          PTDT
0712AI              TRPTSR                          PTSR
0712AI              TRPTAR                          PTAR
0712BI              TRCNYN                          CNYN
0712BI              TRCNDD                          CNDD
0712BI              TRCNDT                          CNDT
0712BI              TRCNSR                          CNSR
     I           UDS
     I                                        6   6 AREA
0805AI                                     10011010 U#USID
     C           KEY       KLIST
     C                     KFLD           NO
     C                     KFLD           SENR
     C*
     C                     MOVEA'0000'    *IN,11
     C           FLAG      COMP 'A'                      11
     C           FLAG      COMP 'C'                      12
     C           FLAG      COMP 'D'                      13
     C*
     C           KEY       CHAINRINETRN              31
     C                     EXSR MOVE1
     C           *IN31     IFEQ '1'
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     WRITERINETRN
0805AC                     EXSR MOVE2
0805AC                     WRITETRNG
     C                     END
     C                     END
     C           *IN31     IFEQ '0'
     C           *IN11     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     UPDATRINETRN
0805AC                     EXSR MOVE2
0805AC                     WRITETRNG
     C                     END
     C                     END
     C*
     C                     DELETTRNECD
     C*
     C****************************************************************
     C           MOVE1     BEGSR
     C****************************************************************
     C                     Z-ADDTMDT      TRTMDT
     C                     Z-ADDTMTM      TRTMTM
     C                     MOVELTMOP      TRTMOP
     C                     MOVELTAWS      TRTAWS
     C                     MOVELSTCL      TRSTCL
     C                     ENDSR
     C**************************************************************
0805AC           MOVE2     BEGSR
     C**************************************************************
0805AC                     MOVELFLAG      TRFLAG
0805AC                     MOVELAREA      TRAREA
0805AC                     MOVELMSTE      TRMSTE
0805AC                     MOVELNO        TRNO
0805AC                     MOVELINDT      TRINDT
0805AC                     MOVELSLID      TRSLID
0805AC                     MOVELSLNM      TRSLNM
0805AC                     MOVELSLAS      TRSLAS
0805AC                     MOVELSLPE      TRSLPE
0805AC                     MOVELSLTL      TRSLTL
0805AC                     MOVELSLFC      TRSLFC
0805AC                     MOVELSLML      TRSLML
0805AC                     MOVELSLNO      TRSLNO
0805AC                     MOVELSLRK      TRSLRK
0805AC                     MOVELBYID      TRBYID
0805AC                     MOVELBYNM      TRBYNM
0805AC                     MOVELBYAS      TRBYAS
0805AC                     MOVELBYPE      TRBYPE
0805AC                     MOVELBYTL      TRBYTL
0805AC                     MOVELBYFC      TRBYFC
0805AC                     MOVELBYML      TRBYML
0805AC                     MOVELBYNO      TRBYNO
0805AC                     MOVELBYRK      TRBYRK
0805AC                     MOVELALTE      TRALTE
0805AC                     MOVELOIND      TROIND
0805AC                     MOVELOINO      TROINO
0805AC                     MOVELOISN      TROISN
0805AC                     MOVELPDCD      TRPDCD
0805AC                     Z-ADDQTY       TRQTY
0805AC                     MOVELUNIT      TRUNIT
0805AC                     Z-ADDUPRC      TRUPRC
0805AC                     Z-ADDAMT       TRAMT
0805AC                     Z-ADDTAX       TRTAX
0805AC                     MOVELSENR      TRSENR
0805AC                     MOVELTXTP      TRTXTP
0805AC                     Z-ADDATAX      TRATAX
0805AC                     Z-ADDAAMT      TRAAMT
0805AC                     Z-ADDTMDT      TRTMDT
0805AC                     Z-ADDTMTM      TRTMTM
0805AC                     MOVELTMOP      TRTMOP
0805AC                     MOVELTAWS      TRTAWS
0805AC                     MOVELSTCL      TRSTCL
0805AC                     Z-ADDXPDD      TRXPDD
0805AC                     Z-ADDXPDT      TRXPDT
0805AC                     MOVELXUSR      TRXUSR
0805AC                     MOVELMAR1      TRMAR1
0805AC                     MOVELPTYN      TRPTYN
0805AC*
0805AC                     Z-ADDPTDD      TRPTDD
0805AC                     Z-ADDPTDT      TRPTDT
0805AC                     MOVELPTSR      TRPTSR
0805AC                     MOVELPTAR      TRPTAR
0805AC                     MOVELCNYN      TRCNYN
0805AC                     Z-ADDCNDD      TRCNDD
0805AC                     Z-ADDCNDT      TRCNDT
0805AC                     MOVELCNSR      TRCNSR
0805AC*
0805AC                     MOVEL'ARP140RC'TRAPNM
0805AC           *DATE     SUB  19000000  TRCHDD
0805AC                     TIME           TRCHDT
0805AC                     MOVELU#USID    TRCUSR
0805AC                     ENDSR
