     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP114RA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     發票作廢記錄明細檔傳輸作業－廠區異動
     H*            5.DATE-WRITTEN  94/01/06
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     FDELDTL  UP  E           K        DISK
     FDELDTLX UF  E           K        DISK                      A
     IRDELDTL     01
     I*
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*          KEY   LIST
     C*****************************************************************
     C           K#DTLX    KLIST
     C                     KFLD           DYIVNO
     C                     KFLD           DYWTNO
     C                     KFLD           DYITEM
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     C*****************************************************************
     CSR         INISR     BEGSR
     C*****************************************************************
     C  N99                SETON                     99
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           DLFLAG    COMP 'A'                      11
     C           DLFLAG    COMP 'C'                      12
     C           DLFLAG    COMP 'D'                      13
     C*
     C                     MOVELDLIVNO    DYIVNO
     C                     MOVELDLWTNO    DYWTNO
     C                     Z-ADDDLITEM    DYITEM
     C           K#DTLX    CHAINRDELDTLX             41
     C                     MOVELDLFLAG    DYFLAG
     C                     MOVELDLIVNO    DYIVNO
     C                     MOVELDLWTNO    DYWTNO
     C                     Z-ADDDLITEM    DYITEM
     C                     MOVELDLDECD    DYDECD
     C                     Z-ADDDLDEDT    DYDEDT
     C                     MOVELDLAREA    DYAREA
     C                     Z-ADDDLINDT    DYINDT
     C                     MOVELDLPDN1    DYPDN1
     C                     Z-ADDDLQTY1    DYQTY1
     C                     Z-ADDDLPRC1    DYPRC1
     C                     Z-ADDDLAMT1    DYAMT1
     C                     MOVELDLPDN2    DYPDN2
     C                     Z-ADDDLQTY2    DYQTY2
     C                     Z-ADDDLPRC2    DYPRC2
     C                     Z-ADDDLAMT2    DYAMT2
     C                     Z-ADDDLTAX2    DYTAX2
     C                     Z-ADDDLAAMT    DYAAMT
     C                     Z-ADDDLQTY3    DYQTY3
     C                     Z-ADDDLPRC3    DYPRC3
     C                     Z-ADDDLAMT3    DYAMT3
     C                     MOVELDLUPUS    DYUPUS
     C                     Z-ADDDLUPDT    DYUPDT
     C                     Z-ADDDLUPTM    DYUPTM
     C*
     C   41                WRITERDELDTLX
     C  N41                UPDATRDELDTLX
     C*
     C                     MOVEL*BLANK    DLFLAG
     C   11
     COR 12                UPDATRDELDTL
     C   13                DELETRDELDTL
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         LRSR      BEGSR
     C*****************************************************************
     C*
     CSR                   ENDSR
