     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP113RB
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     發票作廢記錄主檔傳輸作業－抓廠區
     H*            5.DATE-WRITTEN  94/01/04
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     FDELMSTX IP  E           K        DISK
     FDELMST  UF  E           K        DISK                      A
     IRDELMSTX    01
     I*
     I           UDS
     I*                                    10211021 U#AREA
     I                                      301 301 U#AREA
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     C*****************************************************************
     CSR         INISR     BEGSR
     C*****************************************************************
     C  N99                SETON                     99
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C           DXAREA    IFEQ U#AREA
     C*
     C           DXFLAG    COMP 'A'                      11
     C           DXFLAG    COMP 'C'                      12
     C           DXFLAG    COMP 'D'                      13
     C*
     C           DXINNO    CHAINRDELMST              40
     C*
     C                     MOVELDMFLAG    DXFLAG           處理代碼
     C                     MOVELDMINNO    DXINNO           發票號碼
     C                     Z-ADDDMINDT    DXINDT           發票日期
     C                     MOVELDMAREA    DXAREA           廠區
     C                     MOVELDMDECD    DXDECD           作廢碼
     C                     Z-ADDDMDEDT    DXDEDT           作廢日期
     C                     MOVELDMCUN1    DXCUN1           原客戶代號
     C                     MOVELDMCUM1    DXCUM1           原客戶名稱
     C                     MOVELDMORN1    DXORN1           原訂單編號
     C                     Z-ADDDMAAMT    DXAAMT           原出貨金額
     C                     Z-ADDDMATAX    DXATAX           原出貨稅額
     C                     Z-ADDDMBAMT    DXBAMT           原扣預收金額
     C                     Z-ADDDMNBAL    DXNBAL           原未收餘額
     C                     MOVELDMCODE    DXCODE           承購發票
     C                     MOVELDMDLNO    DXDLNO           作廢申請單號
     C                     MOVELDMRVID    DXRVID           作廢申請業務員
     C                     MOVELDMDESP    DXDESP           異常原因說明
     C                     MOVELDMCUN2    DXCUN2           新客戶編號
     C                     MOVELDMCUM2    DXCUM2           新客戶名稱
     C                     MOVELDMORN2    DXORN2           新訂單編號
     C                     MOVELDMAPUS    DXAPUS           申請人員
     C                     Z-ADDDMAPDT    DXAPDT           申請日期
     C                     Z-ADDDMAPTM    DXAPTM           申請時間
     C                     MOVELDMUPUS    DXUPUS           異動人員
     C                     Z-ADDDMUPDT    DXUPDT           異動日期
     C                     Z-ADDDMUPTM    DXUPTM           異動時間
     C*
     C           *IN40     IFEQ '1'                        不存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     WRITERDELMST
     C                     ENDIF
     C*
     C                     ELSE                            已存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     UPDATRDELMST
     C                     ENDIF
     C           *IN13     IFEQ '1'                        要刪除
     C                     DELETRDELMST
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         LRSR      BEGSR
     C*****************************************************************
     C*
     CSR                   ENDSR
     C*****************************************************************
