     H            Y                                     1                 BR100
     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP111RA
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     客戶暫收統計檔上傳台北─抓廠區
     H*            5.DATE-WRITTEN  93/09/17
     H*            6.DATE-UPDATE   99/02/08 2010AR434 S00WCJ (9902A)
     H*
     H*****************************************************************
     FAR2159DPIP  E           K        DISK
     F            RAR2159D                          KRENAMERAR2159
     FAR2159D UF  E           K        DISK                      A
     I*****************************************************************
     IRAR2159     01
     I              ADFLAG                          F#FLAG
     I              ADCUNO                          F#CUNO
     I              ADAREA                          F#AREA
     I              ADORNO                          F#ORNO
     I              ADAMT1                          F#AMT1
     I              ADAMT2                          F#AMT2
     I              ADAMT3                          F#AMT3
     I              ADAMT4                          F#AMT4
     I              ADAMT5                          F#AMT5
     I              ADAMT6                          F#AMT6
     I              ADRESV                          F#RESV
9902AI              ADAMT7                          F#AMT7
9902AI              ADAMT8                          F#AMT8
9902AI              ADAMT9                          F#AMT9
9902AI              ADAM10                          F#AM10
     I*
     I           UDS
     I                                     10211021 U#AREA
     C*****************************************************************
     C*        主程式開始
     C*****************************************************************
     C  N99                EXSR INISR
     C  N99                SETON                     99
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     CLRN99                EXSR MSGSR
     C*
     C*********************************
     C*  初始程式
     C*********************************
     CSR         INISR     BEGSR
     C           K#2159    KLIST
     C                     KFLD           ADCUNO
     C                     KFLD           ADAREA
     C                     KFLD           ADORNO
     CSR                   ENDSR
     C*
     C*********************************
     C*  DETAIL TIME 函式
     C*********************************
     CSR         DTLSR     BEGSR
     C           F#FLAG    COMP 'A'                      11
     C           F#FLAG    COMP 'C'                      12
     C           F#FLAG    COMP 'D'                      13
     C*
     C                     MOVELF#CUNO    ADCUNO
     C                     MOVELF#AREA    ADAREA
     C                     MOVELF#ORNO    ADORNO
     C           K#2159    CHAINRAR2159D             69
     C*
     C                     MOVELF#FLAG    ADFLAG
     C                     MOVELF#CUNO    ADCUNO
     C                     MOVELF#AREA    ADAREA
     C                     MOVELF#ORNO    ADORNO
     C                     Z-ADDF#AMT1    ADAMT1
     C                     Z-ADDF#AMT2    ADAMT2
     C                     Z-ADDF#AMT3    ADAMT3
     C                     Z-ADDF#AMT4    ADAMT4
     C                     Z-ADDF#AMT5    ADAMT5
     C                     Z-ADDF#AMT6    ADAMT6
     C                     MOVELF#RESV    ADRESV
9902AC                     Z-ADDF#AMT7    ADAMT7
9902AC                     Z-ADDF#AMT8    ADAMT8
9902AC                     Z-ADDF#AMT9    ADAMT9
9902AC                     Z-ADDF#AM10    ADAM10
     C*
     C           *IN69     IFEQ '1'                        不存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     WRITERAR2159D
     C                     ENDIF
     C*
     C                     ELSE                            已存在
     C           *IN11     IFEQ '1'                        要存在
     C           *IN12     OREQ '1'
     C                     UPDATRAR2159D
     C                     ENDIF
     C           *IN13     IFEQ '1'                        要刪除
     C                     DELETRAR2159D
     C                     ENDIF
     C                     ENDIF
     C*
     CSR                   ENDSR
     C*********************************
     C*  LR 函式  印核覆
     C*********************************
     CSR         LRSR      BEGSR
     CSR                   ENDSR
     C*
     C*********************************
     C*  查無資料函式
     C*********************************
     CSR         MSGSR     BEGSR
     CSR                   ENDSR
     C*
     C*****************************************************************
