     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP105R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     修正INVDTL稅額＝５，類別碼＜＞Ｚ的訂單編號
     H*            5.DATE-WRITTEN  92/10/16
     H*            6.DATE-MODIFY
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FINVDTL  UP  E           K        DISK
     FINVMST  IF  E           K        DISK
     IIVREC       01
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           IVNO      CHAININREC                40
     C           *IN40     IFEQ *OFF
     C                     MOVEL'C'       IVFLAG
     C                     MOVELINORNO    IVORNO
     C                     UPDATIVREC
     C                     ENDIF
     C*
     C                     ENDSR
