     H*****************************************************************
     H*               >>   PROGRAM INTRODUCTION   <<
     H*            1.PROGRAM-ID    HSP930R1參照SAP42R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00LCL
     H*            4.FUNCTION      CALL HOYA傳送郵件
     H*            5.DATE-WRITTEN  105/05/04 S00LCL 2016HS267
     H*****************************************************************
     H        1   Y                                     1
     E                    MAIL    1   3 50
     I*電子郵件主旨（傳送使用者成功）
     I            DS
     I                                        1 100 WMALTM
     I I            '<'                       1   1 MMSG01
     I                                        2   4 D#AREA
     I I            '>'                       5   5 MMSG02
     I                                        6  15 D#CUSR
0505AI I            'PC上送報表'           16  28 MMSG03
0505AI                                       29  38 D#FILE
0505AI I            '到您AS400-            39 100 MMSG04
     I              '報表槽，請查核！-
     I              '（無內文）'
     I*電子郵件主旨（傳送使用者成功-有錯誤清單)
     I            DS
     I                                        1 100 WMALT1
     I I            '<'                       1   1 MMSG11
     I                                        2   4 D1AREA
     I I            '>'                       5   5 MMSG12
     I                                        6  15 D1CUSR
     I I            'PC上送報表'           16  28 MMSG13
     I                                       29  38 D1FILE
     I I            '到您AS400-            39 100 MMSG14
     I              '報表槽，有錯誤-
     I              '請查核！-
     I              '（無內文）'
     I*電子郵件主旨（傳送使用者不成功）
     I            DS
     I                                        1 100 WMALT2
     I I            '<'                       1   1 MMSG21
     I                                        2   4 D2AREA
     I I            '>'                       5   5 MMSG22
     I                                        6  15 D2CUSR
0505AI I            '無法上送報表'         16  29 MMSG23
0505AI                                       30  39 D2FILE
0505AI I            '到AS400-              40 100 MMSG24
     I              '報表槽，請通知-
     I              '系工部處理！-
     I              '（無內文）'
     I*電子郵件主旨（傳送維護者不成功）SNDNETSPLF DIRE NO SET OR JOB ERR
     I            DS
     I                                        1 100 WMALT3
     I I            '<'                       1   1 MMSG31
     I                                        2   4 D3AREA
     I I            '>'                       5   5 MMSG32
     I                                        6  15 D3CUSR
     I I            '無法上送報表'         16  29 MMSG33
     I                                       30  39 D3FILE
     I I            '到AS400'              40  52 MMSG35
     I                                       53  62 D3TUSR
     I                                       63  72 D3TADR
     I I            'CHK DIRE?-              73 100 MMSG34
     I              'OR JOB?-
     I              '（無內文）'
     I*電子郵件主旨（傳送維護者不成功）E-MAIL NO SET
     I            DS
     I                                        1 100 WMALT4
     I I            '<'                       1   1 MMSG41
     I                                        2   4 D4AREA
     I I            '>'                       5   5 MMSG42
     I                                        6  15 D4CUSR
     I I            '帳號E-Mail-           16  55 MMSG43
     I              '未設定，請到-
0505AI              'AS400修改'
0505AI                                       56  65 D4FILE
0505AI I            '程式將E-Mail-         66 100 MMSG44
     I              '設定-
     I              '（無內文）'
     I*說明１
     I            DS
     I                                        1 200 WMALDS
     I*說明２
     I            DS
     I                                        1 200 WMALD2
     I*說明３
     I            DS
     I                                        1 200 WMALD3
     I           UDS
     I                                       12  12 W#ER
     C*****************************************************************
     C*          Parameter List
     C*****************************************************************
     C*
     C           *ENTRY    PLIST
     C                     PARM           P#USR  10
     C                     PARM           P#CUSR 10
     C                     PARM           P#TUSR 10
     C                     PARM           P#TADR 10
     C                     PARM           P#TEML 50
     C                     PARM           P#ERR   1        *Y=ERR N=NO ERR
0505AC                     PARM           P#FILE  7        *報表名稱 ERR
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C*電子郵件主旨
     C                     MOVELP#TADR    D#AREA           *HOST ID
     C                     MOVELP#CUSR    D#CUSR           *CUR USER
0505AC                     MOVELP#FILE    D#FILE           *報表名
     C*
     C                     MOVELP#TADR    D1AREA           *HOST ID
     C                     MOVELP#CUSR    D1CUSR           *CUR USER
0505AC                     MOVELP#FILE    D1FILE           *報表名
     C*
     C                     MOVELP#TADR    D2AREA           *HOST ID
     C                     MOVELP#CUSR    D2CUSR           *CUR USER
0505AC                     MOVELP#FILE    D2FILE           *報表名
     C*
     C                     MOVELP#TADR    D3AREA           *HOST ID
     C                     MOVELP#CUSR    D3CUSR           *CUR USER
     C                     MOVELP#TUSR    D3TUSR           *TO USER
     C                     MOVELP#TADR    D3TADR           *TO ADDR
0505AC                     MOVELP#FILE    D3FILE           *報表名
     C*
     C                     MOVELP#TADR    D4AREA           *HOST ID
     C                     MOVELP#CUSR    D4CUSR           *CUR USER
0505AC                     MOVELP#FILE    D4FILE           *報表名
     C*
     C*說明１
     C*                    MOVEL'說明１'WMALDS
     C*說明２
     C*                    MOVEL'說明２'WMALD2
     C*說明３
     C*                    MOVEL'說明３'WMALD3
     C*
     C*送件者郵件地址(指定無效,固定地址)
     C*                    MOVELMAIL,1    WSNMIL 50
     C*收件者郵件地址(只能輸入一個地址)
     C                     MOVELP#TEML    WMALAD 50
     C*知會者郵件地址(指定地址,無動作) *
     C*                    MOVELMAIL,3    WCCADR 50
     C*
     C*
     C* E-MAIL CHECK
     C           P#TEML    IFEQ *BLANKS                    *E-MAIL NO SET
     C*傳送維護者不成功(S00TPC)
     C                     MOVELMAIL,1    WMALAD 50
     C                     CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALT4    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*
     C*傳送維護者不成功(S00LCL)
     C                     MOVELMAIL,2    WMALAD 50
     C                     CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALT4    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*
     C                     ELSE                            *E-MAIL SET
     C*PC端已有發MAIL通知USER,暫不再發給USER
     C* IN50=ON才發送MAIL
     C           P#TUSR    COMP 'S00TPC'                 50*管理者
     C  N50      P#TUSR    COMP 'S00WCJ'                 50
     C  N50      P#TUSR    COMP 'S00LCL'                 50
     C  N50      P#TUSR    COMP 'S04LHI'                 50*PC管理者
     C*
     C           P#ERR     IFEQ 'N'                        *N=NO ERR
     C*傳送使用者成功
     C*有錯誤清單
     C*有錯誤清單發送所有相關人員
     C           W#ER      IFEQ 'Y'
     C                     CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALT1    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*無錯誤清單
     C                     ELSE
     C   50                CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALTM    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*
     C                     ENDIF
     C*
     C                     ELSE                            *Y=ERR
     C*傳送使用者不成功
     C                     CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALT2    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*傳送維護者不成功(S00TPC)
     C                     MOVELMAIL,1    WMALAD 50
     C                     CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALT3    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*
     C*傳送維護者不成功(S00WCJ)
     C                     MOVELMAIL,2    WMALAD 50
     C                     CALL 'APSNDMA2'                 *HOYA傳送郵件
     C                     PARM ' '       SNMAIL 50        *送件者郵件地址
     C                     PARM WMALAD    MAILAD 50        *收件者郵件地址
     C                     PARM ' '       CCADDR 50        *知會者郵件地址
     C                     PARM WMALT3    MAILTM100        *電子郵件主旨
     C                     PARM WMALDS    MAILDS200        *說明１
     C                     PARM WMALD2    MAILD2200        *說明２
     C                     PARM WMALD3    MAILD3200        *說明３
     C                     PARM ' '       SVRID   2        *伺服器代號
     C                     PARM           MSGID  20        *訊息編號（回傳值）
     C*
     C                     ENDIF
     C*
     C                     ENDIF                           *E-MAIL
     C*
     C                     MOVEL*ON       *INLR
** MAIL
s00tpc@tunghosteel.com
s00wcj@tunghosteel.com
s00lcl@tunghosteel.com
