     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP904R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LBU
     H*            5.DATE-WRITTEN  97/11/14
     H*            6.DATE-UPDATE
     H*****************************************************************
     H        1   Y                                     1
     FBHLSMN  UP  E           K        DISK
     F*****************************************************************
     ILSREC       01
     I*
     I            DS
     I                                        1  16 D#BK12
     I                                        1   2 D#LS1
     I                                        3   8 D#LS2
     I                                        9  10 D#LS3
     I                                       11  16 D#LS4
     I*
     I            DS
     I                                        1  16 LSBK12
     I                                        7  12 D#BK4
     I*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           LSBK12    IFEQ *BLANK
     C                     GOTO ENDTSR
     C                     ENDIF
     C*
     C                     MOVEL'00'      D#LS1
     C                     MOVELLSBK12    D#LS2
     C                     MOVEL'00'      D#LS3
     C                     MOVELD#BK4     D#LS4
     C                     MOVELD#BK12    LSBK12
     C                     UPDATLSREC
     C*
     C           ENDTSR    ENDSR
     C*****************************************************************
