     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP900R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            5.DATE-WRITTEN  91/03/18
     H*            6.DATE-UPDATE
     H*****************************************************************
     H        1   Y                                     1
     FTRNDTL  UP  E           K        DISK
     ITXREC       01
     I            DS
     I                                        1   4 D#0E0F
     I                                        1   1 D#0E
     I                                        4   4 D#0F
     I            DS
     I                                        1  10 D#CUNM
     I                                        1   1 D#CUN1
     I                                        2   2 D#CUN2
     I                                        3   3 D#CUN3
     I                                        4   4 D#CUN4
     I                                        5   5 D#CUN5
     I                                        6   6 D#CUN6
     I                                        7   7 D#CUN7
     I                                        8   8 D#CUN8
     I                                        9   9 D#CUN9
     I                                       10  10 D#CUN0
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C*
     C                     MOVE '¡@'    D#0E0F
     C                     MOVE TXCUNM    D#CUNM
     C           D#CUN1    IFEQ D#0E
     C           D#CUN0    ANDNED#0F
     C                     SELEC
     C           D#CUN1    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN1
     C           D#CUN2    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN2
     C           D#CUN3    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN3
     C           D#CUN4    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN4
     C           D#CUN5    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN5
     C           D#CUN6    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN6
     C           D#CUN7    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN7
     C           D#CUN8    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN8
     C           D#CUN9    WHEQ D#0F
     C                     MOVE *BLANK    D#CUN9
     C                     ENDSL
     C                     MOVE D#0F      D#CUN0
     C                     MOVE D#CUNM    TXCUNM
     C                     UPDATTXREC
     C                     ENDIF
     C                     ENDSR
