     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP901R3
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LBU
     H*            5.DATE-WRITTEN  96/08/14
     H*            6.DATE-UPDATE
     H*****************************************************************
     H        1   Y                                     1
     FSARCVF  UP  E           K        DISK
     F*****************************************************************
     ISRREC       01
     I*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     SELEC
     C           SRRVNO    WHEQ 'H60412'
     C                     MOVEL'EH055'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60413'
     C                     MOVEL'EH056'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60414'
     C                     MOVEL'EH057'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60415'
     C                     MOVEL'EH058'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60416'
     C           SRRVNO    OREQ 'H60712'
     C                     MOVEL'EH059'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60417'
     C           SRRVNO    OREQ 'H60418'
     C                     MOVEL'EH060'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60711'
     C           SRRVNO    OREQ 'H60652'
     C                     MOVEL'EH063'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60722'
     C                     MOVEL'EH061'   SRCUNO
     C*
     C           SRRVNO    WHEQ 'H60721'
     C                     MOVEL'EH062'   SRCUNO
     C*
     C                     OTHER
     C                     GOTO ENDTSR
     C                     ENDSL
     C*
     C                     UPDATSRREC
     C*
     C           ENDTSR    ENDSR
     C*****************************************************************
