     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP905R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LBU
     H*            5.DATE-WRITTEN  98/06/24
     H*            6.DATE-UPDATE
     H*****************************************************************
     H        1   Y                                     1
     FGENSEQ  UP  E           K        DISK
     F*****************************************************************
     IGEREC       01
     I*
     I            DS
     I                                        1  10 GEPRIN
     I                                        1   1 D#COD1
     I                                        2   7 D#COD2
     I                                        8  10 D#COD3
     I*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           GEKIND    IFNE '01'
     C           GEKIND    ANDNE'02'
     C                     GOTO ENDTSR
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    W#YYMM  4
     C                     MOVELD#COD2    W#YYMM
     C                     MOVEL'00'      D#COD2
     C                     MOVE W#YYMM    D#COD2
     C                     UPDATGEREC
     C*
     C           ENDTSR    ENDSR
     C*****************************************************************
