     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARP902R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LBU
     H*            5.DATE-WRITTEN  97/11/14
     H*            6.DATE-UPDATE
     H*****************************************************************
     H        1   Y                                     1
     FTRNDTL  UP  E           K        DISK
     F*****************************************************************
     ITXREC       01
     I*
     I            DS
     I                                        1  15 TXRESV
     I                                        1   2 D#YM1
     I                                        3   6 D#YM2
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     Z-ADD0         W#YM    40
     C                     MOVELTXRESV    W#YM
     C*
     C           W#YM      IFLT 7001                       保留年月
     C           W#YM      ORGT 9711
     C                     GOTO ENDTSR
     C                     ENDIF
     C*
     C                     MOVEL'00'      D#YM1            保留年月
     C                     MOVELW#YM      D#YM2
     C                     UPDATTXREC
     C*
     C           ENDTSR    ENDSR
     C*****************************************************************
