     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR069R4
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LYW
     H*            4.FUNCTION     訂單別出貨及發票明細表FOR DOWNLOAD
     H*            5.DATE-WRITTEN  91/07/12
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FTRNDTL  IP  E           K        DISK
     FARR069F1O   E           K        DISK
     I*****************************************************************
     ITXREC
     I                                              TXPCNOL1
     I                                              TXVUNOL1
     I                                              TXCUNOL1
     I                                              TXFL01L1
     I                                              TXRESVL1
     I           UDS
     I                                     10011010 U#USER
     C*****************************************************************
     C*        MAIN  PROGRAM
     C*****************************************************************
     C   L1                CLEARW1REC
     C                     EXSR DTLSR
     CL1                   EXSR L1SR
     CLR                   RETRN
     C*****************************************************************
     CSR         L1SR      BEGSR
     C*****************************************************************
     C           W1QTY     IFNE 0
     C                     WRITEW1REC
     C                     CLEARW1REC
     C                     ENDIF
     C                     ENDSR
     C*****************************************************************
     CSR         DTLSR     BEGSR
     C*****************************************************************
     C*合計ARR069F1 FOR DOWNLOAD
     C*排除預收折讓
     C           TXCODE    IFEQ 'AR06'
     C           TXACNT    ANDEQ'4'
     C                     GOTO DTLEND
     C                     ENDIF
     C           TXCODE    IFEQ 'AR06'
     C           TXFL02    ANDEQ*BLANK
     C                     GOTO DTLEND
     C                     ENDIF
     C*
     C                     MOVELTXPCNO    W#YY    80       年份
     C           W#YY      DIV  10000     W1YY             年份
     C                     MOVELTXVUNO    W#MM    70       月份
     C           W#MM      DIV  100000    W1MM             月份
     C                     MOVE TXCUNO    W1CUNO           客戶代號
     C                     MOVE TXCUNM    W1CUNM           客戶名稱
     C                     MOVELTXORNO    W1ORNO           訂單號碼
     C                     MOVELTXPDNM    W1PDNM           產品別
     C                     MOVELTXNO      W1FACT           產品別
     C*
     C           TXCODE    IFEQ 'SA04'
     C           W1DATS    IFEQ 0
     C                     Z-ADDTXACDT    W1DATS           銷貨起日
     C                     ENDIF
     C*
     C                     Z-ADDTXACDT    W1DATE           銷貨止日
     C                     ENDIF
     C*計算銷售量
     C                     ADD  TXQTY     W1QTY            銷售量
     C                     ADD  TXAMT     W1AMT            銷售金額
     C*
     C           DTLEND    ENDSR
