     H        1   Y                                     1                 BR003
     FARR038S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   3 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           AREAF   1
     C                     PARM           AREAT   1
     C                     PARM           CUNOF   6
     C                     PARM           CUNOT   6
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C                     SELEC
     C           AREA      WHEQ ' '
     C           AREA      WHEQ 'P'
     C           AREA      WHEQ 'T'
     C           AREA      WHEQ 'K'
     C           AREA      WHEQ 'M'
     C           AREA      WHEQ 'H'
     C           AREA      WHEQ 'L'
     C                     OTHER
     C                     SETON                     4199
     C                     MOVELERR,1     ERRMSG
     C                     ENDSL
      **
     C           AREA      IFEQ *BLANK
     C                     MOVE ' '       AREAF
     C                     MOVE 'Z'       AREAT
     C                     ELSE
     C                     MOVE AREA      AREAF
     C                     MOVE AREA      AREAT
     C                     ENDIF
      **
     C           S#CUNO    IFEQ *BLANK
     C                     MOVE '      '  CUNOF
     C                     MOVE '999999'  CUNOT
     C                     ELSE
     C                     MOVE S#CUNO    CUNOF
     C                     MOVE S#CUNO    CUNOT
     C                     ENDIF
      **
     CSR         CK#01Z    ENDSR
     C******
** ERR
¼t°Ï¿ï¾Ü¿ù»~
µo²¼½d³ò¿ù»~
­q³æ½d³ò¿ù»~
