     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR075RS
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CLJ
     H*            4.FUNCTION     新版發票列印作業（畫面）
     H*            5.DATE-WRITTEN  88/03/13
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARR075S CF  E                    WORKSTN
     I*************************************************************
     I           UDS
     I                                        1   8 U#FRDT
     I                                       11  18 U#TODT
     I                                       21  30 U#FRNO
     I                                       31  40 U#TONO
     I*
     I                                      951 985 S#COMP
     I                                     10111020 S#DEVI
     I                                     10011010 S#USID
     I                                     10211021 S#AREA
     C**************************************************************
     C*   程式參數接收區
     C**************************************************************
     C           *ENTRY    PLIST
     C                     PARM           P#IN03  1        結束旗標
     C**************************************************************
     C*   主程式開始
     C**************************************************************
     C                     EXSR SR0000
     C           W#PRID    DOUEQ'00'
     C           W#PRID    CASEQ'01'      SR1000           畫面一
     C                     ENDCS
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
     C**************************************************************
     C*   副程式開始
     C**************************************************************
     C*----------------------------------------
     C*  宣告及初始變數
     C*----------------------------------------
     CSR         SR0000    BEGSR
     C                     MOVEL'01'      W#PRID  2
     C                     EXSR SR1100                     初始畫面一
     CSR                   ENDSR
     C*
     C************************************
     C*  畫面一:輸入日期區間及號碼區間
     C************************************
     CSR         SR1000    BEGSR
     C                     EXFMTAR075F1
     C                     MOVEL*BLANK    S#MSG1
     C*
     C                     SELEC
     C           *IN03     WHEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVEL'1'       P#IN03
     C                     MOVEL'00'      W#PRID
     C*
     C                     OTHER
     C                     MOVEL'0'       P#IN03
     C                     MOVEL'00'      W#PRID
     C                     EXSR SR1200                     存檔
     C                     ENDSL
     CSR                   ENDSR
     C*
     C*----------------------------------------
     C*  初始畫面一
     C*----------------------------------------
     CSR         SR1100    BEGSR
     C                     Z-ADD0         S#FRDT
     C                     Z-ADD0         S#TODT
     C                     MOVEL*BLANK    S#FRNO
     C                     MOVEL*BLANK    S#TONO
     CSR                   ENDSR
     C*
     C*----------------------------------------
     C*  畫面一：存檔執行
     C*----------------------------------------
     CSR         SR1200    BEGSR
     C           S#FRDT    IFEQ 0
     C                     MOVEL*BLANK    U#FRDT
     C                     ELSE
     C                     MOVE S#FRDT    U#FRDT
     C                     ENDIF
     C           S#TODT    IFEQ 0
     C                     MOVELU#FRDT    U#TODT
     C                     ELSE
     C                     MOVE S#TODT    U#TODT
     C                     ENDIF
     C*
     C                     MOVELS#FRNO    U#FRNO
     C           S#TONO    IFEQ *BLANK
     C                     MOVELU#FRNO    U#TONO
     C                     ELSE
     C                     MOVELS#TONO    U#TONO
     C                     ENDIF
     CSR                   ENDSR
     C*
     C**************************************************************
