     H        1   Y                                     1                 BR003
     FARR043S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1  13 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           START   1
     C                     PARM           END     1
     C                     PARM           AREA    1
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C****
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C                     SELEC
     C           AREA      WHEQ ' '
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'P'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'T'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'K'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'M'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'H'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C                     OTHER
     C                     SETON                     4199
     C                     MOVE ERR,1     ERRMSG
     C                     ENDSL
     C******
     C*          SALE2     IFEQ ' '
     C*                    MOVE END       SALE2
     C*                    END
     C*****
     C*          SALE1     IFEQ ' '
     C*                    MOVE START     SALE1
     C*                    END
     C*****
     C           SALE1     IFGT SALE2
     C                     SETON                     424399
     C                     MOVE ERR,2     ERRMSG
     C                     ENDIF
     C****
     C           AREA      IFNE ' '
     C           SALE1     ANDNE' '
     C           AREA      ORNE ' '
     C           SALE2     ANDNE' '
     C                     SETON                     424399
     C                     MOVE ERR,3     ERRMSG
     C                     ENDIF
     C***
     C           SALE1     IFNE ' '
     C           SALE2     ORNE ' '
     C                     MOVE SALE1     START
     C                     MOVE SALE2     END
     C                     ENDIF
     C****
     CSR         CK#01Z    ENDSR
     C******
** ERR
地區別輸入錯誤．
起始業務員大於截止業務員
選擇業務員區間後不可再選擇廠區
