     H            Y                                     1                 IV080
     FARWF02  IP  F      80            DISK
     FPRINT   O   F     132     OV     PRINTER
     FHIPROD  IF  E           K        DISK
     E                    KN      1   9 11
     IARWF02  NS  01
     I                                       30  300KI    L2
     I                                       50  52 NAME  L4
     I                                       50  50 PDCD
     I                                    P  53  560QTY
     I                                    P  57  593UP
     I                                    P  60  650AMT
     I                                       50  50 NAME1 L5
     I                                        1   1 IV
     I                                        2   2 TX    L5
     I                                        3   3 CUNO
9011 I            DS
LYW  I                                        1  84 D#SAL1
 .   I                                        1  120D#AMT1
 .   I                                       13  240D#AMT2
 .   I                                       25  360D#AMT3
 .   I                                       37  480D#AMT4
 .   I                                       49  600D#AMT5
 .   I                                       61  720D#AMT6
 .   I                                       73  840D#AMT7
 .   I            DS
 .   I                                        1  84 D#SAL2
 .   I                                        1  120D#AMTA
 .   I                                       13  240D#AMTB
 .   I                                       25  360D#AMTC
 .   I                                       37  480D#AMTD
 .   I                                       49  600D#AMTE
 .   I                                       61  720D#AMTF
 .   I                                       73  840D#AMTG
CLJ  I            DS
     I                                        1   2 W#OEOF
     I                                        1   1 D#OE
     I                                        2   2 D#OF
     I            DS
     I                                        1  12 NM1
---  I                                       12  12 D#NOF
     I           UDS
     I                                        2   70YM
     I                                      951 985 U#CORP
     C*----------------------------------------------------
9011 C     N99             MOVE *ALL'0'   D#SAL1
LYW  C     N99             MOVE *ALL'0'   D#SAL2
 .   C     N99             MOVE *ON       *IN99
     C      10             SETOF                     11
     C     N10             SETON                     1011
CLJ  C   L4      NAME      CHAINHIPROD               85
     C   85 L4             MOVE *BLANK    NM1    12
     C  N85 L4             MOVELF4CHIN    NM1
     C                     MOVE ''      W#OEOF
---  C  N85 L4             MOVE D#OF      D#NOF
     C   L2                MOVE KN,KI     KNM    11
9411 C   L2                MOVELF4CHIN    NM1
9411 C   L2 85             MOVEL*BLANK    NM1
 .   C   L2                MOVE ''      W#OEOF
9411 C   L2                MOVE D#OF      D#NOF
     C   L5      NAME1     COMP '1'                      23
     C   L5      TX        COMP 'P'                      25
     C   L5      TX        COMP 'L'                      22
     C   L5      TX        COMP 'T'                      21
     C   L5      TX        COMP 'M'                      20
     C   L5      TX        COMP 'H'                      24
     C*  01      IV        COMP '2'                      80
     C*  01 80   AMT       DIV  1.05      AMTX    90H
     C*  01N80             Z-ADDAMT       AMTX    90H
     C   01                Z-ADDAMT       AMTX    90H
     C   01                ADD  AMTX      AMTL4  112
 9304C   01                ADD  AMTX      AMTLR  122
     C   01                ADD  QTY       QTYL4   90
     C   01                ADD  QTY       QTYLR   90
9011 C   01      CUNO      IFNE 'E'
LYW  C           KI        IFNE 1
 .   C                     ADD  AMT       D#AMT7
 .   C                     ELSE
 .   C                     SELEC
 .   C           PDCD      WHEQ '2'
 .   C                     ADD  AMT       D#AMT3
 .   C           PDCD      WHEQ '3'
 .   C                     ADD  AMT       D#AMT4
 .   C           PDCD      WHEQ '4'
 .   C                     ADD  AMT       D#AMT5
 .   C                     OTHER
 .   C                     ADD  AMT       D#AMT6
 .   C                     ENDSL
 .   C                     ADD  AMT       D#AMT2
 .   C                     ENDIF
 .   C                     ADD  AMT       D#AMT1
 .   C                     ELSE
 .   C           KI        IFNE 1
 .   C                     ADD  AMT       D#AMTG
 .   C                     ELSE
 .   C                     SELEC
 .   C           PDCD      WHEQ '2'
 .   C                     ADD  AMT       D#AMTC
 .   C           PDCD      WHEQ '3'
 .   C                     ADD  AMT       D#AMTD
 .   C           PDCD      WHEQ '4'
 .   C                     ADD  AMT       D#AMTE
 .   C                     OTHER
 .   C                     ADD  AMT       D#AMTF
 .   C                     ENDSL
 .   C                     ADD  AMT       D#AMTB
 .   C                     ENDIF
 .   C                     ADD  AMT       D#AMTA
 .   C                     ENDIF
     OPRINT   H  103   11
     O       OR        OV
     O                                   14 'PROG:ARR052R'
     O*                                  72 '東和鋼鐵股份有限公司'           X
     O                         U#CORP    78
     O                                   99 '印表日期'
     O                                  100 ':'
     O                         UDATE Y  109
     O        H  1     11
     O       OR        OV
     O                                    8 '廠別'
     O                                    9 ':'
     O                                   15 '台北'
     O                                   71 '銷　貨　彙　總　表'
     O                                   99 '頁　　數'
     O                                  100 ':'
     O                         PAGE     105
     O        H  1     11
     O       OR        OV
     O                                    8 '月份'
     O                                    9 ':'
     O                         YM        16 '    /  '
     O        H  1     11
     O       OR        OV
     O                                   29 '部門'
     O                                   39 '類別'
     O                                   60 '異動別'
     O                                   50 '品　　名'
     O                                   77 '重　量'
     O                                   80 'kg'
     O                                  102 '金　　　　額'
     O        H  1     11
     O       OR        OV
     O                                   29 '---- '
     O                                   39 '---- '
     O                                   60 '--------'
     O                                   51 '------------'
     O                                   70 '-------'
     O                                   80 '----------'
     O                                  104 '-----------------'
     O        T  2     L2
     O                    20             28 'W080'
     O                    21             28 'T380'
     O                    22             28 'L080'
     O                    24             28 'H800'
     O                    25   TX        28
     O                         NAME   B  38
     O                         KNM    B  61
     O                         NM1    B  51
     O                         QTYL4 JB  80
     O                         AMTL4 JB 104
     O        T  2     LR
     O                         QTYLR JB  80
     O                                   60 '總計：'
     O                         AMTLR JB 104
9011 O        T  2     LR
LYW  O                                   40 '內銷：'
 .   O                         D#AMT1JB  60
 .   O        T  1     LR
 .   O                                   55 '銷貨收入:'
 .   O                         D#AMT2JB  75
 .   O        T  1     LR
 .   O                                   65 '鋼　　筋:'
 .   O                         D#AMT3JB  85
 .   O        T  1     LR
 .   O                                   65 '型　　鋼:'
 .   O                         D#AMT4JB  85
 .   O        T  1     LR
 .   O                                   65 '熱軋鋼板:'
 .   O                         D#AMT5JB  85
 .   O        T  1     LR
 .   O                                   65 '其　　他:'
 .   O                         D#AMT6JB  85
 .   O        T  1     LR
 .   O                                   57 '非銷貨收入:'
 .   O                         D#AMT7JB  75
 .   O        T  2     LR
 .   O                                   40 '外銷：'
 .   O                         D#AMTAJB  60
 .   O        T  1     LR
 .   O                                   55 '銷貨收入:'
 .   O                         D#AMTBJB  75
 .   O        T  1     LR
 .   O                                   65 '鋼　　筋:'
 .   O                         D#AMTCJB  85
 .   O        T  1     LR
 .   O                                   65 '型　　鋼:'
 .   O                         D#AMTDJB  85
 .   O        T  1     LR
 .   O                                   65 '熱軋鋼板:'
 .   O                         D#AMTEJB  85
 .   O        T  1     LR
 .   O                                   65 '其　　它:'
 .   O                         D#AMTFJB  85
 .   O        T  1     LR
 .   O                                   57 '非銷貨收入:'
 .   O                         D#AMTGJB  75
**
 銷貨收入
 調　整　
 運　費　
 扣預收款
