     H****************************************************************
     H*
     H*            UPDATE  DATE  101/11/05 2012AR698 S00WCJ (0111A)
     H*
     H****************************************************************
     H        1   Y                                     1                 BR003
     FARR043S CF  E                    WORKSTN
0111AFSAMAST  IF  E           K        DISK
0111AFHSMAST  IF  E           K        DISK
     E*************************************************************
     E                    ERR     1  13 70
     I*************************************************************
0111AIRHSMAST
0111AI              S1OREA                          F#AREA
0111AI              S1ORNO                          F#ORNO
0111AI              S1SALE                          F#SALE
0111AI              S1SND                           F#SND
0111AI              S1RECV                          F#RECV
     I           UDS
0111AI                                       21  26 D#ORNA
0111AI                                       31  38 D#DAT1
0111AI                                       41  48 D#DAT2
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           START   1
     C                     PARM           END     1
     C                     PARM           AREA    1
     C                     PARM           CUNO    6
0111AC*
0111AC           KEY01     KLIST
0111AC                     KFLD           D#AREA
0111AC                     KFLD           D#ORNO
0111AC           KEY02     KLIST
0111AC                     KFLD           D#ARE1
0111AC                     KFLD           D#ORN1
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C****
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
0111AC                     SETOF                     434445
0111AC                     SETOF                     46
     C                     MOVE *BLANK    ERRMSG
0111AC           S#DAT2    IFNE *BLANKS
0111AC                     MOVELS#DAT2    P#DATE  8
0111AC                     CALL 'UTS104R'
0111AC                     PARM           P#DATE
0111AC                     PARM '1'       P#MOD1  1
0111AC                     PARM '2'       P#MOD2  1
0111AC                     PARM '0000'    P#DAYS  4
0111AC                     PARM *BLANK    P#RTND  8
0111AC                     PARM *BLANK    P#ERRC  1
0111AC*
0111AC           P#ERRC    IFNE '0'
0111AC                     MOVELERR,4     ERRMSG           日期錯誤
0111AC                     SETON                     4699
0111AC   99                GOTO CK#01Z
0111AC                     ENDIF
0111AC                     ENDIF
     C*
0111AC           S#DAT1    IFNE *BLANKS
0111AC                     MOVELS#DAT1    P#DATE  8
0111AC                     CALL 'UTS104R'
0111AC                     PARM           P#DATE
0111AC                     PARM '1'       P#MOD1  1
0111AC                     PARM '2'       P#MOD2  1
0111AC                     PARM '0000'    P#DAYS  4
0111AC                     PARM *BLANK    P#RTND  8
0111AC                     PARM *BLANK    P#ERRC  1
0111AC*
0111AC           P#ERRC    IFNE '0'
0111AC                     MOVELERR,4     ERRMSG           日期錯誤
0111AC                     SETON                     4599
0111AC   99                GOTO CK#01Z
0111AC                     ENDIF
0111AC                     ENDIF
     C*
0111AC           S#DAT1    IFEQ *BLANKS
0111AC           S#DAT2    ANDEQ*BLANKS
0111AC                     MOVEL'00000000'D#DAT1  8
0111AC                     MOVEL'99999999'D#DAT2  8
0111AC                     ELSE
0111AC                     MOVELS#DAT1    D#DAT1
0111AC                     MOVELS#DAT2    D#DAT2
0111AC                     ENDIF
     C*
0111AC           S#DAT1    IFGT S#DAT2
0111AC                     SETON                     454699
0111AC                     MOVELERR,5     ERRMSG
0111AC   99                GOTO CK#01Z
0111AC                     ENDIF
     C*
0111AC           S#ORNO    IFNE *BLANKS
0111AC                     MOVELS#ORNO    D#ARE1  1
0111AC                     MOVELS#ORNO    D#AREA  1
0111AC                     MOVE S#ORNO    D#ORN1  50
0111AC                     MOVE S#ORNO    D#ORNO  50
0111AC           KEY01     CHAINSAMAST              N55
0111AC   55      KEY02     CHAINHSMAST              N55
0111AC   55                SETON                     4499
0111AC                     MOVELERR,6     ERRMSG
0111AC   99                GOTO CK#01Z
0111AC                     ENDIF
0111AC*
0111AC                     MOVELS#ORNO    D#ORNA
     C                     SELEC
     C           AREA      WHEQ ' '
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'P'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'T'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'K'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'M'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C           AREA      WHEQ 'H'
     C                     MOVE 'A'       START
     C                     MOVE '9'       END
     C                     OTHER
     C                     SETON                     4199
     C                     MOVE ERR,1     ERRMSG
     C                     ENDSL
     C******
     C*          SALE2     IFEQ ' '
     C*                    MOVE END       SALE2
     C*                    END
     C*****
     C*          SALE1     IFEQ ' '
     C*                    MOVE START     SALE1
     C*                    END
     C*****
     C           SALE1     IFGT SALE2
     C                     SETON                     424399
     C                     MOVE ERR,2     ERRMSG
     C                     ENDIF
     C****
     C           AREA      IFNE ' '
     C           SALE1     ANDNE' '
     C           AREA      ORNE ' '
     C           SALE2     ANDNE' '
     C                     SETON                     424399
     C                     MOVE ERR,3     ERRMSG
     C                     ENDIF
     C***
     C           SALE1     IFNE ' '
     C           SALE2     ORNE ' '
     C                     MOVE SALE1     START
     C                     MOVE SALE2     END
     C                     ENDIF
     C****
     CSR         CK#01Z    ENDSR
     C******
** ERR
01-地區別輸入錯誤．
02-起始業務員大於截止業務員
03-選擇業務員區間後不可再選擇廠區
04-日期錯誤
05-日期區間錯誤
06-訂單編號不存在!!
