     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR098R1
     H*            2.PROGRAM-TYPE  RPG
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     籹砯だ猂
     H*            5.DATE-WRITTEN  91/09/24
     H*            6.DATE-MODIFY
     H*
     H*            *盢潦Θ珇砯灿糶ARR098F2,侩絏=2
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FTRNDTL  IP  E           K        DISK
     FWTMASPL2IF  E           K        DISK
     FARR098F1O   E           K        DISK
     ITXREC
     I                                              TXPDNML1
     I            DS
     I                                        1   8 TXNO
     I                                        1   1 W6AREA
     I                                        2   3 W6VNO1
     I                                        4   80W6VNO2
     I           UDS
     I                                      400 400 D#AREA
     I                                      401 4060T#DATS
     I                                      407 4120T#DATE
     I                                      413 415 T#PDNS
     I                                      416 418 T#PDNE
     I                                      419 419 D#KFLD
     I                                      420 420 D#PRTF
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C  N99                EXSR INISR
     C   L1                EXSR L1CLR
     C                     EXSR DTLSR
     CL1 99                EXSR L1SR
     CLR                   RETRN
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     SETON                       99
     C*
     C           K#MASP    KLIST
     C                     KFLD           W6AREA
     C                     KFLD           W6VNO1
     C                     KFLD           W6VNO2
     C                     ENDSR
     C*****************************************************************
     C           L1CLR     BEGSR
     C*****************************************************************
     C                     Z-ADD0         W#QTY            *砯计秖
     C                     Z-ADD0         W#AMT            *砯肂
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           K#MASP    CHAINRWTMASP             N40
     C  N40      W6TRCD    IFEQ '1E'
 9111C                     ADD  TXQTY     W#QTY   90       计秖
     C                     ADD  TXAMT     W#AMT  110       肂
     C*
     C                     ENDIF
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1SR      BEGSR
     C*****************************************************************
     C                     MOVELTXPDNM    F1PDNM           珇
     C                     MOVEL'2'       F1CODE           侩絏
     C*          F1PDNM    CHAINARAR098F1            41
     C* N41      F1QTY     SUB  W#QTY     F1QTY
     C* N41      F1AMT     SUB  W#AMT     F1AMT
     C* N41                UPDATRAR098F1
     C                     Z-ADDW#QTY     F1QTY4           计秖
     C                     Z-ADDW#AMT     F1AMT4           Μ
     C                     Z-ADDW#QTY     F1QTY            綪砯瞓计秖
     C                     Z-ADDW#AMT     F1AMT            綪砯瞓Μ
     C                     WRITERAR098F1
     C*
     C                     ENDSR
