     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR007R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     電子發票跨廠區列印處理程式
     H*            5.DATE-WRITTEN 107/11/11 2018AR00029
     H*            6.UPDATE-DATE
     H*****************************************************************
     H        1   Y                                     1
     FINEMST  UP  E           K        DISK
     FINEMSTG O   E           K        DISK
     F            RINEMST                           KRENAMEINMSTG
     I*
     I           UDS
     I                                       41  41 D#AREA
     I                                      951 985 COMP
     I                                     10011010 U#USID
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C****************************************************************
     C           *DATE     SUB  19000000  U#SYSD  80
     C                     MOVEL'1'       EMPTMD
     C                     ADD  1         EMPTCN
     C                     UPDATRINEMST
     C                     Z-ADDU#SYSD    EMPTDD
     C                     TIME           EMPTDT
     C                     MOVELU#USID    EMPTSR
     C                     MOVEL'ARR007R2'EMAPNM
     C                     WRITEINMSTG
