     H        1   Y                                     1                 BR003
     FWFILE1  IP  E           K        DISK
     FBSYSDT  IF  E           K        DISK
     FARR061T O   E             69     PRINTER
     E                    ARY     1   2 10               *錯誤訊息
     IWREC1       01
     I                                              W1CUNOL2
     I                                              W1ORNOL1
     I            DS
     I                                        1   4 D#DAT2
     I                                        1   20W#YEA2
     I                                        3   40W#MON2
     I            DS
     I                                        1   4 D#DAT3
     I                                        1   20W#YEA3
     I                                        3   40W#MON3
     I            DS
     I                                        1   4 D#DAT4
     I                                        1   20W#YEA4
     I                                        3   40W#MON4
     I            DS
     I                                        1   4 D#DAT5
     I                                        1   20W#YEA5
     I                                        3   40W#MON5
     I            DS
     I                                        1   60W#ACDT
     I                                        1   4 D#DATE
     I           UDS
     I                                        1   20T#YEAR
     I                                        3   40T#MONT
     I                                       16  16 U#RPID
     I                                     10011010 T#USID
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C           *IN99     IFEQ *OFF
     C                     EXSR INISR
     C                     ENDIF
     C   L2                EXSR L2CLR
     C   L1                EXSR L1CLR
     C   01                EXSR DTLSR
     CL1 99                EXSR L1SR
     CL2 99                EXSR L2SR
     CLR 99                EXSR LRSR
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     MOVE *ALL'='   T#LIN1
     C                     MOVE *ALL'='   T#LIN2
     C           U#RPID    IFEQ '1'
     C                     MOVE ARY,1     T#RPID
     C                     ELSE
     C                     MOVE ARY,2     T#RPID
     C                     ENDIF
     C                     SELEC
     C           T#MONT    WHEQ 1
     C                     Z-ADD11        T#MON2
     C                     Z-ADD10        T#MON3
     C                     Z-ADD9         T#MON4
     C                     Z-ADD8         T#MON5
     C*
     C           T#MONT    WHEQ 2
     C                     Z-ADD12        T#MON2
     C                     Z-ADD11        T#MON3
     C                     Z-ADD10        T#MON4
     C                     Z-ADD9         T#MON5
     C*
     C           T#MONT    WHEQ 3
     C                     Z-ADD1         T#MON2
     C                     Z-ADD12        T#MON3
     C                     Z-ADD11        T#MON4
     C                     Z-ADD10        T#MON5
     C*
     C           T#MONT    WHEQ 4
     C                     Z-ADD2         T#MON2
     C                     Z-ADD1         T#MON3
     C                     Z-ADD12        T#MON4
     C                     Z-ADD11        T#MON5
     C*
     C           T#MONT    WHEQ 5
     C                     Z-ADD3         T#MON2
     C                     Z-ADD2         T#MON3
     C                     Z-ADD1         T#MON4
     C                     Z-ADD12        T#MON5
     C*
     C           T#MONT    WHEQ 6
     C                     Z-ADD4         T#MON2
     C                     Z-ADD3         T#MON3
     C                     Z-ADD2         T#MON4
     C                     Z-ADD1         T#MON5
     C*
     C           T#MONT    WHEQ 7
     C                     Z-ADD5         T#MON2
     C                     Z-ADD4         T#MON3
     C                     Z-ADD3         T#MON4
     C                     Z-ADD2         T#MON5
     C*
     C           T#MONT    WHEQ 8
     C                     Z-ADD6         T#MON2
     C                     Z-ADD5         T#MON3
     C                     Z-ADD4         T#MON4
     C                     Z-ADD3         T#MON5
     C*
     C           T#MONT    WHEQ 9
     C                     Z-ADD7         T#MON2
     C                     Z-ADD6         T#MON3
     C                     Z-ADD5         T#MON4
     C                     Z-ADD4         T#MON5
     C*
     C           T#MONT    WHEQ 10
     C                     Z-ADD8         T#MON2
     C                     Z-ADD7         T#MON3
     C                     Z-ADD6         T#MON4
     C                     Z-ADD5         T#MON5
     C*
     C           T#MONT    WHEQ 11
     C                     Z-ADD9         T#MON2
     C                     Z-ADD8         T#MON3
     C                     Z-ADD7         T#MON4
     C                     Z-ADD6         T#MON5
     C*
     C           T#MONT    WHEQ 12
     C                     Z-ADD10        T#MON2
     C                     Z-ADD9         T#MON3
     C                     Z-ADD8         T#MON4
     C                     Z-ADD7         T#MON5
     C*
     C                     ENDSL
     C           T#MONT    IFGE 1
     C           T#MONT    ANDLE2
     C           T#YEAR    SUB  1         T#YEA2
     C                     ELSE
     C                     Z-ADDT#YEAR    T#YEA2
     C                     ENDIF
     C*
     C           T#MONT    IFGE 1
     C           T#MONT    ANDLE3
     C           T#YEAR    SUB  1         T#YEA3
     C                     ELSE
     C                     Z-ADDT#YEAR    T#YEA3
     C                     ENDIF
     C*
     C           T#MONT    IFGE 1
     C           T#MONT    ANDLE4
     C           T#YEAR    SUB  1         T#YEA4
     C                     ELSE
     C                     Z-ADDT#YEAR    T#YEA4
     C                     ENDIF
     C*
     C           T#MONT    IFGE 1
     C           T#MONT    ANDLE5
     C           T#YEAR    SUB  1         T#YEA5
     C                     ELSE
     C                     Z-ADDT#YEAR    T#YEA5
     C                     ENDIF
     C*
     C                     MOVE T#YEA2    W#YEA2
     C                     MOVE T#MON2    W#MON2
     C*
     C                     MOVE T#YEA3    W#YEA3
     C                     MOVE T#MON3    W#MON3
     C*
     C                     MOVE T#YEA4    W#YEA4
     C                     MOVE T#MON4    W#MON4
     C*
     C                     MOVE T#YEA5    W#YEA5
     C                     MOVE T#MON5    W#MON5
     C*
     C                     SETON                     6999
     C                     ENDSR
     C*****************************************************************
     C           L2CLR     BEGSR
     C*****************************************************************
     C                     Z-ADD0         T#TO22
     C                     Z-ADD0         T#TO23
     C                     Z-ADD0         T#TO24
     C                     Z-ADD0         T#TO25
     C                     Z-ADD0         T#SU2T
     C                     ENDSR
     C*****************************************************************
     C           L1CLR     BEGSR
     C*****************************************************************
     C                     Z-ADD0         T#TO12
     C                     Z-ADD0         T#TO13
     C                     Z-ADD0         T#TO14
     C                     Z-ADD0         T#TO15
     C                     Z-ADD0         T#SU1T
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C*   排除催收款
     C           W1NO      CHAINYSREC                40
     C                     CLEARAR061T1
     C                     MOVE W1CUNM    T#CUNM           客戶名稱
     C                     MOVELW1ORNO    T#ORNO           訂單號碼
     C                     MOVELW1SALE    T#SALE           業務員
     C                     Z-ADDW1ACDT    W#ACDT           發票日期
     C*
     C                     SELEC
     C           D#DATE    WHEQ D#DAT2
     C                     MOVE W1NO      T#INN2           發票號碼2
     C                     Z-ADDW1GAMT    T#AMT2           應收金額2
     C           D#DATE    WHEQ D#DAT3
     C                     MOVE W1NO      T#INN3           發票號碼3
     C                     Z-ADDW1GAMT    T#AMT3           應收金額3
     C           D#DATE    WHEQ D#DAT4
     C                     MOVE W1NO      T#INN4           發票號碼4
     C                     Z-ADDW1GAMT    T#AMT4           應收金額4
     C           D#DATE    WHLE D#DAT5
     C                     MOVE W1NO      T#INN5           發票號碼5
     C                     Z-ADDW1GAMT    T#AMT5           應收金額5
     C                     ENDSL
     C*
     C                     ADD  T#AMT2    T#SUB1           小計
     C                     ADD  T#AMT3    T#SUB1           小計
     C                     ADD  T#AMT4    T#SUB1           小計
     C                     ADD  T#AMT5    T#SUB1           小計
     C*
     C*  69                WRITEAR061TH
     C*                    MOVE *OFF      *IN69
     C*
     C*  40                WRITEAR061T1
     C* N40      YSCODE    IFEQ *BLANK
     C*                    WRITEAR061T1
     C*                    ENDIF
     C*
     C                     ADD  T#AMT2    T#TO12           小計
     C                     ADD  T#AMT3    T#TO13           小計
     C                     ADD  T#AMT4    T#TO14           小計
     C                     ADD  T#AMT5    T#TO15           小計
     C*
     C                     ENDSR
     C*****************************************************************
     C           L1SR      BEGSR
     C*****************************************************************
     C*
     C           T#TO12    IFNE 0
     C           T#TO13    ORNE 0
     C           T#TO14    ORNE 0
     C           T#TO15    ORNE 0
     C                     MOVELT#CUNM    T#CUN1           客戶名稱
     C                     MOVELT#ORNO    T#ORN1           訂單編號
     C                     ADD  T#TO12    T#SU1T           小計
     C                     ADD  T#TO13    T#SU1T           小計
     C                     ADD  T#TO14    T#SU1T           小計
     C                     ADD  T#TO15    T#SU1T           小計
     C*
     C   69                WRITEAR061TH
     C                     MOVE *OFF      *IN69
     C                     WRITEAR061T2
     C*
     C                     ADD  T#TO12    T#TO22           小計
     C                     ADD  T#TO13    T#TO23           小計
     C                     ADD  T#TO14    T#TO24           小計
     C                     ADD  T#TO15    T#TO25           小計
     C                     ENDIF
     C*
     C                     ENDSR
     C*****************************************************************
     C           L2SR      BEGSR
     C*****************************************************************
     C*
     C           T#TO22    IFNE 0
     C           T#TO23    ORNE 0
     C           T#TO24    ORNE 0
     C           T#TO25    ORNE 0
     C                     ADD  T#TO22    T#SU2T           小計
     C                     ADD  T#TO23    T#SU2T           小計
     C                     ADD  T#TO24    T#SU2T           小計
     C                     ADD  T#TO25    T#SU2T           小計
     C*
     C   69                WRITEAR061TH
     C                     MOVE *OFF      *IN69
     C                     WRITEAR061T3
     C*
     C                     ADD  T#TO22    T#TO32           小計
     C                     ADD  T#TO23    T#TO33           小計
     C                     ADD  T#TO24    T#TO34           小計
     C                     ADD  T#TO25    T#TO35           小計
     C                     ENDIF
     C*
     C                     ENDSR
     C*****************************************************************
     C           LRSR      BEGSR
     C*****************************************************************
     C*
     C                     ADD  T#TO32    T#SU3T           小計
     C                     ADD  T#TO33    T#SU3T           小計
     C                     ADD  T#TO34    T#SU3T           小計
     C                     ADD  T#TO35    T#SU3T           小計
     C*
     C   69                WRITEAR061TH
     C                     MOVE *OFF      *IN69
     C                     WRITEAR061T4
     C*
     C   69                WRITEAR061TH
     C                     MOVE *OFF      *IN69
     C                     WRITEAR061TX
     C*
     C                     ENDSR
**  ARY
已開帳齡
未開帳齡
