     H        1   Y                                     1                 BR003
     FARR036S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   3 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10011001 U#DEPT
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           AREAF   1
     C                     PARM           AREAT   1
     C                     PARM           P#TXDT  8
     C**************************************************************
     C                     Z-ADDUDATE     S#TXDT
     C           U#DEPT    IFEQ 'S'
     C           U#DEPT    OREQ 'F'
     C                     SETON                     51
     C                     ELSE
     C                     SETOF                     51
     C                     ENDIF
     C*
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                MOVE S#TXDT    P#TXDT
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C                     SELEC
     C           AREA      WHEQ ' '
     C           AREA      WHEQ 'P'
     C           AREA      WHEQ 'T'
     C           AREA      WHEQ 'K'
     C           AREA      WHEQ 'M'
     C           AREA      WHEQ 'H'
     C                     OTHER
     C                     SETON                     4199
     C                     MOVELERR,1     ERRMSG
     C                     ENDSL
      **
     C           AREA      IFEQ *BLANK
     C                     MOVE ' '       AREAF
     C                     MOVE 'Z'       AREAT
     C                     ELSE
     C                     MOVE AREA      AREAF
     C                     MOVE AREA      AREAT
     C                     ENDIF
      **
     CSR         CK#01Z    ENDSR
     C******
** ERR
¼t°Ï¿ï¾Ü¿ù»~
µo²¼½d³ò¿ù»~
­q³æ½d³ò¿ù»~
