     H****************************************************************
     H*
     H*            UPDATE  DATE  99/09/02  2010AR517  S00WCJ (9909A)
     H*
     H****************************************************************
     H        1   Y                                     1                 BR003
     FARR055S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   3 70
     I*************************************************************
     IAADS        DS
     I                                       21  260YMD
     I                                       21  240YM
     I                                       21  220YY
     I                                       23  240MM
     I                                       25  260DD
     I           UDS
     I                                        1   1 U#TYPE
     I                                       21  21 U#RCV1
     I                                       22  22 U#RCV2
     I                                       31  36 U#CUN1
     I                                       37  42 U#CUN2
     I                                       43  48 U#ORNO
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           DATE1   80
     C                     PARM           DATE2   80
     C**************************************************************
9909AC           *DATE     SUB  19000000  U#SYSD  80
9909AC                     Z-ADDU#SYSD    DATE1
9909AC                     Z-ADDU#SYSD    DATE2
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                MOVELS#TYPE    U#TYPE
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414243
     C                     SETOF                     99
     C                     MOVE *BLANK    ERRMSG
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE DATE1     P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM ' '       FLAG    1
     C           FLAG      IFNE '0'
     C                     SETON                     9941
     C                     MOVELERR,1     ERRMSG
     C                     ENDIF
     C*
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE DATE2     P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE
     C                     PARM '1'       P#MODE
     C                     PARM           P#MTL
     C                     PARM           P#LY
     C                     PARM ' '       FLAG
     C           FLAG      IFNE '0'
     C                     SETON                     9942
     C                     MOVELERR,1     ERRMSG
     C                     ENDIF
     C*
     C           DATE1     IFGT DATE2
     C                     SETON                     9941
     C                     MOVELERR,2     ERRMSG
     C                     ENDIF
     C*
     C           S#TYPE    IFNE '1'
     C           S#TYPE    ANDNE'2'
     C           S#TYPE    ANDNE'3'
9012 C           S#TYPE    ANDNE'4'
     C                     SETON                     9943
     C                     MOVELERR,3     ERRMSG
     C                     ENDIF
     C*
     C                     MOVELS#RCV1    U#RCV1
     C                     MOVELS#RCV2    U#RCV2
     C                     MOVELS#CUN1    U#CUN1
     C                     MOVELS#CUN2    U#CUN2
9210 C                     MOVELS#ORNO    U#ORNO
     CSR         CK#01Z    ENDSR
     C******
** ERR
日期輸入錯誤．
日期範圍錯誤．
０３－列印類別錯誤！
