     H        1   Y                                     1                 BR003
     FTRNDTL  IP  E                    DISK
     FINVMST  IF  E           K        DISK
     FARR051F O   E           K        DISK
     I*************************************************************
     ITXREC       01
     I                                              TXPDNML1
     I            DS
     I                                        1  15 TXRESV
     I                                        1   40D#YYMM
     I            DS
     I                                        1   3 TXPDNM
     I                                        1   1 D#PDNM
     I           UDS
     I                                      301 301 D#CODE
     C**************************************************************
     C   L1                EXSR L1CLR
     C   01                EXSR DP#01
     CL1                   EXSR L1SR
     CLR                   RETRN
     C*
     C           L1CLR     BEGSR
     C                     Z-ADD0         W#QTY   90
     C                     Z-ADD0         W#AMT  120
     C                     Z-ADD0         W#TAX   90
     C                     ENDSR
     C*
     C           DP#01     BEGSR
     C                     ADD  TXQTY     W#QTY
     C                     ADD  TXAMT     W#AMT
     C                     ADD  TXTAX     W#TAX
     C                     ENDSR
     C*
     C           L1SR      BEGSR
     C                     CLEARAR051F
     C                     MOVE TXFLAG    A5AREA
     C                     Z-ADDD#YYMM    A5YYMM
     C                     MOVE D#CODE    A5CODE
     C                     MOVE TXCUNO    A5CUNO
     C                     MOVE TXCUNM    A5CUNM
     C                     MOVE TXNO      A5NO
     C                     Z-ADDTXDATE    A5ENDT
     C                     MOVE TXIVNO    A5INNO
     C           A5INNO    CHAININREC               N40
     C   40                Z-ADD0         A5INDT
     C  N40                Z-ADDININDT    A5INDT
     C                     MOVE TXPDNM    A5PDNM
     C                     Z-ADDTXUPRC    A5UPRC
     C                     Z-ADDW#QTY     A5QTY
     C                     Z-ADDW#AMT     A5AMT
     C                     Z-ADDW#TAX     A5TAX
     C                     Z-ADDTXACDT    A5ACDT
     C           D#PDNM    IFEQ '3'
     C                     WRITEAR051F
     C                     ENDIF
     C*
     C                     ENDSR
