     H        1   Y                                     1                 BR003
     FINVDTL  IP  E                    DISK
     FINVMST  IF  E           K        DISK
     FPRSTAT  O   E                    DISK                      A
     IIVREC
     I                                              IVNO  L1
     C*----------------------------------------------------
     C   L1                EXSR D#L1
     C*
     C     N97             EXSR D#PR
     C*
     C****
     CSR         D#L1      BEGSR
     C           IVNO      CHAININVMST               97
     CSR         D#L1Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C           INDECD    IFNE ' '
     C           INTYPE    OREQ '9'
     C                     GOTO D#PRZ
     C                     ENDIF
     C****
     C                     CLEARPRREC
     C                     MOVELINCUNO    PRCUNO
     C                     MOVELINCUNM    PRCUNM
     C                     MOVELINORNO    PRORNO
     C                     MOVELIVNO      PRIVNO
     C                     Z-ADDIVAMT     PRAAMT
     C                     Z-ADDIVACDT    PRACDT
     C                     MOVELIVFL03    PRFL03
     C                     WRITEPRREC
     CSR         D#PRZ     ENDSR
