     H****************************************************************
     H*
     H*            UPDATE  DATE  99/09/02  2010AR517  S00WCJ (9909A)
     H*
     H****************************************************************
     H        1   Y                                     1                 BR003
     FWMST    IP  E           K        DISK
     FTRNDTLL3IF  E           K        DISK
     FQPRINT  O   F     132            PRINTER
      *************************************************************
     E                    TAB1    1   4  1   TAB2   10
     IWNREC
     I                                              WNSALEL4
     I                                              WNTXARL3
     I                                              WNNO  L2
     I*************************************************************
     I****
     IAADS        DS
     I              'も客戶出貨折讓明細-C         CON3                       X
     I              '表も'
     I              '東和鋼鐵企業股份有-C         CON4                       X
     I              '限公司'
      *
     I            DS
     I                                        1  15 TXRESV
     I                                       15  15 WHY
     I           UDS
     I                                        1   6 NO1
     I                                        7  12 NO2
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
9909AC           *DATE     SUB  19000000  U#SYSD  80
     C  N90                EXSR INZ#01
     C  N90                SETON                     90
     C   L4                Z-ADD0         QTYL4  110
     C   L4                Z-ADD0         AMTL4  110
     C   L3                Z-ADD0         QTYL3  110
     C   L3                Z-ADD0         AMTL3  110
     C                     EXSR DP#01
     CL3                   EXSR DT#01
     CL4                   EXSR DT#02
     CLR                   EXCPTET#LR
     C**************************************************************
     C*** SET INITIAL
     CSR         INZ#01    BEGSR
      *
     C                     Z-ADD0         PAG     30
     C                     Z-ADD80        LCNT    30
     C                     Z-ADD60        TCNT    30
     C                     MOVE *ALL'='   ALS   132
     C                     MOVE *ALL'-'   ALQ    94
     CSR                   ENDSR
     C**----------------------------------------------**
     C* DETAIL PROCESS                                **
     C**----------------------------------------------**
     CSR         @CHKCT    BEGSR
     C           LCNT      COMP TCNT                 75  75
     C   75                ADD  1         PAG
     C   75                EXCPTEH#01
     C   75                Z-ADD9         LCNT
     CSR                   ENDSR
     C**----------------------------------------------**
     C* DETAIL PROCESS                                **
     C**----------------------------------------------**
     CSR         DP#01     BEGSR
     C                     ADD  WNCAMT    AMTL4
     C                     ADD  WNQTY     QTYL4
     C***
     C                     MOVEL*BLANK    WNAME  10
     C                     MOVEL*BLANK    WTXNO   6
     C           WNNO      CHAINTXREC                26
     C           *IN26     IFEQ '0'
     C                     MOVELTXNO      WTXNO
     C           WHY       LOKUPTAB1      TAB2           55*EQ
     C   55                MOVE TAB2      WNAME
     C                     ENDIF
     C****
     C                     ADD  1         LCNT
     C                     EXSR @CHKCT
     C   75                ADD  1         LCNT
9101 C*                    Z-ADDWNINDT    INDT    60
     C                     EXCPTED#01
     CSR         DP#01Z    ENDSR
     C**----------------------------------------------**
     C* TLTAL  PROCESS  L3                            **
     C**----------------------------------------------**
     CSR         DT#01     BEGSR
     C                     ADD  QTYL3     QTYL4  110
     C                     ADD  AMTL3     AMTL4  110
     C***
     C           QTYL3     IFNE 0
     C           AMTL3     ORNE 0
     C                     ADD  1         LCNT
     C                     EXSR @CHKCT
     C   75                ADD  1         LCNT
     C                     EXCPTET#01
     C                     ENDIF
     CSR         DT#01Z    ENDSR
     C**----------------------------------------------**
     C* TLTAL  PROCESS  L4                            **
     C**----------------------------------------------**
     CSR         DT#02     BEGSR
     C                     ADD  QTYL4     QTYLR  110
     C                     ADD  AMTL4     AMTLR  110
     C***
     C           QTYL4     IFNE 0
     C           AMTL4     ORNE 0
     C                     ADD  1         LCNT
     C                     EXSR @CHKCT
     C   75                ADD  1         LCNT
     C                     EXCPTET#02
     C                     ENDIF
     CSR         DT#02Z    ENDSR
      ***********************************************************
      ****   DEFINE OUPUT FORMAT                             ****
      ***********************************************************
     OQPRINT  E   02           EH#01
     O                                   18 '報表編號: ARR062'
     O                         CON4      75                                    X
     O                                  123 '製表日期'
     O                                  124 ':'
9909AO                         U#SYSDZ  132
     O        E 1              EH#01
     O                         CON3      75                                    X
     O                                  123 '頁　　次'
     O                                  124 ':'
     O                         PAG   Z  127
     O        E 1              EH#01
     O                         ALS      132
     O        E 1              EH#01
     O                                   10 '業務員'
     O                                   18 '折讓'
     O                                  121 '折讓'
     O        E 1              EH#01
     O                                    9 '代號'
     O                                   18 '廠區'
     O                                   31 '發票號碼'
     O                                   45 '客戶名稱'
     O                                   57 '訂單號碼'
     O                                   69 '發票日期'
     O                                   86 '重　量'
     O                                  101 '金　額'
     O                                  111 '原　因'
     O                                  121 '單號'
     O                                  132 '折讓日期'
     O        E 1              EH#01
     O                         ALS      132
     O        E 1              ED#01
     O                         WNSALE     7
     O                         WNTXAR    15
     O                         WNNO      31
     O                         WNCUNM    45
     O                         WNORNO    53
     O                         WNINDT    68 '    /  /  '
     O                         WNQTY J   85
     O                         WNCAMTJ  100
     O                         WNAME    113
     O                         WTXNO    121
     O                         WNCGDT   131 '    /  /  '
     O        E 2              ET#01
     O                         WNTXAR    61
     O                                 +  2 '-------->'
     O                         QTYL3 J   85
     O                         AMTL3 J  100
     O        E 2              ET#02
     O                         WNSALE    61
     O                                 +  2 '========>'
     O                         QTYL4 J   85
     O                         AMTL4 J  100
     O        E 2              ET#LR
     O                                   61 '地區合計：'
     O                         QTYLR J   85
     O                         AMTLR J  100
**
1磅差　　
2品質扣款
3其他　　
4加工損失
