     H****************************************************************
     H*
     H*            UPDATE  DATE  99/08/31  2010AR517 S00WCJ (9908A)
     H*
     H****************************************************************
     H        1   Y                                     1                 BR003
     FARR014S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   2 70
     I*************************************************************
     IAADS        DS
9008 I*9908A                                 21  260YMD
9908AI                                       21  280YMD
LYW  I*9908A                                 21  240YM
9908AI                                       21  260YM
9908AI*                                      21  220YY
9908AI                                       21  240YY
9908AI*                                      23  240MM
9908AI                                       25  260MM
9908AI*                                      25  260DD
9908AI                                       27  280DD
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           BCUNO   6
     C                     PARM           ECUNO   6
     C**************************************************************
9908AC           *DATE     SUB  19000000  U#SYSD  80
9908AC                     Z-ADDU#SYSD    YMD
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
      *
     C           CUNO2     IFEQ *BLANK
     C                     MOVEL'999999'  CUNO2
     C                     END
      *
     C           CUNO1     IFGT CUNO2
     C                     SETON                     9941
     C                     MOVELERR,2     ERRMSG
     C                     ENDIF
      *
     C                     MOVELCUNO1     BCUNO
     C                     MOVELCUNO2     ECUNO
     CSR         CK#01Z    ENDSR
     C******
** ERR
¦~¤ë¿é¤J¿ù»~¡D
«È¤á½d³ò¿ù»~¡D
