     H        1   Y                                     1                 BR003
     FARR032S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   5 70
     I*************************************************************
     IAADS        DS
     I                                        1   80DATE
     I                                        1   60DATE1
     I                                        7   80DATE2
     I            DS
     I                                        1   60YM
     I                                        3   60D#YM
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM KIND      KIND    1
     C                     PARM           YMA     6
     C                     PARM AREA      AREA    1
     C**************************************************************
     C                     MOVE *BLANK    KIND
     C                     MOVELUDATE     D#YM
     C                     MOVELTXAR      AREA
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                MOVELYM        YMA
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     SETOF                     43
     C                     MOVE *BLANK    ERRMSG
      **
     C           YM        IFEQ 0
     C                     SETON                     9943
     C                     MOVELERR,1     ERRMSG
     C                     ENDIF
     C**
     C           *IN99     IFNE '1'
9010 C                     MOVELUDATE     YM1     40
     C           D#YM      IFGT YM1
     C                     SETON                     9943
     C                     MOVELERR,2     ERRMSG
     C                     ENDIF
     C                     Z-ADDYM        DATE1
     C                     Z-ADD01        DATE2
     C                     ENDIF
     C***
     C           *IN99     IFNE '1'
     C*                    Z-ADDDATE      DATER   60
     C*                    CALL 'C01'
     C*                    PARM           DATER
     C*                    PARM           FLAG    1
     C*                    FREE 'C01'
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE DATE      P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM ' '       FLAG    1
     C           FLAG      IFNE '0'
     C                     SETON                     9943
     C                     MOVELERR,3     ERRMSG
     C                     ENDIF
     C                     ENDIF
     ***
     C           KIND      IFNE '2'
     C           KIND      ANDNE'3'
     C                     MOVELERR,4     ERRMSG
     C                     ENDIF
     C***
     C           AREA      IFNE 'P'
     C           AREA      ANDNE'M'
     C           AREA      ANDNE'K'
     C                     MOVELERR,5     ERRMSG
     C                     ENDIF
     CSR         CK#01Z    ENDSR
     C******
** ERR
年月必須輸入
年月不可大於系統年月
年月不合理
發票聯式必須為２，３
廠區必須為Ｐ，Ｍ，Ｋ
