     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR018R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S01CPF
     H*            4.FUNCTION     當日託收銀行票據處理
     H*            5.DATE-WRITTEN  91/07/22
     H*
     H*****************************************************************
     H        1   Y                                     1
     FRCVDTL  UP  E           K        DISK
     F*--------------------------------------------------------------
     IRVREC       01
     I           UDS
     I                                     10011010 S#USER
     I                                     10111020 S#DEVN
     I                                     10211021 S#AREA
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C   01                EXSR DTLSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           RVTANO    IFEQ ' '
     C           RVSANO    ANDNE' '
     C                     MOVE RVSBID    RVTBID
     C                     MOVE RVSANO    RVTANO
     C                     UPDATRVREC
     C                     ENDIF
     C                     ENDSR
