     H****************************************************************
     H*           *****PROGRAM INTRODUCTION*****
     H*
     H*            1.PROGRAM-ID   ARR063R
     H*            2.PROGRAM-TYPE RPG
     H*            3.FUNCTION     發票列印分類檢核表
     H*            4.DATE-WRITTEN 85/05/17
     H*            5.PROGRAMMER   S01LYC
     H*
     H****************************************************************
     FINVCUT  IP  E           K        DISK
     FARSAID  IF  E           K        DISK
     FARR063TPO   E                    PRINTER
     FARR063TMO   E                    PRINTER
     F            HEADP                             KRENAMEHEADM
     F            DATAP                             KRENAMEDATAM
     F            TOTALP                            KRENAMETOTALM
     FARR063TTO   E                    PRINTER
     F            HEADP                             KRENAMEHEADT
     F            DATAP                             KRENAMEDATAT
     F            TOTALP                            KRENAMETOTALT
     FARR063THO   E                    PRINTER
     F            HEADP                             KRENAMEHEADH
     F            DATAP                             KRENAMEDATAH
     F            TOTALP                            KRENAMETOTALH
     FARR063TKO   E                    PRINTER
     F            HEADP                             KRENAMEHEADK
     F            DATAP                             KRENAMEDATAK
     F            TOTALP                            KRENAMETOTALK
     FARR063TXO   E                    PRINTER
     F            HEADP                             KRENAMEHEADX
     F            DATAP                             KRENAMEDATAX
     F            TOTALP                            KRENAMETOTALX
     E                    TAB1    6   6  1   TAB2    6   *地區名稱'
     IRINVCUT     01
     I                                              CUAREAL1
     I           UDS
     I                                        1  10 RCUNO1
     I                                       11  20 RCUNO2
     I                                       21  21 W#LOCA
     I                                     10211021 R#LOCA
     C****************************************************************
     C*                    MAIN PROGRAM
     C****************************************************************
     C*SR1000列印表頭
     C*SR2000列印資料
     C   L1                EXSR SR1000
     C   01                EXSR SR2000
     CL1                   EXSR SR3000
     C****************************************************************
     C           SR1000    BEGSR
     C****************************************************************
     C                     MOVELCUAREA    R#AREA
     C           R#AREA    LOKUPTAB1      TAB2           50
     C  N50                MOVEL*ALL'*'   R#ARNM
     C   50                MOVELTAB2      R#ARNM
     C                     SELEC
     C           CUAREA    WHEQ 'P'
     C                     WRITEHEADP
     C           CUAREA    WHEQ 'M'
     C                     WRITEHEADM
     C           CUAREA    WHEQ 'T'
     C                     WRITEHEADT
     C           CUAREA    WHEQ 'H'
     C                     WRITEHEADH
     C           CUAREA    WHEQ 'K'
     C                     WRITEHEADK
     C                     OTHER
     C                     WRITEHEADX
     C                     ENDSL
     C                     ENDSR
     C****************************************************************
     C           SR2000    BEGSR
     C****************************************************************
     C           CUINEA    LOKUPTAB1      TAB2           50
     C  N50                MOVEL*ALL'*'   C#ARNM
     C   50                MOVELTAB2      C#ARNM
     C           CURVID    CHAINRARSAID              55    *NR
     C   55                MOVEL*ALL'*'   SANAME
     C                     ADD  1         R#SUM
     C                     SELEC
     C           CUAREA    WHEQ 'P'
     C                     WRITEDATAP                  60
     C   60                WRITEHEADP                      *表頭
     C           CUAREA    WHEQ 'M'
     C                     WRITEDATAM                  60
     C   60                WRITEHEADM                      *表頭
     C           CUAREA    WHEQ 'T'
     C                     WRITEDATAT                  60
     C   60                WRITEHEADT                      *表頭
     C           CUAREA    WHEQ 'H'
     C                     WRITEDATAH                  60
     C   60                WRITEHEADH                      *表頭
     C           CUAREA    WHEQ 'K'
     C                     WRITEDATAK                  60
     C   60                WRITEHEADK                      *表頭
     C                     OTHER
     C                     WRITEDATAX                  60
     C   60                WRITEHEADX                      *表頭
     C                     ENDSL
     C                     ENDSR
     C*****************************************************************
     C           SR3000    BEGSR
     C*****************************************************************
     C                     SELEC
     C           CUAREA    WHEQ 'P'
     C                     WRITETOTALP                 60
     C   60                WRITEHEADP                      *表頭
     C           CUAREA    WHEQ 'M'
     C                     WRITETOTALM                 60
     C   60                WRITEHEADM                      *表頭
     C           CUAREA    WHEQ 'T'
     C                     WRITETOTALT                 60
     C   60                WRITEHEADT                      *表頭
     C           CUAREA    WHEQ 'H'
     C                     WRITETOTALH                 60
     C   60                WRITEHEADH                      *表頭
     C           CUAREA    WHEQ 'K'
     C                     WRITETOTALK                 60
     C   60                WRITEHEADK                      *表頭
     C                     OTHER
     C                     WRITETOTALX                 60
     C   60                WRITEHEADX                      *表頭
     C                     ENDSL
     C                     Z-ADD0         R#SUM
     C                     ENDSR
**  TAB1 TAB2
P台北T桃園M台中K高雄H苗栗L林口
