     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR096R1
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            4.FUNCTION     訂單別記帳出貨明細表
     H*            5.DATE-WRITTEN  91/06/20
     H*
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FWTMASPJ1IP  E           K        DISK
     FARR096F O   E           K        DISK
     I*****************************************************************
     I            DS
     I                                        1   8 D#WTNO
     I                                        1   1 D#WTN1
     I                                        2   3 D#WTN2
     I                                        4   80D#WTN3
     I           UDS
     I                                      307 312 D#ORNO
     I                                     10111020 D#DEVI
     I                                     10211021 D#AREA
     C*****************************************************************
     C*****************************************************************
     C*              MAIN  PROGRAM
     C*****************************************************************
     C                     MOVELW6CUNO    AXCUNO
     C                     MOVELW6CUNM    AXCUNM
     C                     MOVELD#ORNO    AXORNO
     C                     Z-ADD0         AXORTM
     C                     MOVE W6AREA    D#WTN1
     C                     MOVE W6VNO1    D#WTN2
     C                     Z-ADDW6VNO2    D#WTN3
     C                     MOVE D#WTNO    AXWTNO
     C                     Z-ADDW7SQIT    AXWTTM
     C                     Z-ADDW6ENTD    AXWTDT
     C                     MOVELW7SPE1    AXSPC1
     C                     MOVELW7SPE2    AXSPC2
     C                     MOVELW7SPE5    AXLENG
     C                     Z-ADDW7PNUM    AXSPEC
     C                     Z-ADDW7STDW    AXWGHT
     C                     WRITERAR096F
     CLR                   RETRN
     C*
