     H                                                                    PY116
     FARSTWF  IP  E           K        DISK
     FINVDTL  IF  E           K        DISK
     FINVMST  IF  E           K        DISK
     FTRNDTLL2IF  E           K        DISK
     FTRNDTL  IF  E           K        DISK
     F            TXREC                             KRENAMETWREC
     FWFILE1  O   E           K        DISK
     I            DS
     I                                        1   60CHDT
     I                                        1   40DT1
     I                                        5   60DT2
     I            DS
     I                                        1   60CHDTX
     I                                        1   40DT1X
     I                                        5   60DT2X
     I            DS
     I                                        1   60WACDT
     I                                        1   40ACDT1
     I            DS
     I                                        1   40WYM
     I                                        1   20WYY
     I                                        3   40WMM
     I           UDS
     I                                        1   40YM
     I                                        1   20YY
     I                                        3   40MM
     I                                      951 986 COMP
     C           K#TX      KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C*
     C           INVKEY    KLIST
     C                     KFLD           WNO    10
     C                     KFLD           WACNT   1
     C*
     C  N99                EXSR INT99
     C                     MOVE ASIVNO    W#IVNO  8
     C           W#IVNO    IFEQ '28143502'
     C                     Z-ADD1         W#TMP   10
     C                     ENDIF
     C                     Z-ADD0         WAMT   110
     C                     EXSR RTN10                      т綪砯ら
     C           ACDT1     IFLT BYM
     C           ACDT1     ANDGT8112
     C                     EXSR RTN12                      Ωる1-10
     C           ASHAMT    ADD  AMT       WAMT
     C           WAMT      IFGT 0
     C                     EXSR RTN20                      WRITE WFILE1
     C                     ENDIF
     C                     ENDIF
     C**********
     C* INT99  *
     C**********
     C           INT99     BEGSR
     C                     MOVE W1NO      W#IVNO  8
     C           W#IVNO    IFEQ '28143502'
     C                     Z-ADD1         W#TMP   10
     C                     ENDIF
     C                     Z-ADDYY        WYY
     C           MM        SUB  1         WMM
     C           WMM       IFEQ 0
     C                     Z-ADD12        WMM
     C           YY        SUB  1         WYY
     C                     END
     C                     Z-ADDWYM       BYM     40
     C                     Z-ADDYY        WYY
     C           MM        ADD  1         WMM
     C           WMM       IFEQ 13
     C                     Z-ADD1         WMM
     C           YY        ADD  1         WYY
     C                     END
     C                     Z-ADDWYM       DT1
     C*                    Z-ADD15        DT2
     C                     Z-ADD8         DT2
     C                     Z-ADDWYM       DT1X
     C                     Z-ADD1         DT2X
     C                     SETON                     99
     C                     ENDSR
     C**********
     C* RTN10  *
     C**********
     C           RTN10     BEGSR
     C                     Z-ADD0         WACDT
     C*
     C           ASIVNO    CHAINTRNDTLL2             10    Τ綪砯祇
     C           *IN10     IFEQ '0'                        布
     C                     Z-ADDTXDATE    WACDT
     C                     MOVEL'2'       W1BK12
     C                     GOTO ERTN10
     C                     ENDIF
     C*
     C           ASIVNO    CHAININVMST               20    礚綪砯祇
     C           *IN20     IFEQ '0'                        布
     C                     Z-ADDININDT    WACDT
     C                     MOVEL'2'       W1BK12
     C                     GOTO ERTN10
     C                     ENDIF
     C*
     C                     MOVEL'SA04'    TXCODE           礚祇布綪
     C                     MOVELASIVNO    TXNO             砯
     C           K#TX      CHAINTRNDTL               69
     C           *IN69     IFEQ '0'
     C                     Z-ADDTXDATE    WACDT
     C                     MOVEL'1'       W1BK12
     C                     GOTO ERTN10
     C                     ENDIF
     C*
     C                     MOVEL'AR05'    TXCODE           礚祇布秸
     C           K#TX      CHAINTRNDTL               69    俱
     C           *IN69     IFEQ '0'
     C                     MOVEL'1'       W1BK12
     C                     Z-ADDTXDATE    WACDT
     C                     ENDIF
     C           ERTN10    ENDSR
     C**********
     C* RTN12  *
     C**********
     C           RTN12     BEGSR
     C                     MOVELASIVNO    WNO
     C                     MOVEL'6'       WACNT
     C                     Z-ADD0         AMT     90
     C           INVKEY    SETLLINVDTL               12
     C           *IN12     DOWEQ'0'
     C           INVKEY    READEINVDTL                   12
     C   12                LEAVE
     C           IVACDT    IFGE CHDTX
     C           IVACDT    ANDLECHDT
     C                     ADD  IVAMT     AMT
     C                     END
     C                     END
     C                     ENDSR
     C**********
     C* RTN20  *
     C**********
     C           RTN20     BEGSR
     C                     MOVELASCUNM    W1CUNM
     C                     MOVELASCUNO    W1CUNO
     C                     MOVELASRVID    W1SALE
     C                     MOVELASORNO    W1ORNO
     C                     MOVELASIVNO    W1NO
     C                     Z-ADDWACDT     W1ACDT
     C                     Z-ADDWAMT      W1GAMT
     C                     WRITEWREC1
     C                     ENDSR
