     H****************************************************************
     H*
     H*            UPDATE  DATE  99/09/02  2010AR517 S00WCJ (9909A)
     H*
     H****************************************************************
     H        1   Y                                     1                 BR003
     FARR044S CF  E                    WORKSTN
     E*************************************************************
     E                    ERR     1   2 70
     I*************************************************************
     IAADS        DS
9909AI*                                      21  260YMD
9909AI                                       21  280YMD
9909AI*                                      21  240YM1
9909AI                                       21  260YM1
9909AI*                                      21  220YY
9909AI                                       21  240YY
9909AI*                                      23  240MM
9909AI                                       25  260MM
9909AI*                                      25  260DD
9909AI                                       27  280DD
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
9909AC*                    PARM           DATE1   60
9909AC                     PARM           DATE1   80
9909AC*                    PARM           DATE2   60
9909AC                     PARM           DATE2   80
     C**************************************************************
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C                     Z-ADDYM        YM1
     C                     Z-ADD01        DD
     C*                    CALL 'C01'
     C*                    PARM YMD       APDT    60
     C*                    PARM ' '       FLAG    1
     C*                    FREE 'C01'
     C                     MOVE *ALL'0'   P#DATE
     C                     MOVE YMD       P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM ' '       FLAG    1
     C           FLAG      IFNE '0'
     C                     SETON                     9941
     C                     MOVELERR,1     ERRMSG
     C                     ENDIF
      *
     C                     Z-ADDYMD       DATE1
     C                     Z-ADD31        DD
     C                     Z-ADDYMD       DATE2
     CSR         CK#01Z    ENDSR
     C******
** ERR
日期輸入錯誤．
日期範圍錯誤．
