     H        1   Y                                     1                 BR003
     FARR005S CF  E                    WORKSTN
     F*NVMSTL2IF  E           K        DISK
     E*************************************************************
     E                    ERR     1   3 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           W0100   5
     C                     PARM           W0101   5
     C                     PARM           W0102  10
     C                     PARM           W0103  10
     C**************************************************************
     C*          INKEY     KLIST
     C*                    KFLD           INORNO
     C*                    KFLD           INNO
      *
     C                     MOVE *BLANK    W0100
     C                     MOVE *ALL'9'   W0101
     C                     MOVE *BLANK    W0102
     C                     MOVE *ALL'9'   W0103
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C**************************
     C***                    ***
     C***  SCREEN 01 CHECK   ***
     C***                    ***
     C**************************
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
      **
     C           W0101     IFEQ *BLANK
     C                     MOVE *ALL'9'   W0101
     C                     ENDIF
      **
     C           W0100     IFGT W0101
     C                     SETON                     4199
     C                     MOVELERR,3     ERRMSG
     C                     GOTO CK#01Z
     C                     ENDIF
      **
     C           W0103     IFEQ *BLANK
     C                     MOVE *ALL'9'   W0103
     C                     ENDIF
      **
     C           W0102     IFGT W0103
     C                     SETON                     4299
     C                     MOVELERR,2     ERRMSG
     C                     ENDIF
     C***
     C*                    MOVELW0100     INORNO
     C*                    MOVELW0102     INNO
     C*          INKEY     SETLLINVMSTL2             31
     C*  31                MOVELERR,1     ERRMSG
     C*  31                SETON                     4199
     C*  31                GOTO CK#01Z
     C*          CK#01A    TAG
     C*                    SETOF                     31
     C*                    READ INVMSTL2                 31
     C*  31                MOVELERR,1     ERRMSG
     C*  31                SETON                     4199
     C*  31                GOTO CK#01Z
     C*          INORNO    COMP W0101                31
     C*  31                MOVELERR,1     ERRMSG
     C*  31                SETON                     4199
     C*  31                GOTO CK#01Z
     C*          INNO      COMP W0102                  31
     C* N31      INNO      COMP W0103                31
     C*  31                GOTO CK#01A
     CSR         CK#01Z    ENDSR
     C******
** ERR
無符合資料
發票範圍錯誤
訂單範圍錯誤
