     H        1   Y                                     1                 BR003
     FARR033S CF  E                    WORKSTN
     FTRNDTL  IF  E           K        DISK
     E*************************************************************
     E                    ERR     1   4 70
     I*************************************************************
     I           UDS
     I                                      951 985 COMP
     I                                     10111020 DEVNM
     I                                     10211021 TXAR
     C**************************************************************
     C           *ENTRY    PLIST
     C           NO        PARM NO        NO      6
     C           *IN03     PARM *IN03     IN03    1
     C           TXKEY     KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C**************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTTITLE
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C******
     CSR         KC#01     BEGSR
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     CSR                   ENDSR
     C****
     CSR         CK#01     BEGSR
     C                     SETOF                     414299
     C                     MOVE *BLANK    ERRMSG
     C******
     C           NO        IFEQ *BLANK
     C                     SETON                     9941
     C                     MOVELERR,1     ERRMSG
     C                     ELSE
     C                     MOVELNO        AREA    1
     C           AREA      IFNE TXAR
     C                     SETON                     9941
     C                     MOVELERR,4     ERRMSG
     C                     ELSE
     C                     MOVEL'AR06'    TXCODE
     C                     MOVELNO        TXNO
     C           TXKEY     SETLLTRNDTL               97
     C  N97      TXKEY     READETRNDTL                   97
     C   97                SETON                     9941
     C   97                MOVELERR,2     ERRMSG
     C           *IN97     DOWEQ'0'
     C           TXFLAG    IFEQ 'D'
     C                     SETON                     9941
     C                     MOVELERR,3     ERRMSG
     C                     ELSE
     C                     SETOF                     9941
     C                     LEAVE
     C                     ENDIF
     C           TXKEY     READETRNDTL                   97
     C                     ENDDO
     C                     ENDIF
     C                     ENDIF
     C****
     CSR         CK#01Z    ENDSR
     C******
** ERR
折讓單號必須輸入
折讓單號不存在，不可列印
折讓單號已刪除，不可列印
折讓單號不屬於本廠區，不可列印
