     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR083R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02YSH
     H*            4.FUNCTION     預收貨款增減明細表
     H*            5.DATE-WRITTEN  89/02/19
     H*
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARBBAL  IP  E           K        DISK
     FARR083T O   E             69     PRINTER
     IRARBBAL
     I           UDS
     I                                      501 5040T#YYMM
     I                                      505 505 D#AREA
     I                                     10011010 T#USID
     I                                     10211021 U#AREA
     C*****************************************************************
     C  N99                EXSR INISR
     C                     EXSR DTLSR
     CLR 99                EXSR LRSR
     CLRN99                EXSR MSGSR
     CLR                   RETRN
     C*****************************************************************
     C           INISR     BEGSR
     C*****************************************************************
     C                     MOVE *ALL'*'   T#LIN1
     C                     MOVE *ALL'*'   T#LIN2
     C                     SELEC
     C           D#AREA    WHEQ 'P'
     C                     MOVE '台北'  T#BARA
     C           D#AREA    WHEQ 'T'
     C                     MOVE '桃園'  T#BARA
     C           D#AREA    WHEQ 'H'
     C                     MOVE '苗栗'  T#BARA
     C           D#AREA    WHEQ 'M'
     C                     MOVE '台中'  T#BARA
     C           D#AREA    WHEQ 'K'
     C                     MOVE '高雄'  T#BARA
     C           D#AREA    WHEQ ' '
     C                     MOVE '全部'  T#BARA
     C                     ENDSL
     C                     MOVE *ON       *IN69
     C                     MOVE *ON       *IN99
     C                     ENDSR
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     CLEARAR083T1
     C                     MOVE *ALL'-'   T#LIN3
     C                     MOVE ALCUNO    T#CUNO
     C                     MOVE ALCUNM    T#CUNM
     C                     MOVE ALORNO    T#ORNO
     C                     Z-ADDALAAMT    T#SAMT
     C                     MOVE ALAREA    T#SARA
     C                     MOVE ALINNO    T#INNO
     C                     MOVE ALINAR    T#INAR
     C                     Z-ADDALIAMT    T#INMT
     C*
     C                     Z-ADDALBMTP    T#BMTP
     C                     Z-ADDALCMTP    T#CMTP
     C                     Z-ADDALDMTP    T#DMTP
     C                     Z-ADDALEMTP    T#LMTP
     C                     Z-ADDALFMTP    T#MMTP
     C                     ADD  T#BMTP    T#EMTP
     C                     ADD  T#CMTP    T#FMTP
     C                     ADD  T#DMTP    T#GMTP
     C                     ADD  T#LMTP    T#JMTP
     C                     ADD  T#MMTP    T#NMTP
     C*
     C                     Z-ADDALBMTT    T#BMTT
     C                     Z-ADDALCMTT    T#CMTT
     C                     Z-ADDALDMTT    T#DMTT
     C                     Z-ADDALEMTT    T#LMTT
     C                     Z-ADDALFMTT    T#MMTT
     C                     ADD  T#BMTT    T#EMTT
     C                     ADD  T#CMTT    T#FMTT
     C                     ADD  T#DMTT    T#GMTT
     C                     ADD  T#LMTT    T#JMTT
     C                     ADD  T#MMTT    T#NMTT
     C*
     C                     Z-ADDALBMTM    T#BMTM
     C                     Z-ADDALCMTM    T#CMTM
     C                     Z-ADDALDMTM    T#DMTM
     C                     Z-ADDALEMTM    T#LMTM
     C                     Z-ADDALFMTM    T#MMTM
     C                     ADD  T#BMTM    T#EMTM
     C                     ADD  T#CMTM    T#FMTM
     C                     ADD  T#DMTM    T#GMTM
     C                     ADD  T#LMTM    T#JMTM
     C                     ADD  T#MMTM    T#NMTM
     C*
     C                     Z-ADDALBMTH    T#BMTH
     C                     Z-ADDALCMTH    T#CMTH
     C                     Z-ADDALDMTH    T#DMTH
     C                     Z-ADDALEMTH    T#LMTH
     C                     Z-ADDALFMTH    T#MMTH
     C                     ADD  T#BMTH    T#EMTH
     C                     ADD  T#CMTH    T#FMTH
     C                     ADD  T#DMTH    T#GMTH
     C                     ADD  T#LMTH    T#JMTH
     C                     ADD  T#MMTH    T#NMTH
     C*
     C                     Z-ADDALBMTK    T#BMTK
     C                     Z-ADDALCMTK    T#CMTK
     C                     Z-ADDALDMTK    T#DMTK
     C                     Z-ADDALEMTK    T#LMTK
     C                     Z-ADDALFMTK    T#MMTK
     C                     ADD  T#BMTK    T#EMTK
     C                     ADD  T#CMTK    T#FMTK
     C                     ADD  T#DMTK    T#GMTK
     C                     ADD  T#LMTK    T#JMTK
     C                     ADD  T#MMTK    T#NMTK
     C*
     C                     Z-ADDALMAMT    T#NBAL
     C*
     C                     SELEC
     C           ALINAR    WHEQ 'P'
     C                     ADD  ALIAMT    T#IMTP
     C           ALINAR    WHEQ 'T'
     C                     ADD  ALIAMT    T#IMTT
     C           ALINAR    WHEQ 'H'
     C                     ADD  ALIAMT    T#IMTH
     C           ALINAR    WHEQ 'M'
     C                     ADD  ALIAMT    T#IMTM
     C           ALINAR    WHEQ 'K'
     C                     ADD  ALIAMT    T#IMTK
     C                     ENDSL
     C*
     C                     SELEC
     C           ALAREA    WHEQ 'P'
     C                     ADD  ALAAMT    T#HMTP
     C                     ADD  ALMAMT    T#KMTP
     C           ALAREA    WHEQ 'T'
     C                     ADD  ALAAMT    T#HMTT
     C                     ADD  ALMAMT    T#KMTT
     C           ALAREA    WHEQ 'H'
     C                     ADD  ALAAMT    T#HMTH
     C                     ADD  ALMAMT    T#KMTH
     C           ALAREA    WHEQ 'M'
     C                     ADD  ALAAMT    T#HMTM
     C                     ADD  ALMAMT    T#KMTM
     C           ALAREA    WHEQ 'K'
     C                     ADD  ALAAMT    T#HMTK
     C                     ADD  ALMAMT    T#KMTK
     C                     ENDSL
     C                     Z-ADDALXMTP    T#XMTP
     C                     ADD  ALXMTP    T#YMTP
     C           ALMAMT    IFNE 0
     C           ALAAMT    ORNE 0
     C   69                WRITEAR083T1H
     C                     MOVE *OFF      *IN69
     C                     WRITEAR083T1
     C                     ENDIF
     C                     ENDSR
     C*****************************************************************
     C           LRSR      BEGSR
     C*****************************************************************
     C*                    ADD  T#HMTP    T#KMTP
     C*                    ADD  T#IMTP    T#KMTP
     C*                    SUB  T#EMTP    T#KMTP
     C*                    SUB  T#FMTP    T#KMTP
     C*                    SUB  T#GMTP    T#KMTP
     C*                    ADD  T#NMTP    T#KMTP
     C*                    SUB  T#JMTP    T#KMTP
     C*
     C*                    ADD  T#HMTT    T#KMTT
     C*                    ADD  T#IMTT    T#KMTT
     C*                    SUB  T#EMTT    T#KMTT
     C*                    SUB  T#FMTT    T#KMTT
     C*                    SUB  T#GMTT    T#KMTT
     C*                    ADD  T#NMTT    T#KMTT
     C*                    SUB  T#JMTT    T#KMTT
     C*
     C*                    ADD  T#HMTM    T#KMTM
     C*                    ADD  T#IMTM    T#KMTM
     C*                    SUB  T#EMTM    T#KMTM
     C*                    SUB  T#FMTM    T#KMTM
     C*                    SUB  T#GMTM    T#KMTM
     C*                    ADD  T#NMTM    T#KMTM
     C*                    SUB  T#JMTM    T#KMTM
     C*
     C*                    ADD  T#HMTH    T#KMTH
     C*                    ADD  T#IMTH    T#KMTH
     C*                    SUB  T#EMTH    T#KMTH
     C*                    SUB  T#FMTH    T#KMTH
     C*                    SUB  T#GMTH    T#KMTH
     C*                    ADD  T#NMTH    T#KMTH
     C*                    SUB  T#JMTH    T#KMTH
     C*
     C*                    ADD  T#HMTK    T#KMTK
     C*                    ADD  T#IMTK    T#KMTK
     C*                    SUB  T#EMTK    T#KMTK
     C*                    SUB  T#FMTK    T#KMTK
     C*                    SUB  T#GMTK    T#KMTK
     C*                    ADD  T#NMTK    T#KMTK
     C*                    SUB  T#JMTK    T#KMTK
     C*
     C   69                WRITEAR083T1H
     C                     MOVE *OFF      *IN69
     C                     WRITEAR083T2
     C                     ENDSR
     C*****************************************************************
     C           MSGSR     BEGSR
     C*****************************************************************
     C   69                WRITEAR083T1H
     C                     MOVE *OFF      *IN69
     C                     WRITEAR083TMS
     C                     ENDSR
