     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR133RS
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LBU
     H*            4.FUNCTION     客戶預收貨款核對明細表
     H*            5.DATE-WRITTEN  97/05/02
     H*            6.DATE-MODIFY
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARR133S CF  E                    WORKSTN
     FCBCUST  IF  E           K        DISK
     FSAMAST  IF  E           K        DISK
     FHSMAST  IF  E           K        DISK
     E*----------------------------------------------------------------
     E                    ERR     1   9 70
     I*****************************************************************
     IRHSMAST
     I              S1SALE                          F#SALE
     I              S1SND                           F#SND
     I              S1RECV                          F#RECV
     I*
     I           UDS
     I                                     10011010 S#USER
     I                                     10111020 S#DEVN
     C*****************************************************************
     C*          參數接收
     C*****************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           CUNO    6
     C                     PARM           ORNO    6
     C*****************************************************************
     C*          KET  LIST
     C*****************************************************************
     C*FILE => SAMAST、HSMAST
     C*
     C           K#KEY1    KLIST
     C                     KFLD           K#AREA  1        廠區
     C                     KFLD           K#ORNO  50       訂單號碼
     C*
     C*****************************************************************
     C*          主程式開始
     C*****************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTAR133F1
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C*****************************************************************
     CSR         KC#01     BEGSR
     C*****************************************************************
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     C*
     CSR                   ENDSR
     C*****************************************************************
     CSR         CK#01     BEGSR
     C*****************************************************************
     C                     MOVEA'000'     *IN,30
     C                     MOVEA'00'      *IN,41
     C                     SETOF                     99
     C                     MOVEL*BLANK    S#ERR
     C*
     C           S#CUNO    IFNE *BLANK
     C           S#CUNO    CHAINCBREC                30
     C           *IN30     IFEQ *ON
     C                     SETON                     9941
     C                     MOVELERR,1     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C                     ENDIF
     C*
     C* CHECK訂單號碼
     C*
     C           S#ORNO    IFNE *BLANK
     C                     MOVELS#ORNO    K#AREA           廠區
     C                     MOVE S#ORNO    K#ORNO           訂單編號
     C           K#KEY1    CHAINRSAMAST              31
     C*
     C           *IN31     IFEQ *ON
     C           K#KEY1    CHAINRHSMAST              32
     C           *IN32     IFEQ *ON
     C                     SETON                     9942
     C                     MOVELERR,2     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELS#CUNO    CUNO
     C                     MOVELS#ORNO    ORNO
     C*
     CSR         CK#01Z    ENDSR
     C*****************************************************************
** ERR
客戶代號錯誤．
訂單號碼錯誤．
