     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR137R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     發票號碼檢核總表
     H*            5.DATE-WRITTEN  100/12/15 2011AR636
     H*            6.UPDATE-DATE
     H*
     H*****************************************************************
     FGENSEQ  IP  E           K        DISK
     FARR137T O   E             60     PRINTER
     IGEREC
     I                                              GEKINDL1
     I            DS
     I                                        1  10 GEPRIN
     I                                        2   50D#YY
     I                                        6   7 D#MM
     I           UDS
     I                                        1   40R#YYS
     I                                        5   80R#YYE
     I                                        9   9 R#AREA
     I                                       10  10 R#TYP1
     I                                      951 985 COMP
     I                                     10011010 U#USID
     I                                     10111020 DEVNM
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C*
     C  N15                EXSR SR0000
     C                     EXSR SR1000
     C   60                EXSR SR2000
     CLR                   EXSR SR3000
     C*****************************************************************
     C           SR0000    BEGSR
     C*****************************************************************
     C* 印表頭
     C                     WRITEAR137T1H
     C                     Z-ADD0         W#YY    40
     C                     MOVEL*OFF      *IN60
     C                     MOVEL*ON       *IN15
     C                     ENDSR
     C*****************************************************************
     C           SR1000    BEGSR
     C*****************************************************************
     C*
     C           W#YY      IFEQ 0
     C                     Z-ADDD#YY      W#YY
     C                     MOVELGEPRE     W#PRE   2
     C                     MOVEL*ON       *IN10
     C                     ENDIF
     C           W#YY      IFNE D#YY
     C           GEPRE     ORNE W#PRE
     C                     Z-ADDD#YY      R#YY
     C                     MOVELGEPRE     W#PRE
     C                     MOVEL*ON       *IN10
     C                     ENDIF
     C                     SELEC
     C           GEKIND    WHEQ '01'
     C                     MOVEL'二聯'  R#TYPE
     C           GEKIND    WHEQ '02'
     C                     MOVEL'三聯'  R#TYPE
     C                     ENDSL
     C                     SELEC
     C           D#MM      WHEQ '01'
     C                     MOVELGEPRE     R#1MNM
     C                     MOVELGESTNO    R#1SNO
     C                     MOVELGEENNO    R#1ENO
     C                     MOVELGECUNO    R#1CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#1CNO
     C                     ENDIF
     C           D#MM      WHEQ '02'
     C                     MOVELGEPRE     R#2MNM
     C                     MOVELGESTNO    R#2SNO
     C                     MOVELGEENNO    R#2ENO
     C                     MOVELGECUNO    R#2CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#2CNO
     C                     ENDIF
     C           D#MM      WHEQ '03'
     C                     MOVELGEPRE     R#3MNM
     C                     MOVELGESTNO    R#3SNO
     C                     MOVELGEENNO    R#3ENO
     C                     MOVELGECUNO    R#3CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#3CNO
     C                     ENDIF
     C           D#MM      WHEQ '04'
     C                     MOVELGEPRE     R#4MNM
     C                     MOVELGESTNO    R#4SNO
     C                     MOVELGEENNO    R#4ENO
     C                     MOVELGECUNO    R#4CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#4CNO
     C                     ENDIF
     C           D#MM      WHEQ '05'
     C                     MOVELGEPRE     R#5MNM
     C                     MOVELGESTNO    R#5SNO
     C                     MOVELGEENNO    R#5ENO
     C                     MOVELGECUNO    R#5CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#5CNO
     C                     ENDIF
     C           D#MM      WHEQ '06'
     C                     MOVELGEPRE     R#6MNM
     C                     MOVELGESTNO    R#6SNO
     C                     MOVELGEENNO    R#6ENO
     C                     MOVELGECUNO    R#6CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#6CNO
     C                     ENDIF
     C           D#MM      WHEQ '07'
     C                     MOVELGEPRE     R#7MNM
     C                     MOVELGESTNO    R#7SNO
     C                     MOVELGEENNO    R#7ENO
     C                     MOVELGECUNO    R#7CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#7CNO
     C                     ENDIF
     C           D#MM      WHEQ '08'
     C                     MOVELGEPRE     R#8MNM
     C                     MOVELGESTNO    R#8SNO
     C                     MOVELGEENNO    R#8ENO
     C                     MOVELGECUNO    R#8CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#8CNO
     C                     ENDIF
     C           D#MM      WHEQ '09'
     C                     MOVELGEPRE     R#9MNM
     C                     MOVELGESTNO    R#9SNO
     C                     MOVELGEENNO    R#9ENO
     C                     MOVELGECUNO    R#9CNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#9CNO
     C                     ENDIF
     C           D#MM      WHEQ '10'
     C                     MOVELGEPRE     R#AMNM
     C                     MOVELGESTNO    R#ASNO
     C                     MOVELGEENNO    R#AENO
     C                     MOVELGECUNO    R#ACNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#ACNO
     C                     ENDIF
     C           D#MM      WHEQ '11'
     C                     MOVELGEPRE     R#BMNM
     C                     MOVELGESTNO    R#BSNO
     C                     MOVELGEENNO    R#BENO
     C                     MOVELGECUNO    R#BCNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#BCNO
     C                     ENDIF
     C           D#MM      WHEQ '12'
     C                     MOVELGEPRE     R#CMNM
     C                     MOVELGESTNO    R#CSNO
     C                     MOVELGEENNO    R#CENO
     C                     MOVELGECUNO    R#CCNO
     C           GECUNO    IFLT GESTNO
     C                     MOVEL*BLANKS   R#CCNO
     C                     ENDIF
     C                     ENDSL
     C           D#MM      IFEQ '12'
     C                     WRITEAR137T1D
     C                     ENDIF
     C           END100    ENDSR
     C*****************************************************************
     C           SR2000    BEGSR
     C*****************************************************************
     C*
     C                     WRITEAR137T1X
     C                     WRITEAR137T1H
     C                     SETOF                     60
     C                     ENDSR
     C*
     C*****************************************************************
     C           SR3000    BEGSR
     C*****************************************************************
     C*
     C                     WRITEAR137T1T
     C                     ENDSR
