     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR113RS
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02CSF
     H*            4.FUNCTION     發票折扣核對清單
     H*            5.DATE-WRITTEN  94/09/12
     H*            6.DATE-UPDATE
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARR113S CF  E                    WORKSTN
     FCBCUST  IF  E           K        DISK
     FARSAID  IF  E           K        DISK
     FHSMAST  IF  E           K        DISK
     FARR113F IF  E           K        DISK                      A
     E*************************************************************
     E                    ERR     1  12 70
     I*************************************************************
     I           UDS
     I                                      300 305 U#CUNO
     I                                      306 306 U#SALE
     I                                      307 314 U#IND1
     I                                      315 322 U#IND2
     I                                      323 323 U#AREA
     I                                      324 324 U#COD1
     I                                      325 325 U#TYPE
     I                                      326 326 U#CHIC
     I                                     10011010 U#USID
     C*****************************************************************
     C*          KEY  LIST
     C*****************************************************************
     C           K#HSMT    KLIST
     C                     KFLD           S1OREA
     C                     KFLD           S1ORNO
     C**************************************************************
     C*   程式參數傳遞區
     C**************************************************************
     C           *ENTRY    PLIST
     C                     PARM           P#IN03  1
     C**************************************************************
     C*   主程式開始
     C**************************************************************
     C                     EXSR SR0000                     初始程式
     C*
     C           W#PRID    DOUEQ'00'
     C           W#PRID    CASEQ'01'      SR1000           畫面一
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C**************************************************************
     C           SR0000    BEGSR
     C**************************************************************
     C                     MOVEL'01'      W#PRID  2        畫面一
     C                     MOVE *ON       *IN60            訂單編號
     C*
     C                     ENDSR
     C**************************************************************
     C           SR1000    BEGSR
     C**************************************************************
     C*W#PRID='01'-->畫面一
     C           W#PRID    DOWEQ'01'
     C                     EXFMTAR113F1                    螢幕輸入
     C                     MOVEL*BLANK    S#ERR
     C*
     C           *IN03     IFEQ '1'
     C           *IN12     OREQ '1'
     C                     MOVEL'1'       P#IN03           回前畫面
     C                     MOVEL'00'      W#PRID           結束
     C                     LEAVE
     C                     ENDIF
     C*檢核
     C                     EXSR SR1100                     檢核
     C  N99      S#CHIC    IFEQ '1'
     C                     MOVE *OFF      *IN60
     C                     ELSE
     C                     MOVE *ON       *IN60
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     CSR                   ENDSR
     C**************************************************************
     CSR         SR1100    BEGSR
     C**************************************************************
     C                     MOVEA'00000000'*IN,30
     C                     MOVEA'00000000'*IN,38
     C                     MOVEA'00000000'*IN,46
     C                     MOVEA'000'     *IN,47
     C                     SETOF                     99
     C           S#CUNO    IFNE *BLANK
     C           S#CUNO    CHAINCBREC                50
     C   50                SETON                     3099
     C   50                MOVELERR,1     S#ERR
     C                     ENDIF
     C*
     C  N99      S#SALE    IFNE *BLANK
     C                     MOVELS#SALE    W#SALE  2
     C           W#SALE    CHAINRARSAID              51
     C   51                SETON                     3199
     C   51                MOVELERR,2     S#ERR
     C                     ENDIF
     C*
     C  N99      S#IND1    IFEQ 0
     C                     SETON                     3299
     C                     MOVELERR,3     S#ERR
     C                     ENDIF
     C*
     C           *IN99     IFEQ *OFF
     C                     MOVEL*BLANK    P#DATE
     C                     MOVE S#IND1    P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM ' '       P#FLAG  1
     C           P#FLAG    IFNE '0'
     C                     SETON                     3299
     C                     MOVELERR,4     S#ERR
     C                     ENDIF
     C                     ENDIF
     C*
     C  N99      S#IND2    IFEQ 0
     C                     SETON                     3399
     C                     MOVELERR,5     S#ERR
     C                     ENDIF
     C*
     C           *IN99     IFEQ *OFF
     C                     MOVEL*BLANK    P#DATE
     C                     MOVE S#IND2    P#DATE
     C                     CALL 'UTS102R'
     C                     PARM           P#DATE  8
     C                     PARM '1'       P#MODE  1
     C                     PARM           P#MTL  24
     C                     PARM           P#LY    1
     C                     PARM ' '       P#FLAG  1
     C           P#FLAG    IFNE '0'
     C                     SETON                     3399
     C                     MOVELERR,6     S#ERR
     C                     ENDIF
     C                     ENDIF
     C*
     C  N99      S#IND1    IFGT S#IND2
     C                     SETON                     323399
     C                     MOVELERR,7     S#ERR
     C                     ENDIF
     C*
     C  N99      S#COD1    IFEQ *BLANK
     C                     SETON                     3499
     C                     MOVELERR,8     S#ERR
     C                     ENDIF
     C*
     C  N99      S#TYPE    IFEQ *BLANK
     C                     SETON                     3599
     C                     MOVELERR,9     S#ERR
     C                     ENDIF
     C*
     C  N99      S#CHIC    IFEQ *BLANK
     C                     SETON                     3699
     C                     MOVELERR,10    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN1    IFEQ *BLANK
     C           S#ORN2    ANDEQ*BLANK
     C           S#ORN3    ANDEQ*BLANK
     C           S#ORN4    ANDEQ*BLANK
     C           S#ORN5    ANDEQ*BLANK
     C           S#ORN6    ANDEQ*BLANK
     C           S#ORN7    ANDEQ*BLANK
     C           S#ORN8    ANDEQ*BLANK
     C           S#ORN9    ANDEQ*BLANK
     C           S#OR10    ANDEQ*BLANK
     C           S#OR11    ANDEQ*BLANK
     C           S#OR12    ANDEQ*BLANK
     C           S#OR13    ANDEQ*BLANK
     C           S#OR14    ANDEQ*BLANK
     C           S#OR15    ANDEQ*BLANK
     C           S#OR16    ANDEQ*BLANK
     C           S#OR17    ANDEQ*BLANK
     C           S#OR18    ANDEQ*BLANK
     C           S#OR19    ANDEQ*BLANK
     C           S#OR20    ANDEQ*BLANK
     C           S#OR21    ANDEQ*BLANK
     C           S#OR22    ANDEQ*BLANK
     C           S#OR23    ANDEQ*BLANK
     C           S#OR24    ANDEQ*BLANK
     C           S#OR25    ANDEQ*BLANK
     C           S#OR26    ANDEQ*BLANK
     C           S#OR27    ANDEQ*BLANK
     C           S#OR28    ANDEQ*BLANK
     C           S#OR29    ANDEQ*BLANK
     C           S#OR30    ANDEQ*BLANK
     C           S#OR31    ANDEQ*BLANK
     C           S#OR32    ANDEQ*BLANK
     C           S#OR33    ANDEQ*BLANK
     C           S#OR34    ANDEQ*BLANK
     C           S#OR35    ANDEQ*BLANK
     C           S#OR36    ANDEQ*BLANK
     C           S#OR37    ANDEQ*BLANK
     C           S#OR38    ANDEQ*BLANK
     C           S#OR39    ANDEQ*BLANK
     C           S#OR40    ANDEQ*BLANK
     C           S#OR41    ANDEQ*BLANK
     C           S#OR42    ANDEQ*BLANK
     C           S#OR43    ANDEQ*BLANK
     C           S#OR44    ANDEQ*BLANK
     C           S#OR45    ANDEQ*BLANK
     C           S#OR46    ANDEQ*BLANK
     C           S#OR47    ANDEQ*BLANK
     C           S#OR48    ANDEQ*BLANK
     C           S#OR49    ANDEQ*BLANK
     C           S#OR50    ANDEQ*BLANK
     C           S#OR51    ANDEQ*BLANK
     C           S#OR52    ANDEQ*BLANK
     C           S#OR53    ANDEQ*BLANK
     C                     SETON                     3799
     C                     MOVELERR,11    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN1    IFNE *BLANK
     C                     MOVELS#ORN1    S1OREA
     C                     MOVE S#ORN1    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     3799
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN2    IFNE *BLANK
     C                     MOVELS#ORN2    S1OREA
     C                     MOVE S#ORN2    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     3899
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN3    IFNE *BLANK
     C                     MOVELS#ORN3    S1OREA
     C                     MOVE S#ORN3    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     3999
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN4    IFNE *BLANK
     C                     MOVELS#ORN4    S1OREA
     C                     MOVE S#ORN4    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4099
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN5    IFNE *BLANK
     C                     MOVELS#ORN5    S1OREA
     C                     MOVE S#ORN5    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4199
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN6    IFNE *BLANK
     C                     MOVELS#ORN6    S1OREA
     C                     MOVE S#ORN6    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4299
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN7    IFNE *BLANK
     C                     MOVELS#ORN7    S1OREA
     C                     MOVE S#ORN7    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4399
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN8    IFNE *BLANK
     C                     MOVELS#ORN8    S1OREA
     C                     MOVE S#ORN8    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4499
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#ORN9    IFNE *BLANK
     C                     MOVELS#ORN9    S1OREA
     C                     MOVE S#ORN9    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4599
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR10    IFNE *BLANK
     C                     MOVELS#OR10    S1OREA
     C                     MOVE S#OR10    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4699
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR11    IFNE *BLANK
     C                     MOVELS#OR11    S1OREA
     C                     MOVE S#OR11    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4799
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR12    IFNE *BLANK
     C                     MOVELS#OR12    S1OREA
     C                     MOVE S#OR12    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C   52                SETON                     4899
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR13    IFNE *BLANK
     C                     MOVELS#OR13    S1OREA
     C                     MOVE S#OR13    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR14    IFNE *BLANK
     C                     MOVELS#OR14    S1OREA
     C                     MOVE S#OR14    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR15    IFNE *BLANK
     C                     MOVELS#OR15    S1OREA
     C                     MOVE S#OR15    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR16    IFNE *BLANK
     C                     MOVELS#OR16    S1OREA
     C                     MOVE S#OR16    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR17    IFNE *BLANK
     C                     MOVELS#OR17    S1OREA
     C                     MOVE S#OR17    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR18    IFNE *BLANK
     C                     MOVELS#OR18    S1OREA
     C                     MOVE S#OR18    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR19    IFNE *BLANK
     C                     MOVELS#OR19    S1OREA
     C                     MOVE S#OR19    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C  N99N60   S#OR20    IFNE *BLANK
     C                     MOVELS#OR20    S1OREA
     C                     MOVE S#OR20    S1ORNO
     C           K#HSMT    CHAINRHSMAST              52
     C*  52                SETON                     4899
     C   52                SETON                       99
     C   52                MOVELERR,12    S#ERR
     C                     ENDIF
     C*
     C*成功
     C  N99      S#CHIC    IFEQ '1'
     C           *IN60     ANDEQ*OFF
     C           S#CHIC    OREQ '2'
     C           *IN60     ANDEQ*ON
     C                     EXSR SR1110                     寫入暫存檔
     C                     MOVEL'00'      W#PRID
     C                     MOVELS#CUNO    U#CUNO           客戶代號
     C                     MOVELS#SALE    U#SALE           業務代號
     C                     MOVELS#IND1    U#IND1           發票起日
     C                     MOVELS#IND2    U#IND2           發票止日
     C                     MOVELS#AREA    U#AREA           廠區
     C                     MOVELS#COD1    U#COD1           報表內容
     C                     MOVELS#TYPE    U#TYPE           報表型態
     C                     MOVELS#CHIC    U#CHIC           訂單挑選
     C                     ENDIF
     C*
     C                     ENDSR
     C**************************************************************
     CSR         SR1110    BEGSR
     C**************************************************************
     C           S#ORN1    IFNE *BLANK
     C           S#ORN1    CHAINRAR113F              53
     C                     MOVELS#ORN1    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN2    IFNE *BLANK
     C           S#ORN2    CHAINRAR113F              53
     C                     MOVELS#ORN2    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN3    IFNE *BLANK
     C           S#ORN3    CHAINRAR113F              53
     C                     MOVELS#ORN3    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN4    IFNE *BLANK
     C           S#ORN4    CHAINRAR113F              53
     C                     MOVELS#ORN4    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN5    IFNE *BLANK
     C           S#ORN5    CHAINRAR113F              53
     C                     MOVELS#ORN5    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN6    IFNE *BLANK
     C           S#ORN6    CHAINRAR113F              53
     C                     MOVELS#ORN6    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN7    IFNE *BLANK
     C           S#ORN7    CHAINRAR113F              53
     C                     MOVELS#ORN7    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN8    IFNE *BLANK
     C           S#ORN8    CHAINRAR113F              53
     C                     MOVELS#ORN8    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#ORN9    IFNE *BLANK
     C           S#ORN9    CHAINRAR113F              53
     C                     MOVELS#ORN9    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR10    IFNE *BLANK
     C           S#OR10    CHAINRAR113F              53
     C                     MOVELS#OR10    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR11    IFNE *BLANK
     C           S#OR11    CHAINRAR113F              53
     C                     MOVELS#OR11    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR12    IFNE *BLANK
     C           S#OR12    CHAINRAR113F              53
     C                     MOVELS#OR12    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR13    IFNE *BLANK
     C           S#OR13    CHAINRAR113F              53
     C                     MOVELS#OR13    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR14    IFNE *BLANK
     C           S#OR14    CHAINRAR113F              53
     C                     MOVELS#OR14    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR15    IFNE *BLANK
     C           S#OR15    CHAINRAR113F              53
     C                     MOVELS#OR15    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR16    IFNE *BLANK
     C           S#OR16    CHAINRAR113F              53
     C                     MOVELS#OR16    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR17    IFNE *BLANK
     C           S#OR17    CHAINRAR113F              53
     C                     MOVELS#OR17    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR18    IFNE *BLANK
     C           S#OR18    CHAINRAR113F              53
     C                     MOVELS#OR18    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR19    IFNE *BLANK
     C           S#OR19    CHAINRAR113F              53
     C                     MOVELS#OR19    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR20    IFNE *BLANK
     C           S#OR20    CHAINRAR113F              53
     C                     MOVELS#OR20    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR21    IFNE *BLANK
     C           S#OR21    CHAINRAR113F              53
     C                     MOVELS#OR21    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR22    IFNE *BLANK
     C           S#OR22    CHAINRAR113F              53
     C                     MOVELS#OR22    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR23    IFNE *BLANK
     C           S#OR23    CHAINRAR113F              53
     C                     MOVELS#OR23    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR24    IFNE *BLANK
     C           S#OR24    CHAINRAR113F              53
     C                     MOVELS#OR24    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR25    IFNE *BLANK
     C           S#OR25    CHAINRAR113F              53
     C                     MOVELS#OR25    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR26    IFNE *BLANK
     C           S#OR26    CHAINRAR113F              53
     C                     MOVELS#OR26    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR27    IFNE *BLANK
     C           S#OR27    CHAINRAR113F              53
     C                     MOVELS#OR27    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR28    IFNE *BLANK
     C           S#OR28    CHAINRAR113F              53
     C                     MOVELS#OR28    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR29    IFNE *BLANK
     C           S#OR29    CHAINRAR113F              53
     C                     MOVELS#OR29    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR30    IFNE *BLANK
     C           S#OR30    CHAINRAR113F              53
     C                     MOVELS#OR30    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR31    IFNE *BLANK
     C           S#OR31    CHAINRAR113F              53
     C                     MOVELS#OR31    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR32    IFNE *BLANK
     C           S#OR32    CHAINRAR113F              53
     C                     MOVELS#OR32    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR33    IFNE *BLANK
     C           S#OR33    CHAINRAR113F              53
     C                     MOVELS#OR33    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR34    IFNE *BLANK
     C           S#OR34    CHAINRAR113F              53
     C                     MOVELS#OR34    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR35    IFNE *BLANK
     C           S#OR35    CHAINRAR113F              53
     C                     MOVELS#OR35    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR36    IFNE *BLANK
     C           S#OR36    CHAINRAR113F              53
     C                     MOVELS#OR36    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR37    IFNE *BLANK
     C           S#OR37    CHAINRAR113F              53
     C                     MOVELS#OR37    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR38    IFNE *BLANK
     C           S#OR38    CHAINRAR113F              53
     C                     MOVELS#OR38    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR39    IFNE *BLANK
     C           S#OR39    CHAINRAR113F              53
     C                     MOVELS#OR39    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR40    IFNE *BLANK
     C           S#OR40    CHAINRAR113F              53
     C                     MOVELS#OR40    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR41    IFNE *BLANK
     C           S#OR41    CHAINRAR113F              53
     C                     MOVELS#OR41    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR42    IFNE *BLANK
     C           S#OR42    CHAINRAR113F              53
     C                     MOVELS#OR42    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR43    IFNE *BLANK
     C           S#OR43    CHAINRAR113F              53
     C                     MOVELS#OR43    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR44    IFNE *BLANK
     C           S#OR44    CHAINRAR113F              53
     C                     MOVELS#OR44    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR45    IFNE *BLANK
     C           S#OR45    CHAINRAR113F              53
     C                     MOVELS#OR45    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR46    IFNE *BLANK
     C           S#OR46    CHAINRAR113F              53
     C                     MOVELS#OR46    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR47    IFNE *BLANK
     C           S#OR47    CHAINRAR113F              53
     C                     MOVELS#OR47    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR48    IFNE *BLANK
     C           S#OR48    CHAINRAR113F              53
     C                     MOVELS#OR48    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR49    IFNE *BLANK
     C           S#OR49    CHAINRAR113F              53
     C                     MOVELS#OR49    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR52    IFNE *BLANK
     C           S#OR52    CHAINRAR113F              53
     C                     MOVELS#OR52    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR50    IFNE *BLANK
     C           S#OR50    CHAINRAR113F              53
     C                     MOVELS#OR50    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C           S#OR51    IFNE *BLANK
     C           S#OR51    CHAINRAR113F              53
     C                     MOVELS#OR51    AFORNO
     C                     WRITERAR113F
     C                     ENDIF
     C*
     C                     ENDSR
     C*****************************************************************
** ERR
０１－客戶代號不存在！
０２－業務代號不存在！
０３－請輸入發票起日！
０４－請輸入發票止日！
０５－發票起日輸入錯誤！
０６－發票止日輸入錯誤！
０７－發票起日不可大於發票止日！
０８－請輸入報表內容！
０９－請輸入報表型態！
１０－請輸入是否挑選訂單！
１１－請輸入訂單編號！
１２－訂單編號輸入錯誤！
