     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR136R
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     銷貨發票開立方式一覽表
     H*            5.DATE-WRITTEN  98/12/18  2009OD64
     H*            6.UPDATE-DATE
     H*
     H*****************************************************************
     FARR136F IP  E           K        DISK
     FARR136T O   E             60     PRINTER
     E                    TAB1    3   3  2   TAB2    6   *開立方式
     IARREC
     I                                              ARSALEL3
     I                                              ARMTHDL2
     I                                              ARCUNOL1
     I           UDS
     I                                        1   80R#DATS
     I                                        9  160R#DATE
     I                                       19  19 S#INVS
     I                                      951 985 COMP
     I                                     10011010 U#USID
     I                                     10111020 DEVNM
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C  N10                MOVEL*BLANKS   W#ORN5  6
     C*
     C           W#DATA    IFEQ 'Y'
     C   L3 10             WRITEAR136T1M
     C   L3                MOVEL*BLANKS   W#DATA
     C                     ENDIF
     C  N10                EXSR SR0000
     C   L1                MOVEL*ON       *IN53
     C   L2                MOVEL*ON       *IN52
     C   L3                MOVEL*ON       *IN51
     C                     EXSR SR1000
     C   60                EXSR SR2000
     CLR                   EXSR SR3000
     C*****************************************************************
     C           SR0000    BEGSR
     C*****************************************************************
     C* 印表頭
     C                     MOVEL'N'       W#DATA
     C                     MOVEL*ON       *IN10
     C                     WRITEAR136T1H
     C                     MOVEL*OFF      *IN60
     C                     ENDSR
     C*****************************************************************
     C           SR1000    BEGSR
     C*****************************************************************
     C*
     C           S#INVS    IFEQ '1'                        *隨車
     C           ARMTHD    ANDNE'00'
     C                     GOTO END100
     C                     ENDIF
     C*
     C           S#INVS    IFEQ '2'                        *區間
     C           ARMTHD    ANDNE'03'
     C                     GOTO END100
     C                     ENDIF
     C*
     C           S#INVS    IFEQ '3'                        *指定
     C           ARMTHD    ANDNE'04'
     C                     GOTO END100
     C                     ENDIF
     C*
     C           S#INVS    IFEQ *BLANKS
     C           ARMTHD    ANDEQ'01'                       *每日隨訂
     C           S#INVS    OREQ *BLANKS
     C           ARMTHD    ANDEQ'02'                       *每月隨訂
     C           S#INVS    OREQ *BLANKS
     C           ARMTHD    ANDEQ'05'                       *人工開立
     C                     GOTO END100
     C                     ENDIF
     C*
     C           ARORN5    IFEQ W#ORN5
     C                     GOTO END100
     C                     ENDIF
     C*
     C           ARMTHD    LOKUPTAB1      TAB2           50*EQ
     C   50                MOVELTAB2      R#MTHD
     C  N50                MOVEL*ALL'*'   R#MTHD
     C                     MOVELARSALE    R#SALE
     C                     MOVELARCUNO    R#CUNO
     C                     MOVELARCUNM    R#CUNM
     C                     MOVELARORN5    R#ORNO
     C                     MOVELARCTNO    R#CTNO
     C                     MOVELARAREA    R#VREA
     C                     MOVELARTRYN    R#TRYN
     C                     WRITEAR136T1D
     C                     MOVELARORN5    W#ORN5  6
     C                     MOVEL*OFF      *IN51
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*OFF      *IN53
     C                     MOVEL'Y'       W#DATA  1
     C           END100    ENDSR
     C*****************************************************************
     C           SR2000    BEGSR
     C*****************************************************************
     C*
     C                     WRITEAR136T1X
     C                     WRITEAR136T1H
     C                     SETOF                     60
     C                     MOVEL*ON       *IN51
     C                     MOVEL*ON       *IN52
     C                     MOVEL*ON       *IN53
     C                     ENDSR
     C*
     C*****************************************************************
     C           SR3000    BEGSR
     C*****************************************************************
     C*
     C                     WRITEAR136T1T
     C                     ENDSR
**  TAB1 TAB2
00隨車03區間04指定
