     H*****************************************************************
     H*
     H*          >>  PROGRAM INTRODUCTION  <<
     H*          1.PROGRAM-ID    ARR121R1
     H*          2.PROGRAM-TYPE  RPG/400
     H*          3.AUTHOR        S02CSF
     H*          4.FUNCTION     客戶別押匯明細表
     H*          5.DATE-WRITTEN  94/08/08
     H*          6.DATE-MODIFY
     H*
     H*
     H*****************************************************************
     H        1   Y                                     1
     FTRNDTL  IP  E           K        DISK
     FINVMST  IF  E           K        DISK
     FARR121F O   E           K        DISK
     F*****************************************************************
     ITXREC       01
     I           UDS
     I                                      300 305 U#CUNO
     I                                      306 313 U#DAT1
     I                                      314 321 U#DAT2
     I                                      322 322 U#AREA
     I            DS
     I                                        1   6 D#RESV
     C*****************************************************************
     C*         主程式開始
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C                     CLEARRAR121F
     C*
     C                     MOVELTXCUNO    A2CUNO           客戶代號
     C                     MOVELTXCUNM    A2CUNM           客戶名稱
     C                     MOVELTXORNO    A2ORNO           訂單編號
     C                     MOVELTXNO      A2TXNO           折讓單號
     C                     Z-ADDTXITEM    A2ITEM           折讓項次
     C                     Z-ADDTXDATE    A2DATE           開立日期
     C                     MOVELTXIVNO    A2IVNO           發票號碼
     C           TXAMT     ADD  TXTAX     A2AMT2           折讓金額
     C           A2IVNO    CHAININREC                40
     C  N40                MOVELINAREA    A2AREA           廠區
     C  N40      INAAMT    ADD  INATAX    A2AMT1           發票金額
     C  N40                Z-ADDINEAMT    A2AMT3           繳款金額
     C*
     C                     MOVELTXRESV    D#RESV
     C                     MOVE D#RESV    A2ACDT           確認年月
     C*
     C                     WRITERAR121F
     C*
     C                     ENDSR
