     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR142RB
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION    折讓開立分攤未確認檢核表寫入工作檔
     H*            5.WRITE-DATE    113/02/26 2024AR00009
     H*
     H*****************************************************************
     FTRNDTL  IP  E           K        DISK
     FINVMST  IF  E           K        DISK
     FARR142F1O   E           K        DISK
     C*****************************************************************
     C*          Parameter List
     C*****************************************************************
     C*
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C*
     C           TXIVNO    CHAININVMST              N51
     C  N51                MOVELINAREA    TXIVEA
     C   51                MOVEL*BLANKS   TXIVEA
     C                     WRITERAR142F1
     C*
