     H*****************************************************************
     H*
     H*               >>   PROGRAM INTRODUCTION   <<
     H*
     H*            1.PROGRAM-ID    ARR135RS
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S02LBU
     H*            4.FUNCTION     新桃工程自用發票開立明細表（畫面）
     H*            5.DATE-WRITTEN  98/02/25
     H*            6.DATE-MODIFY
     H*
     H*****************************************************************
     H        1   Y                                     1                 BR003
     FARR135S CF  E                    WORKSTN
     E*----------------------------------------------------------------
     E                    ERR     1   9 70
     I*****************************************************************
     I            DS
     I                                        1   60S#YMS
     I                                        1   40D#YS
     I                                        5   60D#MS
     I            DS
     I                                        1   60S#YME
     I                                        1   40D#YE
     I                                        5   60D#ME
     I            DS
     I                                        1   80D#YMD
     I                                        1   60D#YM
     I           UDS
     I                                     10011010 S#USER
     I                                     10111020 S#DEVN
     C*****************************************************************
     C*          參數接收
     C*****************************************************************
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C                     PARM           YMS     60
     C                     PARM           YME     60
     C                     PARM           PJNO   10
     C*
     C                     Z-ADDUDATE     D#YMD
     C                     Z-ADDD#YM      S#YMS
     C                     Z-ADDD#YM      S#YME
     C*****************************************************************
     C*          主程式開始
     C*****************************************************************
     C           *IN03     DOUEQ'1'
     C                     EXFMTAR135F1
     C   KC                EXSR KC#01
     C                     EXSR CK#01
     C  N99                SETON                     LR
     C  N99                RETRN
     C                     ENDDO
     C*****************************************************************
     CSR         KC#01     BEGSR
     C*****************************************************************
     C                     MOVE '1'       *IN03
     C                     SETON                     LR
     C                     RETRN
     C*
     CSR                   ENDSR
     C*****************************************************************
     C*          SCREEN 01 CHECK
     C*****************************************************************
     CSR         CK#01     BEGSR
     C*
     C                     MOVEA'000'     *IN,41
     C                     SETOF                     99
     C                     MOVEL*BLANK    S#ERR
     C*
     C* CHECK起始年月
     C*
     C           D#YS      IFLT 98
     C           D#YS      ANDGT999999
     C                     SETON                     4199
     C                     MOVELERR,1     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C           D#MS      IFLT 1
     C           D#MS      ANDGT12
     C                     SETON                     4199
     C                     MOVELERR,1     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C* CHECK終止年月
     C*
     C           D#YE      IFLT 98
     C           D#YE      ANDGT999999
     C                     SETON                     4299
     C                     MOVELERR,2     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C           D#ME      IFLT 1
     C           D#ME      ANDGT12
     C                     SETON                     4299
     C                     MOVELERR,2     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C           S#YMS     IFGT S#YME
     C                     SETON                     414299
     C                     MOVELERR,3     S#ERR
     C                     GOTO CK#01Z
     C                     ENDIF
     C*
     C* CHECK工程號碼
     C*
     C           S#PJNO    IFEQ *BLANK
     C*                    SETON                     4399
     C*                    MOVELERR,4     S#ERR
     C*                    GOTO CK#01Z
     C                     ENDIF
     C*
     C                     Z-ADDS#YMS     YMS
     C                     Z-ADDS#YME     YME
     C                     MOVELS#PJNO    PJNO
     C*
     CSR         CK#01Z    ENDSR
     C*****************************************************************
** ERR
起始年月錯誤．
終止年月錯誤．
起始年月不可大於終止年月．
工程編號不可空白．
