     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR150R2
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION    勤美公司出貨補價差比對訂單
     H*            5.DATE-WRITTEN  107/01/28 2018AR1126
     H*
     H*****************************************************************
     FARR150F1IP  E           K        DISK
     FSAMAST  IF  E           K        DISK
     FARR150FLUF  E           K        DISK                      A
     F*
     I            DS
     I                                        1   6 D#CUNO
     I                                        1   1 S1KIND
     I                                        2   2 S1CUN1
     I                                        3   5 S1CUN2
     I                                        6   6 S1CD01
     C*****************************************************************
     C*          Parameter List
     C*****************************************************************
     C*
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C*
     C           KEY01     KLIST
     C                     KFLD           S1OREA
     C                     KFLD           S1ORNO
     C                     KFLD           S1ORTM
     C*
     C           A0ORNO    CHAINRAR150F              50
     C           *IN50     IFEQ *ON
     C                     CLEARRAR150F
     C                     MOVELA0ORNO    S1OREA
     C                     MOVE A0ORNO    S1ORNO
     C                     Z-ADD1         S1ORTM
     C           KEY01     CHAINSAMAST               55
     C  N55                MOVELD#CUNO    A1CUNO
     C  N55                MOVELS1CUNO    A1CUNM
     C                     MOVELA0ORNO    A1ORNO
     C                     Z-ADDA0SAMT    A1SAMT
     C                     WRITERAR150F
     C                     ENDIF
