     H*****************************************************************
     H*
     H*          >>  PROGRAM INTRODUCTION  <<
     H*          1.PROGRAM-ID    ARR131R3
     H*          2.PROGRAM-TYPE  RPG/400
     H*          3.AUTHOR        S02LBU
     H*          4.FUNCTION     外銷出口報單核對明細表(先前處理)
     H*          5.DATE-WRITTEN  97/02/20
     H*          6.DATE-MODIFY
     H*
     H*****************************************************************
     H        1   Y                                     1
     FARR131F1IP  E           K        DISK
     FARR131F2UF  E           K        DISK                      A
     I*****************************************************************
     IRAR131F1    01
     I*
     I            DS
     I                                        1   6 RVCUNO
     I                                        1   2 D#MARK
     I*
     I            DS
     I                                        1   9 TXORNO
     I                                        7   90D#ITEM
     I*
     I           UDS
     I                                      301 3080D#DAT1
     I                                      309 3160D#DAT2
     C*****************************************************************
     C*          KET  LIST
     C*****************************************************************
     C*FILE => ARR131F2(出口報單暫存檔)
     C           K#131F    KLIST
     C                     KFLD           K#ORNO  6        訂單號碼
     C                     KFLD           K#AREA  1        廠區
     C*
     C*****************************************************************
     C   01                EXSR DTLSR
     CLR                   RETRN
     C*****************************************************************
     C           DTLSR     BEGSR
     C*****************************************************************
     C           W1ORNO    IFEQ 'H10468'
     C                     EXSR EX1000
     C                     GOTO ENDTSR
     C                     ENDIF
     C*
     C                     MOVEL*OFF      *IN41
     C                     MOVELW1ORNO    K#ORNO           訂單號碼
     C                     MOVELW1AREA    K#AREA           廠區
     C*
     C           K#131F    CHAINRAR131F2             41
     C           *IN41     IFEQ *ON
     C                     MOVELW1ORNO    W2ORNO           訂單號碼
     C                     MOVELW1AREA    W2AREA           廠區
     C                     MOVELW1APNO    W2APNO           報單號碼
     C                     MOVELW1WKAR    W2WKAR           交運地點
     C                     MOVELW1CUNO    W2CUNO           客戶代號
     C                     MOVELW1CUNM    W2CUNM           客戶名稱
     C                     Z-ADDW1QTY     W2QTY            數量
     C                     Z-ADDW1UAMT    W2UAMT           美金金額
     C                     Z-ADDW1NAMT    W2NAMT           台幣金額
     C                     Z-ADDW1DATE    W2DATE           報關日期
     C                     Z-ADDW1TRAT    W2TRAT           報關匯率
     C*
     C           W1ORNO    IFEQ 'H09830'
     C           W1AREA    ANDEQ'K'
     C                     ADD  .01       W2UAMT
     C                     ENDIF
     C                     WRITERAR131F2
     C*
     C                     ELSE
     C                     ADD  W1QTY     W2QTY            數量
     C                     ADD  W1UAMT    W2UAMT           美金金額
     C                     UPDATRAR131F2
     C                     ENDIF
     C*
     C           ENDTSR    ENDSR
     C*****************************************************************
     C           EX1000    BEGSR
     C*****************************************************************
     C                     MOVELW1ORNO    W2ORNO           訂單號碼
     C                     MOVELW1AREA    W2AREA           廠區
     C                     MOVELW1APNO    W2APNO           報單號碼
     C                     MOVELW1WKAR    W2WKAR           交運地點
     C                     MOVELW1CUNO    W2CUNO           客戶代號
     C                     MOVELW1CUNM    W2CUNM           客戶名稱
     C                     Z-ADDW1QTY     W2QTY            數量
     C                     Z-ADDW1UAMT    W2UAMT           美金金額
     C                     Z-ADDW1NAMT    W2NAMT           台幣金額
     C                     Z-ADDW1DATE    W2DATE           報關日期
     C                     Z-ADDW1TRAT    W2TRAT           報關匯率
     C                     WRITERAR131F2
     C*
     C                     ENDSR
     C*****************************************************************
