     H        1   Y                                     1                 BR003
     FBRTRAN  IP  E                    DISK
     FRCVDTL  O   E           K        DISK                      A
     FBRCUSTL1IF  E           K        DISK
     IAAA         DS
     I                                        1   6 SCUNO
     I                                        1   1 CUNO1
     I                                        2   2 CUNO2
     I                                        3   5 CUNO3
     I                                        6   6 CUNO4
     I                                       15  20 NO
     I                                       15  15 NO1
     I                                       16  200NO2
     I                                       21  27 VNO1G
     I                                       21  21 VNO1G1
     I                                       22  22 VNO1G2
     I                                       23  23 VNO1G3
     I                                       24  26 VNO1G4
     I                                       27  27 VNO1G5
     I           UDS
     I                                        1   60YMD
     I                                        7   7 TXAR
     I                                        8   8 CODE
     C*----------------------------------------------------
     C*
     C                     EXSR D#PR
     C*
     C****
     CSR         D#PR      BEGSR
     C                     CLEARRVREC
     C                     Z-ADDB2DATE    RVDATE
     C                     MOVELB2CUNM    RVCUNM
     C           B2AMT     IFGE 0
     C                     Z-ADDB2AMT     RVRAMT
     C                     MOVEL'D'       RVACTP
     C                     ELSE
     C                     Z-SUBB2AMT     RVRAMT
     C                     MOVEL'C'       RVACTP
     C                     ENDIF
     C***
     C                     MOVELB2ACNO    RVACNO
     C                     MOVELB2BANK    RVPBID
     C                     MOVELB2NAME    RVPANO
     C                     MOVELB2ACID    RVSANO
     C                     Z-ADDB2DUDT    RVDUDT
     C                     MOVELTXAR      NO1
     C                     Z-ADDB2RVNO    NO2
     C                     MOVELNO        RVNO
     C                     Z-ADDB2ITEM    RVITEM
     C                     MOVELB2ORNO    RVRLNO
     C                     MOVEL*BLANK    VNO1G
     C                     MOVELTXAR      VNO1G1
     C                     MOVELTXAR      VNO1G2
     C                     MOVELCODE      VNO1G3
     C                     MOVELB2VOUR    VNO1G4
     C                     MOVELVNO1G     RVVNO1
     C           B2CUNM    CHAINBRCUSTL1             97
     C  N97                MOVELBCCUID    RVCUNO
     C  N97                MOVE BCCUCD    RVCUNO
     C                     MOVE '2'       RVTYPE
     C                     MOVEL'B010'    RVDPNO
     C                     MOVEL'A1'      RVUSTP
     C                     MOVEL'D'       RVPLAC
     C                     MOVELB2CMPY    RVRVID
     C                     MOVELTXAR      RVTXAR
     C                     MOVELTXAR      RVAREA
     C                     Z-ADDUDATE     RVTXDT
     C****
     C                     SELEC
     C           B2TYPE    WHEQ '1'
     C                     MOVEL'H'       RVNTTP
     C                     MOVELB2IVNO    RVRLNO
     C                     MOVEL'1111'    RVACNO
     C           B2TYPE    WHEQ '2'
     C                     MOVEL'J'       RVNTTP
     C                     MOVELB2IVNO    RVRLNO
     C                     MOVEL'1112'    RVACNO
     C           B2TYPE    WHEQ '3'
     C                     MOVEL'A'       RVNTTP
     C                     MOVELB2IVNO    RVNTNO
     C                     MOVEL'1131'    RVACNO
     C           B2DUDT    IFLE UDATE
     C                     MOVEL'1'       RVNTCD
     C                     Z-ADDB2DUDT    RVNTDT
     C                     ENDIF
     C           B2TYPE    WHEQ '4'
     C           B2TYPE    OREQ '7'
     C                     MOVEL' '       RVNTTP
     C                     MOVEL'2221'    RVACNO
     C                     OTHER
     C                     MOVELB2IVNO    RVRLNO
     C                     ENDSL
     C                     WRITERVREC
     CSR         D#PRZ     ENDSR
     C****
