     H        1   Y                                     1                 BR003
     FTRNDTL  IP  E                    DISK
     FARSTWF  O   E           K        DISK                      A
     ITXREC
     I                                              TXRESVL2
     I                                              TXNO  L1
     IAADS        DS
     I                                        1  15 TXRESV
     I                                        1   4 TXACYM
     I           UDS
     I                                        1   4 ACYM
     C*----------------------------------------------------
     C           ASKEY     KLIST
     C                     KFLD           ASIVNO
     C  N90                SETON                     90
     C   L1                EXSR D#L1
     C*
     C                     EXSR D#PR
     C*
     CL1                   EXSR T#L1
     C****
     C****
     CSR         D#L1      BEGSR
     C                     Z-ADD0         AAMT   110
     C                     Z-ADD0         BAMT   110
     C                     Z-ADD0         CAMT   110
     C                     Z-ADD0         DAMT   110
     C                     Z-ADD0         EAMT   110
     C                     Z-ADD0         FAMT   110
     C                     Z-ADD0         GAMT   110
     C                     Z-ADD0         HAMT   110
     CSR         D#L1Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C           TXACDT    IFEQ 999999
     C           TXACYM    ANDLEACYM
     C                     GOTO D#PRZ
     C                     ENDIF
     C           TXIVTP    IFEQ '2'
     C           TXAMT     DIV  1.05      TXAMT     H
     C                     ENDIF
     C***
     C                     ADD  TXAMT     AAMT
     C***
     CSR         D#PRZ     ENDSR
     CSR         T#L1      BEGSR
     C****
     C                     Z-SUBAAMT      EAMT
     C                     Z-SUBAAMT      FAMT
     C                     Z-SUBAAMT      HAMT
     C***
     C           HAMT      IFEQ 0
     C                     GOTO T#L1Z
     C                     ENDIF
     C***
     C                     CLEARASREC
     C                     MOVELTXCUNO    ASCUNO
     C                     MOVELTXCUNM    ASCUNM
     C                     MOVELTXORNO    ASORNO
     C                     MOVELTXRVID    ASRVID
     C                     MOVELTXNO      ASIVNO
     C                     Z-ADD0         ASAAMT
     C                     Z-ADDBAMT      ASBAMT
     C                     Z-ADDCAMT      ASCAMT
     C                     Z-ADDDAMT      ASDAMT
     C                     Z-ADDEAMT      ASEAMT
     C                     Z-ADDFAMT      ASFAMT
     C                     Z-ADDGAMT      ASGAMT
     C                     Z-ADDHAMT      ASHAMT
     C                     WRITEASREC
     CSR         T#L1Z     ENDSR
