     H        1   Y                                     1                 BR003
     FARSTWF  IP  E                    DISK
     FTRNDTL  IF  E           K        DISK
     FARSTWF1 O   E           K        DISK                      A
     IAADS        DS
     I                                        1  15 TXRESV
     I                                        1   4 TXACYM
     I           UDS
     I                                        1   4 ACYM
     C*----------------------------------------------------
     C           TXKEY     KLIST
     C                     KFLD           TXCODE
     C                     KFLD           TXNO
     C                     KFLD           TXITEM
     C  N90                SETON                     90
     C*
     C                     EXSR D#PR
     C*
     C****
     CSR         D#PR      BEGSR
     C***
     C                     MOVEL'SA04'    TXCODE
     C                     MOVELASIVNO    TXNO
     C                     Z-ADD1         TXITEM
     C           TXKEY     CHAINTRNDTL               97
     C   97                GOTO D#PRZ
     C****
     C                     CLEARA1REC
     C                     MOVELTXDATE    A1YEAR
     C                     Z-ADDTXDATE    A1DATE
     C                     MOVELASCUNO    A1CUNO
     C                     MOVELASCUNM    A1CUNM
     C                     MOVELASORNO    A1ORNO
     C                     MOVELASRVID    A1RVID
     C                     MOVELASIVNO    A1PCNO
     C                     Z-ADDASAAMT    A1AAMT
     C                     Z-ADDASBAMT    A1BAMT
     C                     Z-ADDASCAMT    A1CAMT
     C                     Z-ADDASDAMT    A1DAMT
     C                     Z-ADDASEAMT    A1EAMT
     C                     Z-ADDASFAMT    A1FAMT
     C                     Z-ADDASGAMT    A1GAMT
     C                     Z-ADDASHAMT    A1HAMT
     C                     MOVELTXIVNO    A1IVNO
     C                     WRITEA1REC
     CSR         D#PRZ     ENDSR
