     H        1   Y                                     1                 BR003
     FTRNDTL  IP  E                    DISK
     FARSTAT  UF  E           K        DISK                      A
     ITXREC
     I                                              TXVUNOL1
     I            DS
     I                                        1   7 TXORNO
     I                                        1   5 D#TXOR
     I           UDS
     I                                        1   60YMD
     I                                        1   40YM
     I                                        5   60DD
     C*----------------------------------------------------
     C           ARKEY     KLIST
     C                     KFLD           ARORNO
     C  N90                SETON                     90
     C   L1                EXSR D#L1
     C*
     C                     EXSR D#PR
     C* N97
     CL1N97                EXSR T#L1
     C****
     C****
     CSR         D#L1      BEGSR
     C                     Z-ADD0         AAMT   110
     C                     Z-ADD0         AQTY   110
     C                     MOVELD#TXOR    ARORNO
     C           ARKEY     CHAINARSTAT               97
CLJB C           *IN97     IFEQ '1'
     C                     CLEARARREC
     C                     MOVEL'A'       ARFLAG
     C                     MOVELTXCUNO    ARCUNO
     C                     MOVELTXCUNM    ARCUNM
     C                     MOVELD#TXOR    ARORNO
     C                     WRITEARREC
     C           ARKEY     CHAINARSTAT               97
CLJE C                     ENDIF
     CSR         D#L1Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C                     ADD  TXAMT     AAMT
     C                     ADD  TXQTY     AQTY
     C***
     CSR         D#PRZ     ENDSR
     CSR         T#L1      BEGSR
     C***
     C           AAMT      IFEQ 0
     C                     GOTO T#L1Z
     C                     ENDIF
     C***
     C                     ADD  AQTY      ARAQTY
     C                     ADD  AAMT      ARAAMT
     C                     Z-ADDAAMT      AROAMT
     C                     ADD  AAMT      ARNBAL
     C           ARNBAL    IFEQ 0
     C                     MOVEL'Y'       ARFL01
     C                     ELSE
     C                     MOVEL' '       ARFL01
     C                     ENDIF
     C                     UPDATARREC
     CSR         T#L1Z     ENDSR
