     H        1   Y                                     1                 BR003
     FINVDTL  IP  E                    DISK
     FINVMST  IF  E           K        DISK
     FARSTWF  O   E           K        DISK                      A
     IIVREC
     I                                              IVNO  L1
     IAADS        DS
     I                                        1   5 IVRESV
     I                                        1   4 IVACYM
     I           UDS
     I                                        1   4 YM
     C*----------------------------------------------------
     C           ASKEY     KLIST
     C                     KFLD           ASIVNO
     C   L1                EXSR D#L1
     C*
     C     N97             EXSR D#PR
     C*
     CL1   N97             EXSR T#L1
     C****
     C****
     CSR         D#L1      BEGSR
     C                     Z-ADD0         AAMT   110
     C                     Z-ADD0         BAMT   110
     C                     Z-ADD0         CAMT   110
     C                     Z-ADD0         DAMT   110
     C                     Z-ADD0         EAMT   110
     C                     Z-ADD0         FAMT   110
     C                     Z-ADD0         GAMT   110
     C                     Z-ADD0         HAMT   110
     C           IVNO      CHAININVMST               97
     CSR         D#L1Z     ENDSR
     C****
     CSR         D#PR      BEGSR
TEST C                     MOVELIVNO      W#IVN1  2
 .   C                     MOVE IVNO      W#IVN2  8
 .   C           W#IVN1    IFEQ 'NB'
 .   C           W#IVN2    ANDEQ'28197879'
 .   C                     Z-ADD0         W#TEST  10
 .   C                     ENDIF
     C*
     C           INDECD    IFNE ' '
     C           INTYPE    OREQ '9'
     C           IVDECD    OREQ 'D'
     C           IVFLAG    OREQ 'D'
     C                     GOTO D#PRZ
     C                     ENDIF
     C           IVACDT    IFEQ 999999
     C           IVACYM    ANDGTYM
     C                     GOTO D#PRZ
     C                     ENDIF
     C                     SELEC
     C           IVACNT    WHEQ '1'
     C                     EXSR C1#RTN
     C           IVACNT    WHEQ '2'
     C                     ADD  IVAMT     EAMT
     C           IVACNT    WHEQ '3'
     C                     ADD  IVAMT     EAMT
     C           IVACNT    WHEQ '4'
     C                     EXSR C4#RTN
     C           IVACNT    WHEQ '5'
     C                     EXSR C5#RTN
     C           IVACNT    WHEQ '6'
     C                     EXSR C6#RTN
     C           IVACNT    WHEQ '7'
     C                     EXSR C7#RTN
CLJ  C           IVACNT    WHEQ '8'
CLJ  C                     ADD  IVAMT     AAMT
     C                     ENDSL
     C***
     CSR         D#PRZ     ENDSR
     C****
     CSR         C1#RTN    BEGSR
     C                     SELEC
     C           IVFL03    WHEQ 'A'
     C                     ADD  IVAMT     AAMT
     C           IVFL03    WHEQ 'B'
     C                     ADD  IVAMT     AAMT
     C           IVFL03    WHEQ 'C'
     C                     ADD  IVAMT     EAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     CSR         C4#RTN    BEGSR
     C                     SELEC
     C           IVFL03    WHEQ 'E'
     C                     ADD  IVAMT     BAMT
     C           IVFL03    WHEQ 'F'
     C                     ADD  IVAMT     AAMT
     C           IVFL03    WHEQ 'G'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'H'
     C                     ADD  IVAMT     BAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     CSR         C5#RTN    BEGSR
     C                     SELEC
     C           IVFL03    WHEQ 'A'
     C                     ADD  IVAMT     CAMT
     C           IVFL03    WHEQ 'B'
     C                     ADD  IVAMT     CAMT
     C           IVFL03    WHEQ 'C'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'D'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'F'
     C                     ADD  IVAMT     CAMT
     C           IVFL03    WHEQ 'G'
     C                     ADD  IVAMT     EAMT
     C           IVFL03    WHEQ 'H'
     C                     ADD  IVAMT     CAMT
     C                     ENDSL
     CSR                   ENDSR
     C****
     CSR         C6#RTN    BEGSR
     C                     ADD  IVAMT     GAMT
     CSR                   ENDSR
     C****
     CSR         C7#RTN    BEGSR
     C                     ADD  IVAMT     GAMT
     CSR                   ENDSR
     C****
     C****
     CSR         T#L1      BEGSR
     C****
     C           AAMT      ADD  BAMT      DAMT
     C                     ADD  CAMT      DAMT
     C           DAMT      ADD  EAMT      FAMT
     C           FAMT      ADD  GAMT      HAMT
     C***
     C           HAMT      IFEQ 0
     C                     GOTO T#L1Z
     C                     ENDIF
     C***
     C                     CLEARASREC
     C                     MOVELINCUNO    ASCUNO
     C                     MOVELINCUNM    ASCUNM
     C                     MOVELINORNO    ASORNO
     C                     MOVELINRVID    ASRVID
     C                     MOVELIVNO      ASIVNO
     C                     Z-ADDAAMT      ASAAMT
     C                     Z-ADDBAMT      ASBAMT
     C                     Z-ADDCAMT      ASCAMT
     C                     Z-ADDDAMT      ASDAMT
     C                     Z-ADDEAMT      ASEAMT
     C                     Z-ADDFAMT      ASFAMT
     C                     Z-ADDGAMT      ASGAMT
     C                     Z-ADDHAMT      ASHAMT
     C                     WRITEASREC
     CSR         T#L1Z     ENDSR
