     H        1   Y                                     1                 BR003
     FINVMST  UP  E           K        DISK
     FSAMAST  IF  E           K        DISK
     IINREC
     I                                              INORNOL1
     C*----------------------------------------------------
     C           SAKEY     KLIST
     C                     KFLD           ORNO1   1
9009 C                     KFLD           ORNO2   50
LYW  C                     KFLD           ORNO3   30
     C*
     C   L1                EXSR D#L1
     C*
     C  N97                EXSR D#PR
     C****
     C****
     CSR         D#L1      BEGSR
     C                     MOVELINORNO    ORNO1
     C                     MOVE INORNO    ORNO2
     C                     Z-ADD1         ORNO3
     C           SAKEY     CHAINSAMAST               97
     CSR         D#L1Z     ENDSR
     C****
     CSR         D#PR      BEGSR
     C                     SETOF                     21
     C                     MOVELINRVID    RVID    1
     C                     MOVELINSALE    SALE    1
     C                     SELEC
     C           RVID      WHNE S1RECV
     C                     MOVELS1RECV    INRVID
     C                     SETON                     21
     C           SALE      WHNE S1SND
     C                     MOVELS1SND     INSALE
     C                     SETON                     21
     C           INKIND    WHEQ ' '
     C                     MOVEL'3'       INKIND
     C                     SETON                     21
     C                     ENDSL
     C   21                UPDATINREC
     CSR         D#PRZ     ENDSR
     C****
