     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    SARCVFCVTR
     H*            2.PROGRAM-TYPE  RPG/400
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION    SARCVF#ACNO SRACNO(會計科目轉換4->6)
     H*            5.DATE-WRITTEN  101/12/20 2012AR704 S00WCJ
     H*
     H*****************************************************************
     FSARCVF  UP  E           K        DISK
     FACNCMPL1IF  E           K        DISK
     ISRACNO      DS
     I                                        5   6 ACNO56
     C*****************************************************************
     C*          Parameter List
     C*****************************************************************
     C*P#PRC='Y'執行轉換
     C           *ENTRY    PLIST
     C                     PARM           P#PRC   1        *處理碼
     C*****************************************************************
     C*          Main      Program
     C*****************************************************************
     C           P#PRC     IFNE 'Y'
     C                     MOVEL*ON       *INLR
     C                     ENDIF
     C*CHAIN ACNCMP新舊會科對照表X(4)->X(6)
     C           SRRVDT    IFGE 1010101
     C           SRACNO    ANDNE*BLANKS
     C           ACNO56    ANDEQ*BLANKS                    *4碼會計科目
     C*
     C                     MOVELSRACNO    W#ACNO  9        *ROC 會計科目
     C           W#ACNO    CHAINRACNCMP              60    *NR
     C  N60                MOVELAZNO      SRACNO           *IFRS會計科目
     C*
     C                     UPDATSRREC
     C*
     C                     ENDIF
