     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    HSSPD
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S02LTS
     A*            4.FUNCTION     訂單異動記錄副檔
     A*            5.DATE-WRITTEN  90/08/18
     A*
     A*****************************************************************
     A                                      UNIQUE
     A          R RHSSPD                    TEXT('委送單異動副檔')
     A            A4TRFL         1A         COLHDG('傳輸碼')
     A            A4FLAG         1A         COLHDG('處理代號')
     A            A4TRCD         2A         COLHDG('異動代號')
     A            A4AREA         1A         COLHDG('出貨廠區')
     A            A4CUNO         6A         COLHDG('委送單－客戶編號')
     A            A4ASNO         6S 0       COLHDG('委送單號')
     A            A4ITEM         3S 0       COLHDG('委送單－項次')
     A            A4DATE         8S 0       COLHDG('填單日期')
     A            A4TIME         6S 0       COLHDG('填單時間')
L9008A            A4HBL          3A         COLHDG('尺寸規格類別')
     A*                                    (H X B  & LENGTH)
     A            A4GROP         1A         COLHDG('大類別')
     A            A4PDN1         3A         COLHDG('類別')
     A            A4PDN2         1A         COLHDG('規範')
     A            A4PDN3         8A         COLHDG('鋼種')
     A            A4PDN4         5A         COLHDG('H/T/D')
     A            A4PDN5         5A         COLHDG('B/W')
     A            A4PDN6         3A         COLHDG('T1')
     A            A4PDN7         3A         COLHDG('T2')
     A            A4PDN8         4A         COLHDG('長度')
     A            A4PDN9         1A         COLHDG('長度單位')
     A            A4LEVR         1A         COLHDG('等級A/B/C/E')
     A            A4UPRC         7S 5       COLHDG('單價／公斤')
     A            A4QTY1         5S 0       COLHDG('委送支數')
     A            A4OQT1         9S 0       COLHDG('委送重量')
     A            A4AMT1        12S 0       COLHDG('委送金額')
     A            A4QTY2         5S 0       COLHDG('業務確認支數')
L9008A            A4OQT2         9S 0       COLHDG('業務確認重量')
L9008A            A4AMT2        12S 0       COLHDG('業務確認金額')
L9008A            A4QTY3         5S 0       COLHDG('轉交單支數')
L9008A            A4OQT3         9S 0       COLHDG('轉交單重量')
L9008A            A4AMT3        12S 0       COLHDG('轉交單金額')
     A            A4TYPE         1A         COLHDG('訂單／寄放')
L9107A            A4SKID         1A         COLHDG('鋼筋別')
L9008A            A4USE1         1A         COLHDG('用途別1')
L9008A            A4USE2         1A         COLHDG('用途別2')
L9008A            A4USE3         1A         COLHDG('用途別3')
L9008A            A4USE4         1A         COLHDG('用途別4')
L9011A            A4USE5         1A         COLHDG('用途別5')
     A            A4OARE         1A         COLHDG('訂單編號－地區')
     A            A4OORN         5S 0       COLHDG('訂單編號－流水號')
     A            A4OITM         3S 0       COLHDG('訂單編號－項次')
L9008A            A4DVNO         6A         COLHDG('轉交貨單號')
L9008A            A4DVTM         3S 0       COLHDG('轉交貨單項次')
     A            A4CSCF         1A         COLHDG('客戶確認碼')
     A            A4CFDD         8S 0       COLHDG('客戶確認日期')
     A            A4CPDD         8S 0       COLHDG('客戶異動日期')
     A            A4CPDT         6S 0       COLHDG('客戶異動時間')
     A            A4CPDM        10O         COLHDG('客戶異動人員')
     A            A4TDLV         1A         COLHDG('轉交單碼')
     A            A4CODE         1A         COLHDG('結案碼')
     A            A4SLCF         1A         COLHDG('業務確認碼')
     A            A4SFDD         8S 0       COLHDG('業務確認日期')
     A            A4UPDD         8S 0       COLHDG('業務異動日期')
     A            A4UPDT         6S 0       COLHDG('業務異動時間')
     A            A4UPDM        10O         COLHDG('業務異動人員')
L9008A            A4SRC         10A         COLHDG('資料來源')
     A            A4ENTD         8S 0       COLHDG('建檔日期')
     A            A4ENTT         6S 0       COLHDG('建檔時間')
     A            A4ENTM        10O         COLHDG('建檔人員')
     A          K A4CUNO
     A          K A4ASNO
     A          K A4ITEM
