     A                                      UNIQUE
     A          R AFREC                     TEXT('¹w¦¬³f´Ú¾lÃBÀÉ')
                                            PFILE(AFCBAL)
     A****
     A          K AFCUNO
     A          K AFORNO
