     A                                      UNIQUE
     A          R AFREC                     TEXT('預收帳款餘額檔')
     A            AFFLAG         1A         COLHDG('處理碼')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A            AFCUNO         6A         COLHDG('客戶編號')
     A            AFCUNM        10O         COLHDG('客戶名稱')
     A            AFFAMT        11P 0       COLHDG('預收金額')
     A            AFXAMT        11P 0       COLHDG('銷項稅額')
     A            AFNAMT        11P 0       COLHDG('兌現金額')
     A            AFEAMT        11P 0       COLHDG('扣預收金額')
     A            AFGAMT        11P 0       COLHDG('退預回')
     A            AFHAMT        11P 0       COLHDG('扣預收沖回')
     A            AFSAMT        11P 0       COLHDG('轉出金額')
     A            AFNBAL        11P 0       COLHDG('兌現餘額')
     A            AFCHDT         8S 0       COLHDG('異動日期')
     A            AFRESV        10A         COLHDG('保留碼')
     A*
     A          K AFORNO
