     A          R RAR2159D                  TEXT('客戶暫收款統計檔')
     A                                      PFILE(AR2159D)
     A          K ADORNO
     A          K ADAREA
     A          K ADCUNO
