     A                                      UNIQUE
     A          R RAR2159X                  TEXT('財會暫收款統計檔')
     A            AXCUNO         6A         COLHDG('客戶編號')
     A            AXCUNM        10A         COLHDG('客戶簡稱')
     A            AXORNO        10A         COLHDG('訂單號碼')
     A            AXAMT         11P 0       COLHDG('金額')
     A            AXMODE         1A         COLHDG('繳款類別')
     A*                                     (1:營業2:非營業)
     A*
     A          K AXCUNO
     A          K AXORNO
