     A          R RAR2159T                  TEXT('轉暫收手切傳票檔')
     A            ARTRFL         1A         COLHDG('傳輸碼')
     A            ARFLAG         1A         COLHDG('處理代碼')
     A            ARYMD          8S 0       COLHDG('資料日期')
     A            ARAREA         1A         COLHDG('廠區別')
     A            ARCUNO         6A         COLHDG('客戶編號')
     A            ARCUNM        10A         COLHDG('客戶名稱')
     A            ARORNO         6A         COLHDG('訂單編號')
     A            ARVUNO         7A         COLHDG('傳票號碼')
     A            ARITEM         3S         COLHDG('資料項次')
     A            ARACDC         1A         COLHDG('借貸別')
     A            ARAMT         11S 0       COLHDG('傳票金額')
     A****
     A          K ARYMD
     A          K ARVUNO
     A          K ARITEM
     A          K ARCUNO
