     A                                      UNIQUE
     A          R RARADJM                   TEXT('扣物調折扣紀錄檔')
     A            AMFLAG         1A         COLHDG('處理代碼')
     A            AMCUNO         6A         COLHDG('客戶代號')
     A            AMCUNM        10A         COLHDG('客戶名稱')
     A            AMORNO         6A         COLHDG('訂單編號')
     A            AMSALE         2A         COLHDG('業務員別')
     A            AMAREA         1A         COLHDG('廠區別')
     A            AMINNO        10A         COLHDG('發票號碼')
     A            AMACNT         1A         COLHDG('發票類別')
     A            AMITEM         2S 0       COLHDG('發票項次')
     A            AMINDT         8S 0       COLHDG('發票日期')
     A            AMDECD         1A         COLHDG('發票作廢碼')
     A            AMDEDT         8S 0       COLHDG('發票作廢日期')
     A            AMTXNO         8A         COLHDG('磅單編號')
     A            AMDATE         8S 0       COLHDG('出貨日期')
     A            AMPDNM         3A         COLHDG('品名')
     A            AMQTY1         7P 0       COLHDG('銷貨數量')
     A            AMPRC1         5P 3       COLHDG('銷貨單價')
     A            AMAMT1        11P 0       COLHDG('銷貨金額')
     A            AMQTY2         7P 0       COLHDG('折扣數量')
     A            AMPRC2         5P 3       COLHDG('折扣單價')
     A            AMAMT2         9P 0       COLHDG('折扣金額')
     A            AMUPDM        10A         COLHDG('異動人員')
     A            AMUPDD         8S 0       COLHDG('異動日期')
     A            AMUPDT         6S 0       COLHDG('異動時間')
     A            AMRESV        10A         COLHDG('保留碼')
     A*
     A          K AMINNO
     A          K AMACNT
     A          K AMITEM
