     A                                      UNIQUE
     A          R RARBANK                   TEXT('承購銀行資料檔')
     A            ABFLAG         1A         COLHDG('處理代碼')
     A            ABBKID         3A         COLHDG('銀行代號')
     A            ABBKNM        10O         COLHDG('銀行簡稱')
     A            ABACN1         4A         COLHDG('分行別')
     A            ABACN2        10A         COLHDG('備償專戶帳號')
     A            ABSRTP         1A         COLHDG('手續費計費方式')
     A*                                     1:逐筆發票 2:發票總額
     A            ABSRCG         6S 5       COLHDG('手續費比例')
     A            ABINRT         6S 5       COLHDG('融資成數')
     A            ABDAT1         8S 0       COLHDG('承購起日')
     A            ABDAT2         8S 0       COLHDG('承購止日')
     A            ABUPDM        10A         COLHDG('異動人員')
     A            ABUPDD         8S 0       COLHDG('異動日期')
     A            ABUPDT         6S 0       COLHDG('異動時間')
     A*
     A          K ABBKID
