     A                                      UNIQUE
     A          R RARBBAL                   TEXT('預收貨款增減明細檔')
     A            ALFLAG         1A         COLHDG('處理代碼')
     A            ALYYMM         6S 0       COLHDG('資料年月')
     A            ALITEM         2S 0       COLHDG('資料項次')
     A            ALAAMT         9S 0       COLHDG('本期期初金額')
     A            ALAREA         1A         COLHDG('歸屬廠區')
     A            ALORNO         6A         COLHDG('訂單號碼')
     A            ALCUNO         5A         COLHDG('客戶編號')
     A            ALCUNM        10A         COLHDG('客戶名稱')
     A            ALINNO        10A         COLHDG('本期增加發票號碼')
     A            ALINAR         1A         COLHDG('發票開立廠區')
     A            ALIAMT         9S 0       COLHDG('發票金額')
     A            ALBMTP         9S 0       COLHDG('本期銷貨預收P')
     A            ALBMTT         9S 0       COLHDG('本期銷貨預收T')
     A            ALBMTH         9S 0       COLHDG('本期銷貨預收H')
     A            ALBMTM         9S 0       COLHDG('本期銷貨預收M')
     A            ALBMTK         9S 0       COLHDG('本期銷貨預收K')
     A            ALCMTP         9S 0       COLHDG('本期預收折讓P')
     A            ALCMTT         9S 0       COLHDG('本期預收折讓T')
     A            ALCMTH         9S 0       COLHDG('本期預收折讓H')
     A            ALCMTM         9S 0       COLHDG('本期預收折讓M')
     A            ALCMTK         9S 0       COLHDG('本期預收折讓K')
     A            ALDMTP         9S 0       COLHDG('本期預收退回P')
     A            ALDMTT         9S 0       COLHDG('本期預收退回T')
     A            ALDMTH         9S 0       COLHDG('本期預收退回H')
     A            ALDMTM         9S 0       COLHDG('本期預收退回M')
     A            ALDMTK         9S 0       COLHDG('本期預收退回K')
     A            ALEMTP         9S 0       COLHDG('本期預收轉回P')
     A            ALEMTT         9S 0       COLHDG('本期預收轉回T')
     A            ALEMTH         9S 0       COLHDG('本期預收轉回H')
     A            ALEMTM         9S 0       COLHDG('本期預收轉回M')
     A            ALEMTK         9S 0       COLHDG('本期預收轉回K')
     A            ALMAMT         9S 0       COLHDG('本期餘額')
     A            ALADDM        10A         COLHDG('建立人員')
     A            ALADDD         8S 0       COLHDG('建立日期')
     A            ALADDT         6S 0       COLHDG('建立時間')
     A            ALUPDM        10A         COLHDG('異動人員')
     A            ALUPDD         8S 0       COLHDG('異動日期')
     A            ALUPDT         6S 0       COLHDG('異動時間')
     A            ALFMTP         9S 0       COLHDG('本期專案退稅P')
     A            ALFMTT         9S 0       COLHDG('本期專案退稅T')
     A            ALFMTH         9S 0       COLHDG('本期專案退稅H')
     A            ALFMTM         9S 0       COLHDG('本期專案退稅M')
     A            ALFMTK         9S 0       COLHDG('本期專案退稅K')
     A            ALXMTP         9S 0       COLHDG('本期期中調整P')
     A          K ALYYMM
     A          K ALORNO
     A          K ALITEM
