     A                                      UNIQUE
     A          R RARBBALT                  TEXT('預收貨款增減明細工作檔')
     A            ATORNO         6A         COLHDG('訂單號碼')
     A            ATCODE         4A         COLHDG('單據代號')
     A* 'AA01' 表期初 'AZ01' 表預收發票 'AC01' 表扣預收貨款
     A* 'AR06' 表預收折讓  'AD01' 表預收退回 'AE01'表專案退稅
     A            ATNO           4S 0       COLHDG('單據編號')
     A            ATAREA         1A         COLHDG('廠區')
     A* 'AA01' 時表歸屬廠區,餘表開立廠區
     A            ATAMT          9S 0       COLHDG('金額')
     A            ATINNO        10A         COLHDG('發票號碼')
     A          K ATORNO
     A          K ATCODE
     A          K ATNO
