     A          R RARBTAX                   TEXT('±M®×°hµ|©ú²ÓÀÉ')
     A                                      PFILE(DALIB/ARBTAX)
     A          K AXCODE
     A          K AXVNNO
