     A*                                     UNIQUE
     A          R RARBTAX                   TEXT('±M®×°hµ|©ú²ÓÀÉ')
     A                                      PFILE(ARBTAX)
     A          K AXIVNO
