     A                                      UNIQUE
     A          R RARBTAX                   TEXT('專案退稅明細檔')
     A            AXTRFL         1A         COLHDG('傳輸碼')
     A            AXFLAG         1A         COLHDG('處理代碼')
     A            AXAREA         1A         COLHDG('作廢廠區')
     A            AXYYMM         6S 0       COLHDG('歸屬年月')
     A            AXCUNO         6A         COLHDG('客戶編號')
     A            AXCUNM        10A         COLHDG('客戶名稱')
     A            AXORNO         6A         COLHDG('訂單號碼')
     A            AXITEM         3S 0       COLHDG('資料項次')
     A            AXIVNO        10A         COLHDG('作廢發票號碼')
     A            AXDLDT         8S 0       COLHDG('作廢發票開立日期')
     A            AXATTX        11P 0       COLHDG('作廢銷項稅額')
     A            AXCODE         1A         COLHDG('單據別')
9109 A*                                     1.磅單;2.調整單;3.預收貨款
     A            AXVNNO         8A         COLHDG('單據號碼')
     A            AXVUNO         7A         COLHDG('資料年月')
     A*                                    資料年月＝報稅年月
     A            AXADDM        10A         COLHDG('建立人員')
     A            AXADDD         8S 0       COLHDG('建立日期')
     A            AXADDT         6S 0       COLHDG('建立時間')
     A            AXUPDM        10A         COLHDG('異動人員')
     A            AXUPDD         8S 0       COLHDG('異動日期')
     A            AXUPDT         6S 0       COLHDG('異動時間')
     A*
     A          K AXAREA
     A          K AXORNO
     A          K AXYYMM
     A          K AXITEM
