     A          R RARCATL                   TEXT('銷貨帳款兌現天數彙總檔')
     A            ALCUNO         6A         COLHDG('客戶編號')
     A            ALCUNM        10A         COLHDG('客戶簡稱')
     A            ALORNO         6A         COLHDG('訂單號碼')
     A            ALDAT1         5S 0       COLHDG('最小銷貨帳齡')
     A**** 入帳日期-繳款日期
     A            ALDAT2         5S 0       COLHDG('最小銷貨帳齡')
     A**** 繳款日期-出貨日期
     A            ALDAT3         5S 0       COLHDG('平均銷貨帳齡')
     A**** 入帳日期-出貨日期
     A*
     A          K ALCUNO
     A          K ALORNO
