     A          R RCANDR
     A            CAYY           4S 0       COLHDG('¦~')
     A            CAMM           2S 0       COLHDG('¤ë')
     A            CADD           2S 0       COLHDG('¤é')
     A          K CAYY
     A          K CAMM
     A          K CADD
