     A                                      UNIQUE
     A          R RARCBDW                   TEXT('客戶資料下載設定檔')
     A            ADFLAG         1A         COLHDG('處理代碼')
     A            ADVTNO        10A         COLHDG('客戶統編')
     A            ADCUNM        10O         COLHDG('客戶簡稱')
     A            ADFLE1         1A         COLHDG('委送單檔')
     A            ADSEQ1         6S 0       COLHDG('委送單檔流水號')
     A            ADFLE2         1A         COLHDG('出貨磅單檔')
     A            ADSEQ2         6S 0       COLHDG('出貨磅單檔流水號')
     A            ADFLE3         1A         COLHDG('發票主檔')
     A            ADSEQ3         6S 0       COLHDG('發票主檔流水號')
     A            ADFLE4         1A         COLHDG('發票明細檔')
     A            ADSEQ4         6S 0       COLHDG('發票明細檔流水號')
     A            ADFLE5         1A         COLHDG('發票磅單對照檔')
     A            ADSEQ5         6S 0       COLHDG('發票磅單對照流水號')
     A*銷折退回對照檔
     A            ADFLE6         1A         COLHDG('檔案一')
     A*銷折退回流水號
     A            ADSEQ6         6S 0       COLHDG('檔案一流水號')
     A            ADFLE7         1A         COLHDG('檔案二')
     A            ADSEQ7         6S 0       COLHDG('檔案二流水號')
     A            ADFLE8         1A         COLHDG('檔案三')
     A            ADSEQ8         6S 0       COLHDG('檔案三流水號')
     A            ADRESV        30A         COLHDG('備註')
     A            ADFILE         3A         COLHDG('檔案格式')
     A*
     A          K ADVTNO
