     A*** UPDATE DATE :98/03/26 S00LCL 2008HS135 (9803A)
     A          R RARCINV                   TEXT('外銷報關記錄主檔')
                                            PFILE(ARCINV)
     A****
     A          K R1ORNO
9803AA          S R1FLAG                    COMP(NE 'D')
