     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARCINV
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S02LBU
     A*            4.FUNCTION     外銷報關記錄主檔
     A*            5.DATE-WRITTEN  97/12/02
     A*
     A*****************************************************************
     A                                      UNIQUE
     A          R RARCINV                   TEXT('外銷報關記錄主檔')
     A            R1FLAG         1A         COLHDG('處理代碼')
     A            R1AREA         1A         COLHDG('報關廠區')
     A            R1ORNO         6A         COLHDG('訂單編號')
     A            R1SEQ          3S 0       COLHDG('訂單流水號')
     A            R1OCUS         6A         COLHDG('訂單客戶編號')
     A            R1OCNM        10O         COLHDG('訂單客戶名稱')
     A            R1YYMM         6S 0       COLHDG('報關年月')
     A            R1CDTE         8S 0       COLHDG('報關日期')
     A            R1SACD         8S 0       COLHDG('起出貨日期')
     A            R1EACD         8S 0       COLHDG('訖出貨日期')
     A            R1TRAT         7S 4       COLHDG('實際報關匯率')
     A            R1FCUR        12S 2       COLHDG('外幣報關金額')
     A            R1AMT         10S 0       COLHDG('台幣報關金額')
     A            R1APNO        20A         COLHDG('報單號碼')
     A            R1IVNO        10A         COLHDG('發票號碼')
     A            R1QTY         12S 3       COLHDG('報關數量')
    .A            R1ENTD         8S 0       COLHDG('建檔日期')
     A            R1ENTM        10A         COLHDG('建檔人員')
    .A            R1UPDD         8S 0       COLHDG('異動日期')
     A            R1UPDT         6S 0       COLHDG('異動時間')
     A            R1UPDM        10A         COLHDG('異動人員')
    .A            R1RES1        10A         COLHDG('保留１')
    .A            R1RES2        10A         COLHDG('保留２')
    .A            R1RES3        10A         COLHDG('保留３')
     A          K R1AREA
     A          K R1ORNO
     A          K R1YYMM
     A          K R1SEQ
