     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARCINVL2
     A*            2.PROGRAM-TYPE  LF
     A*            3.AUTHOR        S00LCL
     A*            4.FUNCTION     外銷報關記錄主檔暫存檔
     A*            5.DATE-WRITTEN  98/03/26
     A*
     A*****************************************************************
     A          R RARCINV                   TEXT('外銷報關記錄主檔')
                                            PFILE(ARCINV)
     A****
     A          K R1YYMM
     A          K R1ORNO
     A          S R1FLAG                    COMP(NE 'D')
