     A          R RARCINV                   TEXT('外銷報關記錄主檔')
                                            PFILE(ARCINV)
     A****
     A          K R1ORNO
