     A                                      UNIQUE
     A          R RARCURL                   TEXT('反傾銷客戶關係對照檔')
     A*
     A            ACCUNO         6A         COLHDG('客戶編號')
     A            ACSREL         1A         COLHDG(' CUSREL ')
     A            ACSCAT         1A         COLHDG(' CUSCAT ')
     A            ACNNEL         1A         COLHDG(' CHANNEL ')
     A*
     A          K ACCUNO
