     A*================================================================
     A* 管制類別: 01訂單開立02交單開立03出單開立
     A*             04發票開立05請款作業06傳票代開
     A*================================================================
     A*
     A* 管制類別為發票類者：
     A*
     A* 開立方式：    00每日隨車開立（一車一張）
     A*                 01每日一訂單一張（與一車一張一起處理）
     A*                 02每月一訂單一張
     A*                 03依日期區間彙總一張
     A*                 04挑選銷貨明細開立
     A*                 05人工開立發票
     A*
     A*                 **不在本管制記錄內者為隨車開立（一車一張）
     A*                 -----------------------------------
     A*
     A* 附屬類別一：  00不考慮加工費（手開調整單處理）
     A*                 01加工費合開在出貨發票內
     A*                 02加工費另開一張發票
     A*
     A*                 **不在本管制記錄內者視同不考慮
     A*                 -----------------------------------
     A*
     A* 附屬比率金額一：每公斤銷貨之加工費單價
     A*
     A*                 -----------------------------------
     A*
     A* 附屬類別二：  00不考慮廠租費（手開調整單處理）
     A*                 01廠租費合開在出貨發票內
     A*                 02廠租費另開一張發票
     A*
     A*                 **不在本管制記錄內者視同不考慮
     A*                 -----------------------------------
     A*
     A* 附屬比率金額二：每公斤銷貨之場租費單價
     A*
     A*================================================================
     A*
     A* 本管制檔應與訂單管制檔合用。其方式是先檢核該客戶是否在
     A* 本管制檔內有管制，若無再檢核該訂單在訂單管制檔內之管制
     A* 情形；若有則視其訂單參照碼是否註記Ｙ，若無註記則以本檔
     A* 之管制內容為主，若有註記則必須檢視訂單管制檔內是否有對
     A* 該訂單特殊的管制情形。
     A*
     A*   訂單管制檔：ARODCT
     A*
     A*================================================================
     A                                      UNIQUE
     A          R RARCUCT                   TEXT('客戶管制檔')
     A            A1FLAG         1A         COLHDG('處理旗標')
     A            A1CUNO         6A         COLHDG('客戶編號')
     A            A1RFOR         1A         COLHDG('訂單參照碼')
     A            A1CTKD         2A         COLHDG('管制類別')
     A            A1MTHD         2A         COLHDG('開立方式')
     A            A1TYP1         2P 0       COLHDG('附屬類別一')
     A            A1RAT1        11P 3       COLHDG('附屬比率金額一')
     A            A1TYP2         2P 0       COLHDG('附屬類別二')
     A            A1RAT2        11P 3       COLHDG('附屬比率金額二')
     A            A1TYP3         2P 0       COLHDG('附屬類別三')
     A            A1RAT3        11P 3       COLHDG('附屬比率金額三')
     A*
     A          K A1CUNO
     A          K A1CTKD
