     A                                      UNIQUE
     A          R RARCVCK                   TEXT('沖銷票據主檔')
     A            AKRCNO         6A         COLHDG('沖銷單號')
     A            AKRCTM         2S 0       COLHDG('沖銷項次')
     A            AKUSTP         2A         COLHDG('款項別')
     A            AKPBID        14O         COLHDG('付款銀行')
     A            AKPANO        10A         COLHDG('付款帳號')
     A            AKACTP         1A         COLHDG('借貸別')
     A            AKACNO         4A         COLHDG('會計科目')
     A            AKNTTP         1A         COLHDG('票款別')
     A            AKRLNO        10A         COLHDG('相關號碼')
     A            AKPLAC         1A         COLHDG('付款地')
     A            AKNTNO        10A         COLHDG('票據號碼')
     A            AKDUDT         8S 0       COLHDG('到期日')
     A            AKRAMT        12S 0       COLHDG('收款金額')
     A            AKINDT         8S 0       COLHDG('入帳日')
     A            AKNTCD         1A         COLHDG('兌現碼')
     A            AKSBID        10A         COLHDG('存入銀行')
     A            AKSANO        10A         COLHDG('存入帳號')
     A            AKAMCD         4A         COLHDG('資金代號')
     A            AKWRNO         6A         COLHDG('退回單號')
     A            AKNTDT         8S 0       COLHDG('票據異動日')
     A            AKPRCD         1A         COLHDG('托收碼')
     A            AKPRDT         8S 0       COLHDG('托收日期')
     A            AKTBID        10A         COLHDG('托收銀行')
     A            AKTANO        10A         COLHDG('托收帳號')
     A            AKRESV        30A         COLHDG('備註')
     A            AKBANM        16O         COLHDG('開立票據銀行')
     A            AKDES1        10A         COLHDG('預留一')
     A            AKDES2        10A         COLHDG('預留二')
     A            AKDES3        20A         COLHDG('預留三')
     A            AKDES4        30A         COLHDG('預留四')
     A*
     A          K AKRCNO
     A          K AKRCTM
