     A          R RARCVDT                   TEXT('µo²¼¨R¾P©ú²ÓÀÉ')
     A                                      PFILE(DALIB/ARCVDT)
     A          K ATINNO
     A          K ATRCNO
     A          K ATITEM
