     A                                      UNIQUE
     A          R RARCVDTW                  TEXT('發票沖銷明細主檔')
     A            AWFLAG         1A         COLHDG('處理代號')
     A            AWDELD         1A         COLHDG('刪除碼')
     A            AWINNO        10A         COLHDG('發票號碼')
     A            AWITEM         3S 0       COLHDG('發票沖銷項次')
     A            AWCVDT         8S 0       COLHDG('發票沖銷日期')
     A            AWCAMT        12S 0       COLHDG('沖銷金額')
     A            AWRLN1        10A         COLHDG('相關號碼1')
     A            AWRLN2        10A         COLHDG('相關號碼2')
     A            AWUPDM        10A         COLHDG('沖銷人員')
     A            AWUPDD         8S 0       COLHDG('沖銷日期')
     A            AWUPDT         6S 0       COLHDG('沖銷時間')
     A            AWDLC1         1A         COLHDG('下載碼')
     A            AWDLM1        10A         COLHDG('下載人員')
     A            AWDLD1         8S 0       COLHDG('下載日期')
     A            AWBHID        30A         COLHDG('下載批號')
     A*
     A          K AWINNO
     A          K AWITEM
