     A                                      UNIQUE
     A          R RARCVCK                   TEXT('沖銷票據主檔')
     A            AKRCNO         6A         COLHDG('沖銷單號')
     A            AKRCTM         2S 0       COLHDG('沖銷項次')
     A            AKNTTP         1A         COLHDG('票款別')
     A            AKRLNO        10A         COLHDG('相關號碼')
     A            AKRAMT        12S 0       COLHDG('票據金額')
     A            AKDUDT         8S 0       COLHDG('到期日')
     A            AKINDT         8S 0       COLHDG('入帳日')
     A            AKNTCD         1A         COLHDG('兌現碼')
     A            AKRESV        30A         COLHDG('備註')
     A            AKBANM        16O         COLHDG('開立票據銀行')
     A*
     A          K AKRCNO
     A          K AKRCTM
