     A          R RARCVDTD                  TEXT('發票沖銷明細下載暫存檔')
     A            ADCUM1         1A         COLHDG('資料別')
     A            ADCUM2        90A         COLHDG('資料內容')
