     A                                      UNIQUE
     A          R RARCVDT                   TEXT('發票沖銷明細檔')
     A            ATRCNO         6A         COLHDG('沖銷單號')
     A            ATITEM         2S 0       COLHDG('沖銷項次')
     A            ATAPN1         6A         COLHDG('承購單號')
     A            ATINNO        10A         COLHDG('發票號碼')
     A            ATINDT         8S 0       COLHDG('發票日期')
     A            ATAMT1        12S 0       COLHDG('發票金額')
     A            ATAMT2        12S 0       COLHDG('發票餘額')
     A            ATAMT3        12S 0       COLHDG('本次發票沖銷金額')
     A            ATAMT4        12S 0       COLHDG('發票已沖銷金額')
     A            ATRESV        12A         COLHDG('保留')
     A*
     A          K ATRCNO
     A          K ATITEM
