     A          R RARCVMS                   TEXT('µo²¼¨R¾P¥DÀÉ')
     A                                      PFILE(DALIB/ARCVMS)
     A*
     A          K ASCUNO
     A          K ASRCNO
