     A                                      UNIQUE
     A          R RARDEPT                   TEXT('承購發票預支明細檔')
     A            ADBACH        13A         COLHDG('批次號碼')
     A*                                    日期＋銀行＋2位流水號
     A            ADBKID         3A         COLHDG('銀行代號')
     A            ADCUNO         6A         COLHDG('客戶代號')
     A            ADCUNM        10A         COLHDG('客戶名稱')
     A            ADINNO        10A         COLHDG('發票號碼')
     A            ADINDT         8S 0       COLHDG('發票日期')
     A            ADDPDT         8S 0       COLHDG('預支日期')
     A            ADAAMT        12S 0       COLHDG('發票金額')
     A            ADBAMT        12S 0       COLHDG('預支金額')
     A            ADRATE         6S 5       COLHDG('預支利率')
     A            ADCOD1         1A         COLHDG('過入碼')
     A            ADRLN1        10A         COLHDG('保留碼一')
     A            ADRLN2        10A         COLHDG('保留碼二')
     A            ADADDM        10A         COLHDG('新增人員')
     A            ADADDD         8S 0       COLHDG('新增日期')
     A            ADADDT         6S 0       COLHDG('新增時間')
     A            ADUPDM        10A         COLHDG('過帳人員')
     A            ADUPDD         8S 0       COLHDG('過帳日期')
     A            ADUPDT         6S 0       COLHDG('過帳時間')
     A*
     A          K ADBACH
     A          K ADINNO
