     A          R RARDEPTW                  TEXT('預支工作檔')
     A                                      PFILE(ARDEPTW)
     A          K AWINDT
     A          K AWINNO
