     A                                      UNIQUE
     A          R RARDELT                   TEXT('發票作廢代開明細檔')
     A            ALDEDT         8S 0       COLHDG('作廢日期')
     A            ALINNO        10A         COLHDG('發票號碼')
     A            ALAAMT        11S 0       COLHDG('發票金額')
     A            ALATAX        11S 0       COLHDG('發票稅額')
     A            ALBAMT        11S 0       COLHDG('繳款金額')
     A            ALDELM        10A         COLHDG('作廢人員')
     A            ALDELT         6S 0       COLHDG('作廢時間')
     A            ALUPDM        10A         COLHDG('代開人員')
     A            ALUPDD         8S 0       COLHDG('代開日期')
     A            ALUPDT         6S 0       COLHDG('代開時間')
     A*
     A          K ALINNO
