     A                                      UNIQUE
     A          R RARDEPTW                  TEXT('承購發票預支明細檔')
     A            AWFLAG         1A         COLHDG('處理代號')
     A            AWBACH        13A         COLHDG('批次號碼')
     A*                                    日期＋銀行＋2位流水號
     A            AWBKID         3A         COLHDG('銀行代號')
     A            AWCUNO         6A         COLHDG('客戶代號')
     A            AWCUNM        10A         COLHDG('客戶名稱')
     A            AWINNO        10A         COLHDG('發票號碼')
     A            AWINDT         8S 0       COLHDG('發票日期')
     A            AWDPDT         8S 0       COLHDG('預支日期')
     A            AWAAMT        12S 0       COLHDG('發票金額')
     A            AWBAMT        12S 0       COLHDG('預支金額')
     A            AWRATE         6S 5       COLHDG('預支利率')
     A            AWCOD1         1A         COLHDG('過入碼')
     A            AWRLN1        10A         COLHDG('保留碼一')
     A            AWRLN2        10A         COLHDG('保留碼二')
     A            AWADDM        10A         COLHDG('新增人員')
     A            AWADDD         8S 0       COLHDG('新增日期')
     A            AWADDT         6S 0       COLHDG('新增時間')
     A*
     A          K AWBACH
     A          K AWINNO
