     A                                      UNIQUE
     A          R RARDIDW                   TEXT('折讓銷退下載')
     A            AIDECD         1A         COLHDG('作廢碼')
     A            AIDEDT         8S 0       COLHDG('作廢日期')
     A            AIINDT         8S 0       COLHDG('退折日期')
     A            AINO          10A         COLHDG('發票號碼')
     A            AIMARK         1A         COLHDG('區分')
     A* 1 =銷貨退回 2 =銷貨折讓
     A            AICHIN        32O         COLHDG('品名')
     A            AIQTY         11S 3       COLHDG('重量')
     A            AIUPRC        14S 3       COLHDG('單價')
     A            AICAMT        11S 2       COLHDG('未稅金額')
     A            AICTAX        11S 2       COLHDG('稅額')
     A            AITXTP         1A         COLHDG('稅別')
     A            AIVNNO        10A         COLHDG('營業人統編')
     A            AIRESV         6A         COLHDG('備註')
     A            AISEQN         5S 0       COLHDG('資料處理序號')
     A            AIFILE         6S 0       COLHDG('檔案序號')
     A****
     A          K AIVNNO
     A          K AIFILE
     A          K AISEQN
