     A                                      UNIQUE
     A          R RARDLWT                   TEXT('磅單與運費調整對照檔')
     A            AWFLAG         1A         COLHDG('處理代碼')
     A            AWCUNO         6A         COLHDG('客戶代號')
     A            AWCUNM        10O         COLHDG('客戶簡稱')
     A            AWORNO         6A         COLHDG('訂單號碼')
     A            AWDLVY         6A         COLHDG('交單號碼')
     A            AWWTNO         8A         COLHDG('磅單號碼')
     A            AWWTDT         8S 0       COLHDG('出貨日期')
     A            AWTXNO         8A         COLHDG('調整單號')
     A            AWTXDT         8S 0       COLHDG('調整單開立日')
     A            AWIVNO        10A         COLHDG('發票號碼')
     A            AWCOD1         1A         COLHDG('調整開立碼')
     A            AWCOD2         1A         COLHDG('調整確認碼')
     A            AWCOD3         1A         COLHDG('作廢碼')
     A            AWRESV        10A         COLHDG('備註')
     A            AWRES1        10A         COLHDG('預留1')
     A            AWRES2        16A         COLHDG('預留2')
     A            AWUPDD         8S 0       COLHDG('異動日期')
     A            AWUPDT         6S 0       COLHDG('異動時間')
     A            AWUPDM        10A         COLHDG('異動人員')
     A*
     A          K AWORNO
     A          K AWWTNO
