     A                                      UNIQUE
     A          R RARDLWTW                  TEXT('磅單與運費調整對照檔')
     A            AXFLAG         1A         COLHDG('處理代碼')
     A            AXCUNO         6A         COLHDG('客戶代號')
     A            AXCUNM        10O         COLHDG('客戶簡稱')
     A            AXORNO         6A         COLHDG('訂單號碼')
     A            AXDLVY         6A         COLHDG('交單號碼')
     A            AXWTNO         8A         COLHDG('磅單號碼')
     A            AXWTDT         8S 0       COLHDG('出貨日期')
     A            AXTXNO         8A         COLHDG('調整單號')
     A            AXTXDT         8S 0       COLHDG('調整單開立日')
     A            AXIVNO        10A         COLHDG('發票號碼')
     A            AXCOD1         1A         COLHDG('調整開立碼')
     A            AXCOD2         1A         COLHDG('調整確認碼')
     A            AXCOD3         1A         COLHDG('作廢碼')
     A            AXRESV        10A         COLHDG('備註')
     A            AXRES1        10A         COLHDG('預留1')
     A            AXRES2        16A         COLHDG('預留2')
     A            AXUPDD         8S 0       COLHDG('異動日期')
     A            AXUPDT         6S 0       COLHDG('異動時間')
     A            AXUPDM        10A         COLHDG('異動人員')
     A*
     A          K AXORNO
     A          K AXWTNO
