     A          R RARDLOD                   TEXT('承購發票下載暫存檔')
     A            ADCUM1         1A         COLHDG('資料別')
     A            ADCUM2       100A         COLHDG('資料內容')
