     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARDSDT
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     折讓折扣磅單明細分攤檔
     H*            5.DATE-WRITTEN  103/01/07 2014AR796
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A*                                     UNIQUE
     A          R RARDSDT                   TEXT('折讓折扣磅單明細分攤檔')
     A            ASFLAG         1A         COLHDG('處理代碼')
     A            ASKIND         1A         COLHDG('分攤類別')
     A*                                     K=折扣；D=折讓
     A            ASCUNO         6A         COLHDG('客戶代號')
     A            ASCUNM        10O         COLHDG('客戶名稱')
     A            ASORNO         6A         COLHDG('訂單編號')
     A            ASYYMM         6S 0       COLHDG('處理年月')
     A            ASCONT         3S 0       COLHDG('處理次數')
     A            ASTYPE         1A         COLHDG('發票聯式')
     A            ASSALE         2A         COLHDG('業務員別')
     A            ASAREA         1A         COLHDG('廠區別')
     A            ASAMT4         4S 3       COLHDG('折讓單價／公斤')
     A            ASINNO        10A         COLHDG('發票號碼')
     A            ASACNT         1A         COLHDG('發票類別')
     A            ASITEM         2S 0       COLHDG('發票項次')
     A            ASINDT         8S 0       COLHDG('發票日期')
     A            ASDECD         1A         COLHDG('發票作廢碼')
     A            ASDEDT         8S 0       COLHDG('發票作廢日期')
     A            ASTXNO         8A         COLHDG('磅單編號')
     A            ASTXIT         2S 0       COLHDG('磅單項次')
     A            ASDATE         8S 0       COLHDG('出貨日期')
     A            ASPDNM         3A         COLHDG('品名')
     A            ASQTY1         7S 0       COLHDG('銷貨數量')
     A            ASPRC1         5S 3       COLHDG('銷貨單價')
     A            ASAMT1        11S 0       COLHDG('銷貨金額')
     A            ASKTY2         7S 0       COLHDG('折扣數量')
     A            ASKRC2         5S 3       COLHDG('折扣單價')
     A            ASKMT2         9S 0       COLHDG('折扣金額')
     A            ASDMT1        12S 0       COLHDG('折讓金額')
     A            ASDMT2         8S 0       COLHDG('折讓稅額')
     A            ASDXNO         8A         COLHDG('折讓單號')
     A            ASUPDM        10A         COLHDG('異動人員')
     A            ASUPDD         8S 0       COLHDG('異動日期')
     A            ASUPDT         6S 0       COLHDG('異動時間')
     A            ASRESV        10A         COLHDG('保留碼')
     A*
     A          K ASKIND
     A          K ASINNO
     A          K ASACNT
     A          K ASITEM
     A          K ASTXNO
     A          K ASTXIT
