     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/11  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R RARDSLG                   TEXT('進倉履約折扣紀錄檔')
     A            ADFLAG         1A         COLHDG('處理代碼')
     A            ADCUNO         6A         COLHDG('客戶代號')
     A            ADCUNM        10A         COLHDG('客戶名稱')
     A            ADORNO         6A         COLHDG('訂單編號')
     A            ADSALE         2A         COLHDG('業務員別')
     A            ADAREA         1A         COLHDG('廠區別')
     A            ADINNO        10A         COLHDG('發票號碼')
     A            ADACNT         1A         COLHDG('發票類別')
     A            ADITEM         2S 0       COLHDG('發票項次')
     A            ADINDT         8S 0       COLHDG('發票日期')
     A            ADDECD         1A         COLHDG('發票作廢碼')
     A            ADDEDT         8S 0       COLHDG('發票作廢日期')
     A            ADTXNO         8A         COLHDG('磅單編號')
     A            ADDATE         8S 0       COLHDG('出貨日期')
0409AA            ADPDNM         5A         COLHDG('品名')
     A            ADQTY1         7P 0       COLHDG('銷貨數量')
     A            ADPRC1         5P 3       COLHDG('銷貨單價')
     A            ADAMT1        11P 0       COLHDG('銷貨金額')
     A            ADQTY2         7P 0       COLHDG('折扣數量')
     A            ADPRC2         5P 3       COLHDG('折扣單價')
     A            ADAMT2         9P 0       COLHDG('折扣金額')
     A            ADUPDM        10A         COLHDG('異動人員')
     A            ADUPDD         8S 0       COLHDG('異動日期')
     A            ADUPDT         6S 0       COLHDG('異動時間')
     A            ADRESV        10A         COLHDG('保留碼')
1102AA*
1102AA*保留碼1~4碼程式ARR125P使用
1102AA*保留碼10~10借放運費折扣識別碼(S)；進倉折扣為空白
     A*
     A          K ADINNO
     A          K ADACNT
     A          K ADITEM
