     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARDSDTG
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION
     H*            5.DATE-WRITTEN  105/10/22
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A          R RARDSDTG                  TEXT('折讓明細分攤LOG檔')
     A            TGTXNO        10A         COLHDG('單據編號')
     A            TGIVNO        10A         COLHDG('發票號碼')
     A            TGPCNO         8A         COLHDG('磅單編號')
     A            TGPDNM         5A         COLHDG('品名')
     A            TGAMT         12S 0       COLHDG('折讓金額')
     A            TGTAX         12S 0       COLHDG('折讓稅額')
     A            TGKIND        10A         COLHDG('錯誤來源')
