     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARE041R
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     發票銷貨明細查詢（明細表）
     A*           4.DATE-WRITTEN  88/02/12
     A*           5.WRITER        S02CLJ
     A*
     A*****************************************************************
     A          R AR041T1H
     A                                      SKIPB(003)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      ' PRT-ID  : ARP041T'
     A                                    69
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   136
     A                                      '列表日期:'
     A                                   147
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR-ID  :'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
     A                                    73
     A                                      '發票銷貨對應清單'
     A                                   136
     A                                      '列表時間:'
     A                                   147
     A                                      TIME
     A                                   136
     A                                      '頁　　次:'
     A                                      SPACEB(001)
     A                                   147
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '請款單'
     A                                      SPACEB(002)
     A                                    11
     A                                      '發票號碼'
     A                                    22
     A                                      '發票日期'
     A                                    32
     A                                      '聯式'
     A                                    38
     A                                      '種類'
     A                                    45
     A                                      '客戶'
     A                                    63
     A                                      '訂單'
     A                                    69
     A                                      '業務'
     A                                    80
     A                                      '出貨金額'
     A                                    96
     A                                      '扣預收款'
     A                                   112
     A                                      '銷項稅額'
     A                                   128
     A                                      '發票金額'
     A                                     2
     A                                      '-------'
     A                                      SPACEB(001)
     A                                    11
     A                                      '----------'
     A                                    22
     A                                      '----------'
     A                                    35
     A                                      '-'
     A                                    38
     A                                      '------'
     A                                    45
     A                                      '------'
     A                                    52
     A                                      '----------'
     A                                    63
     A                                      '-----'
     A                                    71
     A                                      '--'
     A                                    75
     A                                      '---------------'
     A                                    91
     A                                      '---------------'
     A                                   107
     A                                      '---------------'
     A                                   123
     A                                      '---------------'
     A                                    60
     A                                      '類別'
     A                                      SPACEB(001)
     A                                    67
     A                                      '單　據'
     A                                    76
     A                                      '項次'
     A                                    84
     A                                      '日　期'
     A                                    95
     A                                      '品　　　　名'
     A                                   114
     A                                      '重量KG'
     A                                   123
     A                                      '單價'
     A                                   134
     A                                      '金　　　額'
     A                                   147
     A                                      '調整磅單'
     A                                    61
     A                                      '----'
     A                                      SPACEB(001)
     A                                    67
     A                                      '--------'
     A                                    77
     A                                      '--'
     A                                    80
     A                                      '-'
     A                                    83
     A                                      '----------'
     A                                    94
     A                                      '---'
     A                                    98
     A                                      '------------'
     A                                   112
     A                                      '----------'
     A                                   123
     A                                      '-------'
     A                                   131
     A                                      '---------------'
     A                                   148
     A                                      '--------'
     A*
     A                                     2
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================'
     A                                      SPACEB(001)
     A**************************************************************************
     A          R AR041T1D
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A            R#APNO         7A  O     2
     A            R#INNO        10A  O    11
     A            R#INDT         8S  O    22
     A                                      EDTWRD('    /  /  ')
     A            R#KIND         1A  O    35
     A            R#INTP         6O  O    38
     A            R#CUNO         6A  O    45
     A            R#CUNM        10A  O    52
     A            R#ORNO         5A  O    63
     A            R#RVID         2A  O    71
     A            R#AAMT        11S  O    75
     A                                      EDTCDE(J)
     A            R#BAMT        11S  O    91
     A                                      EDTCDE(J)
     A            R#ATAX        11S  O   107
     A                                      EDTCDE(J)
     A            R#NBAL        11S  O   123
     A                                      EDTCDE(J)
     A**************************************************************************
     A          R AR041T1C
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A            R#TXCD         4A  O    61
     A            R#TXNO         8A  O    67
     A            R#TXIT         2S  O    77
     A            R#ACNT         1A  O    80
     A            R#DATE         8S 0O    83
     A                                      EDTWRD('    /  /  ')
     A            R#PDCD         3A  O    94
     A            R#PDNM        12O  O    98
     A            R#QTY          7S  O   112
     A                                      EDTCDE(J)
     A            R#UPRC         5S 3O   123
     A                                      EDTCDE(J)
     A            R#TXAM        11S  O   131
     A                                      EDTCDE(J)
     A            R#PCNO         8A  O   148
     A**************************************************************************
     A          R AR041T1L
     A                                      SPACEA(002)
     A                                     1
     A                                      ' '
     A**************************************************************************
     A          R AR041T1T
     A                                      SPACEB(002)
     A*----------------------------------------------------------------*********
     A                                    32
     A                                      '發票金額合計：'
     A            R#AMT1        11S 0    +23
     A                                      EDTCDE(J)
     A                                   +29
     A                                      '磅單金額合計：'
     A            R#WTAM        11S  O    +2
     A                                      EDTCDE(J)
     A                                    36
     A                                      '銷貨合計：'
     A                                      SPACEB(001)
     A                                    +2
     A                                      '品名'
     A                                    +4
     A                                      '數量'
     A                                   +10
     A                                      '金額'
     A**************************************************************************
     A          R AR041T1S
     A                                      SPACEB(001)
     A*----------------------------------------------------------------*********
     A            R#PNM2         3A       52
     A            R#QTY2         9S 0     57
     A                                      EDTCDE(J)
     A            R#AMT2        11S 0     71
     A                                      EDTCDE(J)
     A*****************************************************************
