     A                                      UNIQUE
     A          R AE094F                    TEXT('應收票據明細暫存檔')
     A            W1RVDT         8S 0       COLHDG('繳款日期')
     A            W1ITEM         2S 0       COLHDG('項次')
     A            W1RVNO         6A         COLHDG('繳款編號')
     A            W1RAMT        13P 2       COLHDG('收款金額')
     A            W1CUNO         6A         COLHDG('客戶編號')
     A            W1CUNM        10O         COLHDG('客戶簡稱')
     A            W1PBID        14O         COLHDG('付款銀行')
     A            W1PANO        10A         COLHDG('付款帳號')
     A            W1NTNO        10A         COLHDG('票據號碼')
     A            W1RLNO        10A         COLHDG('相關號碼')
     A            W1ACNO         4A         COLHDG('會計科目')
     A            W1USTP         2A         COLHDG('款項別')
     A            W1NTTP         1A         COLHDG('票據別')
     A            W1ACTP         1A         COLHDG('借貸別')
     A            W1PLAC         1A         COLHDG('付款地')
     A            W1SANO        10A         COLHDG('存入帳號')
     A            W1RESV        12A         COLHDG('保留碼')
     A            W1DUDT         8S 0       COLHDG('到期日')
     A            W1DPNO         4A         COLHDG('部門編號')
     A            W1RVID         2A         COLHDG('收款業務員')
     A            W1UPDD         8S 0       COLHDG('財會異動日期')
     A            W1UPDR        10A         COLHDG('財會異動人員')
     A            W1UPDT         6S 0       COLHDG('財會異動時間')
     A            W1CON1         1A         COLHDG('財會管控碼')
     A            W1CON2         1A         COLHDG('營業管控碼')
     A            W1TXDT         8S 0       COLHDG('營業異動日期')
     A            W1TXUS        10A         COLHDG('營業異動人員')
     A            W1TXTM         6S 0       COLHDG('營業異動時間')
     A*
     A          K W1RVDT
     A          K W1RVNO
     A          K W1NTNO
     A          K W1ITEM
