     A*%%TS  SD  19911219  133015  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARE046S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02HYS
     A*            4.FUNCTION     承購銀行資料登錄
     A*            5.DATE-WRITTEN  90/10/18
     A*            6.DATE-MODIFY   91/11/29 BY S02CSF
     A*                            91/12/19 BY S02CSF
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '結束作業')
     A                                      CA12(12 '回前畫面')
     A*================================================================
     A          R ZM003F1
     A*%%TS  SD  19901030  145451  S02YSH      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 26'も東和鋼鐵企業股份有限公司も'
     A            S#SRID        10A  O  1 70
     A                                  2  2TIME
     A                                  2 26'★承購客戶基本資料資料維護★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A  30        S#MODE         6A  O  3 70DSPATR(RI)
     A*================================================================
     A          R ZM003F2                   SFL
     A*%%TS  SD  19901110  134747  S02YSH      REL-V4R4M0  5769-PW1
     A  70                                  SFLNXTCHG
     A            S#OPT          1Y 0B 10  4EDTCDE(Z)
     A                                      VALUES(0 2 3 4 5)
     A            S#CUNO         6A  O 10  9
     A            S#CNUM        10A  O 10 18
     A            S#BKN1        10A  O 10 29
     A            S#AAM1        12Y 0O 10 40EDTCDE(2)
     A            S#CAM1        12Y 0O 10 56EDTCDE(2)
     A*================================================================
     A          R ZM003F2C                  SFLCTL(ZM003F2)
     A*%%TS  SD  19901110  134747  S02YSH      REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLUP(91 '下頁')
     A N71                                  SFLDSPCTL
     A N72                                  SFLDSP
     A N73                                  SFLEND
     A  74                                  SFLCLR
     A                                      OVERLAY
     A                                  4  4'OP: 2=修改4=刪除5=查詢'
     A            S#LIN1        78A  O  5  2
     A                                  7  4'OP'
     A                                  7  7'客戶編號'
     A                                  7 18'客戶簡稱'
     A                                  7 29'承購銀行'
     A                                  7 46'承購額度'
     A                                  7 60'已融資金額'
     A            S#LIN2        78A  O  8  2
     A            S#KEY1         6A  B  9  9
     A  31                                  DSPATR(PC)
     A            POINT          4S 0H      SFLRCDNBR(CURSOR)
     A*================================================================
     A          R ZM003FM
     A                                      OVERLAY
     A            S#LIN3        78   O 21  2
     A                                 23  2'F3=結束作業'
     A                                    +1'F12=回前畫面'
     A                                    +1'PA1=下頁'
     A                                    +1'PA2=上頁'
     A            S#ERR         70   O 24  2DSPATR(HI)
     A*================================================================
     A          R ZM003F4
     A*%%TS  SD  19911219  133015  S02CSF      REL-V4R4M0  5769-PW1
     A  81                                  CF11(11 '刪除')
     A  80                                  CF10(10 '存檔')
     A                                      OVERLAY
     A                                  5  2'客戶代號:'
     A            S#CUNO         6A  O  5 14
     A                                  5 21'客戶簡稱:'
     A            S#CNUM        10A  O  5 33
     A                                  6  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  7  2'承購銀行代號:'
     A            S#BKID         3A  B  7 18
     A  85                                  DSPATR(PR)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                  8  2'承購銀行簡稱:'
     A            S#BKNM        10J  B  8 18
     A  85                                  DSPATR(PR)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  9  6'承購代號:'
     A            S#COD1         4A  B  9 18
     A  85                                  DSPATR(PR)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 10  6'代號簡稱:'
     A            S#COD2        16J  B 10 18
     A  85                                  DSPATR(PR)
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                 11  6'承購起日:'
     A            S#DAT1         8S 0B 11 18
     A  85                                  DSPATR(PR)
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                 11 31'承購止日:'
     A            S#DAT2         8S 0B 11 43
     A  85                                  DSPATR(PR)
     A  37                                  DSPATR(RI)
     A                                 12  6'承購額度:'
     A            S#AAMT        12S 0B 12 18
     A  85                                  DSPATR(PR)
     A  38                                  DSPATR(PC)
     A  38                                  DSPATR(RI)
     A                                 13  6'預支額度:'
     A            S#BAMT        12S 0B 13 18
     A  85                                  DSPATR(PR)
     A  39                                  DSPATR(PC)
     A  39                                  DSPATR(RI)
     A                                 14  6'已預支金額:'
     A            S#CAMT        12Y 0O 14 20EDTCDE(1)
     A                                 15  6'預支比例:'
     A            S#BRAT         6Y 5O 15 18EDTCDE(2)
     A                                 15 26'%'
     A                                 16  6'承購單合併碼:'
     A            S#CODE         1A  B 16 22
     A                                      VALUES(' ' 'Y')
     A  85                                  DSPATR(PR)
     A                                 18  6'異動人員:'
     A            S#UPDM        10A  O 18 18
     A                                 19  6'異動日期:'
     A            S#UPDD         8Y 0O 19 18EDTWRD('    /  /  ')
     A                                 20  6'異動時間:'
     A            S#UPDT         6Y 0O 20 18EDTWRD('  :  :  ')
     A                                 22  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                 23  2'F3=結束作業'
     A                                 23 16'F12=回前畫面'
     A  80                             23 31'F10=存檔'
     A                                      DSPATR(RI)
     A  81                             23 31'F11=刪除確認'
     A                                      DSPATR(RI)
     A            S#ERR         70A  O 24  2DSPATR(HI)
