     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARE008F
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     帳款更正磅單調整工作檔
     A*            5.DATE-WRITTEN  108/12/27  2019AR00079
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A*
     A          R RAR008F                   TEXT('帳款更正磅單調整工作檔')
     A            F1TXNO         8A         COLHDG('磅單號碼')
     A            F1ITEM         2S 0       COLHDG('項次')
     A            F1ACNT         1A         COLHDG('原因別')
     A            F1PDNM         5A         COLHDG('品名')
     A            F1QTY          7S 0       COLHDG('數量')
     A            F1PRC          5S 3       COLHDG('單價')
     A            F1AMT         11S 0       COLHDG('金額')
     A            F1ORNO         9A         COLHDG('訂單編號')
     A            F1DATE         8S 0       COLHDG('入帳日期')
     A            F1IVNO        10A         COLHDG('發票號碼')
     A            F1CUNO         6A         COLHDG('客戶編號')
     A            F1CUNM        10O         COLHDG('客戶名稱')
     A            F1VRTM         2A         COLHDG('磅次')
     A            F1PDS1         3A         COLHDG('徑度')
     A*
     A          K F1TXNO
     A          K F1ITEM
