     A*%%TS  SD  19810909  141852  JEFF        REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BANKAC)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARE022S-1'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'**銀行帳號維護作業** '
     A            DEVNM         10A  O  2 70
     A                                  5 30'功　　能:'
     A            CODE           1A  B  5 42
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  5 44'(1:新增 2:修改'
     A                                  7 45'3:刪除 4:查詢)'
     A                                  9 30'存款類別:'
     A            TYPE      R        B  9 42REFFLD(ACTYPE)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 11 30'幣　　別:'
     A            CURR      R        B 11 42REFFLD(ACCURR)
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A                                 13 30'帳號代號:'
     A            NO        R        B 13 42REFFLD(ACACNO)
     A  44                                  DSPATR(PC)
     A  44                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A***************************************************************
     A          R DETAIL
     A*%%TS  SD  19810909  141852  JEFF        REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                      CF10
     A                                      CF12
     A                                  1 70'ARE022S-2'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            MOD            6A  O  2  2DSPATR(RI)
     A                                  2 28'**銀行帳號維護作業** '
     A            DEVNM         10A  O  2 70
     A                                  5 28'存款類別　:'
     A            TYPE      R        O  5 42REFFLD(ACTYPE)
     A            TYPEC         12O  O  5 44
     A                                  7 28'幣　　別　:'
     A            CURR      R        O  7 42REFFLD(ACCURR)
     A            CURRC         10O  O  7 44
     A                                  9 28'帳號代號　:'
     A            NO        R        O  9 42REFFLD(ACACNO)
     A                                 11 28'舊帳號代號:'
     A            BKNO          10A  B 11 42
     A  70                                  DSPATR(PR)
     A  47                                  DSPATR(PC)
     A  47                                  DSPATR(RI)
     A                                 13 28'帳號簡稱　:'
     A            BNAM      R     J  B 13 42REFFLD(ACBNAM)
     A  70                                  DSPATR(PR)
     A                                 15 28'帳號全稱　:'
     A            NAME      R     J  B 15 42REFFLD(ACNAME)
     A  70                                  DSPATR(PR)
     A                                 17 28'所屬廠別　:'
     A            AREA      R        B 17 42REFFLD(ACAREA)
     A  70                                  DSPATR(PR)
     A  45                                  DSPATR(PC)
     A  45                                  DSPATR(RI)
     A                                 19 28'所屬銀行　:'
     A            BAID      R        B 19 42REFFLD(ACBAID)
     A  70                                  DSPATR(PR)
     A  46                                  DSPATR(PC)
     A  46                                  DSPATR(RI)
     A            BAIDN         10A  O    +1
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:檢核'
     A                                 24 19'PF03:結束'
     A                                 24 32'PF10:存檔'
     A                                 24 45'PF12:回前畫面'
