     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARE098F
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     區間發票開立試算維護工作檔
     A*            5.DATE-WRITTEN  108/11/20  2019AR00077
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A*                                     UNIQUE
     A          R RAR098F                   TEXT('區間發票開立試算工作檔')
     A            F1TXNO         8A         COLHDG('磅單號碼')
     A            F1DATE         8S 0       COLHDG('日期')
     A            F1ORN5         6A         COLHDG('訂單編號')
     A*
     A          K F1ORN5
     A          K F1DATE
     A          K F1TXNO
