     A*%%TS  SD  19810909  141852  JEFF        REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BANKID)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARE023S-1'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 30'**往來銀行維護作業** '
     A            DEVNM         10A  O  2 70
     A                                  5 32'功　能:'
     A            CODE           1A  B  5 42
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  5 44'(1:新增 2:修改'
     A                                  7 45'3:刪除 4:查詢)'
     A                                  9 32'總　行:'
     A            BID1      R        B  9 42REFFLD(BAID1)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 11 32'分　行:'
     A            BID2      R        B 11 42REFFLD(BAID2)
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A***************************************************************
     A          R DETAIL
     A*%%TS  SD  19810909  141852  JEFF        REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                      CF10
     A                                      CF12
     A                                  1 70'ARE023S-2'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            MOD            6A  O  2  2DSPATR(RI)
     A                                  2 30'**往來銀行維護作業** '
     A            DEVNM         10A  O  2 70
     A                                  5 30'總　　行:'
     A            BID1      R        O  5 42REFFLD(BAID1)
     A                                  7 30'分　　行:'
     A            BID2      R        O  7 42REFFLD(BAID2)
     A                                 11 30'銀行簡稱:'
     A            BNAM      R     J  B 11 42REFFLD(BABNAM)
     A  70                                  DSPATR(PR)
     A                                 13 30'銀行全稱:'
     A            NAME      R     J  B 13 42REFFLD(BANAME)
     A  70                                  DSPATR(PR)
     A                                 15 30'所屬地區:'
     A            AREA      R        B 15 42REFFLD(BAAREA)
     A  70                                  DSPATR(PR)
     A  44                                  DSPATR(PC)
     A  44                                  DSPATR(RI)
     A                                 17 30'銀行類別:'
     A            RESV1         22   B 17 42
     A  70                                  DSPATR(PR)
     A                                 18 42'("L":本國" ":外商)'
     A                                 19 30'結帳類別:'
     A            RESV2          1   B 19 42
     A  70                                  DSPATR(PR)
     A                                 20 42'("M":月結"D":日結)'
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:檢核'
     A                                 24 19'PF03:結束'
     A                                 24 32'PF10:存檔'
     A                                 24 45'PF12:回前畫面'
