     A*%%***********************************************************************
     A*%%TS  RD  19910225  104422  S02YSH      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARE050T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     進倉履約折讓自動處理-開立清單
     A*           4.DATE-WRITTEN  91/02/22
     A*           5.WRITER        S02YSH
     A*
     A*
     A*****************************************************************
     A          R AR050TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A                                     2
     A                                      '報表代號: ARR050T'
     A                                    52
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   110
     A                                      '列表日期:'
     A                                   122
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '開立人員:'
     A                                      SPACEB(001)
     A            T#USID        10        +1
     A                                    49
     A                                      '進倉履約折讓自動處理-開立清單'
     A                                   110
     A                                      '開立時間:'
     A                                   122
     A                                      TIME
     A                                     2
     A                                      '客戶代號:'
     A                                      SPACEB(001)
     A            T#CUNO         6        14
     A            T#CUNM        10        +2
     A                                   110
     A                                      '頁　　次:'
     A                                   122
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1       132         1
     A                                      SPACEB(001)
     A                                     2
     A                                      '訂單號碼'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '發票號碼'
     A                                    +2
     A                                      '發票日期'
     A                                    +2
     A                                      '產品類別'
     A                                    +2
     A                                      '產品數量'
     A                                    +2
     A                                      '折讓單價'
     A                                    +3
     A                                      '折讓金額'
     A                                    +2
     A                                      '折讓稅額'
     A                                    +3
     A                                      '折讓單號'
     A                                   111
     A                                      '入帳日期'
     A            T#LIN2       132         1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR050T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A N60        T#ORNO         6         4
     A N61        T#IVNO        10        13
     A N61        T#IVDT         6  0     26
     A                                      EDTCDE(Y)
     A            T#PROD         3        41
     A            T#QTY1         7  0     49
     A                                      EDTCDE(J)
     A            T#AMT1         4  3     65
     A                                      EDTCDE(J)
     A            T#AMT2         7  0     74
     A                                      EDTCDE(J)
     A            T#TAX          5  0     89
     A                                      EDTCDE(J)
     A            T#TXNO         6       100
     A            T#TXIT         2  0    106
     A            T#TXDT         6  0    112
     A                                      EDTCDE(Y)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR050T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    33
     A                                      '訂單小計：'
     A                                      SPACEB(001)
     A            T#TQT1         8  0     48
     A                                      EDTCDE(J)
     A            T#TAM1         8  0     73
     A                                      EDTCDE(J)
     A            T#TAX1         6  0     88
     A                                      EDTCDE(J)
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR050T3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    33
     A                                      '客戶小計：'
     A                                      SPACEB(001)
     A            T#TQT2         8  0     48
     A                                      EDTCDE(J)
     A            T#TAM2         8  0     73
     A                                      EDTCDE(J)
     A            T#TAX2         6  0     88
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR050TM
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    49
     A                                      '無任何開立資料!!!'
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARE050T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       200      *N     )
     A*%%***********************************************************************
