     A*****************************************************************
     A*
     A*          >>  PROGRAM INTRODUCTION  <<
     A*         1.PROGRAM-ID     ARE053S
     A*         2.PROGRAM-TYPE   RPG/400
     A*         3.AUTHOR         S02CSF
     A*         4.FUNCTION      應收帳款承購人工票據兌現--檢核
     A*         5.DATE-WRITTEN   92/02/11
     A*         6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '結束')
     A                                      CA12(12 '回上頁')
     A*================================================================
     A          R AR053H
     A*%%TS  SD  19920212  103735  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 28'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARE053S'
     A                                  2  2TIME
     A                                  2 28'應收帳款承購人工票據兌現'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            U#USID        10A  O  3  2
     A*================================================================
     A          R AR053F1
     A*%%TS  SD  19920212  103735  S02CSF      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                  8 28'承購銀行:'
     A            S#BKI1         3A  B  8 40
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                  8 47'(空白表示全部)'
     A                                 10 28'客戶代號:'
     A            S#CUN1         5A  B 10 40
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 10 47'(空白表示全部)'
     A                                 23  5'F3=結束'
     A                                 23 15'F12=回前畫面'
     A            S#ERR1        70A  O 24  2DSPATR(HI)
