     A                                      UNIQUE
     A          R RAR053F1                  TEXT('應收帳款承購人工兌現')
     A            A1CUNO         5A         COLHDG('客戶代號')
     A            A1CUNM        10A         COLHDG('客戶名稱')
     A            A1BKID         3A         COLHDG('銀行代號')
     A            A1BKNM        10A         COLHDG('銀行名稱')
     A*
     A          K A1CUNO
