     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARE111S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     更換請款單業務員作業
     A*            5.DATE-WRITTEN  112/10/26
     A*            6.UPDATE  DATE
     A*
     A*
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARE111S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 29'更換請款單業務員作業'
     A            DEVNM         10A  O  2 70
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                  7 24'請款單號:'
     A            S#APNO         7A  B    +1
     A  41                                  DSPATR(PC RI)
     A                                  9 24'原業務員:'
     A            S#SALE         1A  B    +1
     A  42                                  DSPATR(PC RI)
     A                                    +1'換成:'
     A            S#CHSA         1A  B    +1
     A  42                                  DSPATR(PC RI)
     A                                 13 12'確認請款單銷貨發票開立廠+
     A                                       區為U，此程式僅針對U廠'
     A                                      DSPATR(HI)
     A                                 14 12'修改磅單及P廠發票資料'
     A                                      DSPATR(HI)
     A                                 16 12'若為調整發票，則手動修改+
     A                                       P廠TRNDTL相關資料'
     A                                      DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
