     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARELCE
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     電子押匯發票明細介面檔
     A*            5.DATE-WRITTEN  113/01/03 2024AR00003
     A*            6.UPDATE  DATE
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R RARELCE                   TEXT('電子押匯介面檔')
     A            EEFLAG         1A         COLHDG('處理代碼')
     A            EECUNO         6A         COLHDG('M客戶編號')
     A            EERVNO        16A         COLHDG('M匯票號碼；繳款單')
     A****
     A            EEINNO        16A         COLHDG('M發票號碼')
     A            EEITNO         5S 0       COLHDG('M項次')
     A            EEPDBF       256O         COLHDG('M產品摘要')
     A            EEPIEC         9S 0       COLHDG('M件數')
     A            EEUTCT        12S 2       COLHDG('M貨款單價')
     A            EECTAT        12S 2       COLHDG('M貨款')
     A            EESPEC       256O         COLHDG('O規格說明')
     A            EEPCUT        32O         COLHDG('O件數單位')
     A            EEWEGT        12S 2       COLHDG('O重量')
     A            EEWEUT        32O         COLHDG('O重量單位')
     A            EEUTFT        12S 2       COLHDG('O運費單價')
     A            EEFTAT        12S 2       COLHDG('O運費')
     A****
     A            EETMDT         8S 0       COLHDG('傳輸日期')
     A            EETMTM         6S 0       COLHDG('傳輸時間')
     A            EETMOP        10A         COLHDG('傳輸人員')
     A            EETAWS        10A         COLHDG('傳輸工作站')
     A            EESTCL         1A         COLHDG('執行碼')
     A*
     A            EEXPDD         8S 0       COLHDG('上送日期')
     A            EEXPDT         6S 0       COLHDG('上送時間')
     A            EEXUSR        10A         COLHDG('上送人員')
     A            EEMAR3        30A         COLHDG('備註')
     A****
     A*
     A          K EERVNO
     A          K EEINNO
     A          K EEITNO
