     A****************************************************************
     A*
     A*            UPDATE  DATE  103/05/23 2014AR832 S00WCJ (0305A)
     A*                           增加銷貨未傳欄位
     A*
     A****************************************************************
     A
     A                                      UNIQUE
     A          R RARFNDS                   TEXT('帳款明細介面檔')
     A            AFVTNO        10A         COLHDG('客戶統編')
     A            AFCUNM        10O         COLHDG('客戶簡稱')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A            AFTAMT        12S 0       COLHDG('應付帳款')
     A            AFPAMT        12S 0       COLHDG('已沖帳款')
     A            AFDAMT        12S 0       COLHDG('未付帳款')
     A            AFRAMT        12S 0       COLHDG('預收貨款')
     A            AFEAMT        12S 0       COLHDG('暫收貨款餘額')
     A            AFFAMT        12S 0       COLHDG('未結案信用狀金額')
     A            AFGAMT        12S 0       COLHDG('已押匯金額')
     A            AFHAMT        12S 0       COLHDG('已預告出貨金額')
     A            AFIAMT        12S 0       COLHDG('可出貨餘額')
     A            AFUPDD         8S 0       COLHDG('更新日期')
0305AA*銷貨未傳
0305AA            AFVAMT        12S 0       COLHDG('已銷貨未合併金額')
     A*
     A          K AFVTNO
     A          K AFORNO
