     A*%%TS  SD  19890713  140812  S02HYS      REL-V3R7M0  5716-PW1
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARI044S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02HYS
     A*            4.FUNCTION
     A*            5.DATE-WRITTEN  89/07/12
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '結束作業')
     A                                      CA12(12 '回前畫面')
     A*================================================================
     A          R ARI044H
     A                                  2  2DATE  EDTCDE(Y)
     A                                  2 26'も東和鋼鐵企業股份有限公司も'
     A            S#SRID        10      2 70
     A                                  3  2TIME
     A                                  3 30'★單據號碼查詢作業★'
     A                                      DSPATR(RI)
     A            S#DEVN        10   O  3 70
     A*================================================================
     A          R ARI0441                   SFL
     A*%%TS  SD  19890713  113257  S02HYS      REL-V3R7M0  5716-PW1
     A            S#CODW         1A  O 11  7
     A            S#VNNO         8A  O 11 14
     A*****************************************************************
     A          R ARI044C                   SFLCTL(ARI0441)
     A*%%TS  SD  19890713  140812  S02HYS      REL-V3R7M0  5716-PW1
     A  *DS3                                SFLLIN(0010)
     A                                      SFLSIZ(0031)
     A                                      SFLPAG(0030)
     A                                      ROLLUP(91 '下頁')
     A N71                                  SFLDSPCTL
     A N72                                  SFLDSP
     A N73                                  SFLEND
     A  74                                  SFLCLR
     A                                      OVERLAY
     A                                  6  2'發票號碼:'
     A            S#IVNO        10A  B  6 14
     A  31                                  DSPATR(PC)
     A                                  7  2'單據代號:1=磅單2=調整單'
     A                                  9  2'單據代號'
     A                                  9 13'單據號碼'
     A                                  9 27'單據代號'
     A                                  9 38'單據號碼'
     A                                  9 52'單據代號'
     A                                  9 63'單據號碼'
     A            S#LINE        74A  O 10  2
     A            POINT          4S 0H      SFLRCDNBR(CURSOR)
     A*****************************************************************
     A          R ARI044M
     A                                      OVERLAY
     A            S#LINE        74   O 21  2
     A                                 23  1'F3=結束作業'
     A                                    +1'F12=回前畫面'
     A                                    +1'PA1=下頁'
     A                                    +1'PA2=上頁'
     A            S#ERR         70   O 24  2DSPATR(HI)
