     A*%%TS  SD  19920306  134030  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*          >>  PROGRAM INTRODUCTION  <<
     A*        1.PROGRAM-ID       ARI050S
     A*        2.PROGRAM-TYPE     RPG/400
     A*        3.AUTHOR           S02CSF
     A*        4.FUNCTION        應收帳款承購狀況查詢
     A*        5.DATE-WRITTEN     92/03/06
     A*        6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '結束')
     A                                      CA12(12 '回上頁')
     A*================================================================
     A          R AR050T1H
     A*%%TS  SD  19920306  112846  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 30'東和鋼鐵股份有限公司'
     A                                  1 70'ARI050S'
     A                                  2  2TIME
     A                                  2 28'★應收帳款承購狀況查詢★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                 10 27'銀行代號：'
     A            S#BKID         4A  B 10 40
     A                                 10 46'(空白表全部)'
     A                                 12 27'客戶代號：'
     A            S#CUNO         5A  B 12 40
     A                                 12 46'(空白表全部)'
     A                                 23  3'F3=離開'
     A                                 23 15'F12=回前畫面'
     A            S#ERR1        70A  O 24  3
     A*================================================================
     A          R AR050F1                   SFL
     A*%%TS  SD  19920306  134030  S02CSF      REL-V4R4M0  5769-PW1
     A            S#CUNO         5A  O  9  4
     A            S#BKNM        10A  O  9 13
     A            S#AAMT         9Y 0O  9 25EDTCDE(1)
     A            S#EAMT         9Y 0O  9 39EDTCDE(1)
     A            S#FAMT         9Y 0O  9 53EDTCDE(1)
     A            S#AAM1         9Y 0O  9 67EDTCDE(1)
     A            S#CUNM        10A  O 10  2
     A            S#BAMT         9Y 0O 10 14EDTCDE(1)
     A            S#CAMT         9Y 0O 10 27EDTCDE(1)
     A            S#HAMT         9Y 0O 10 41EDTCDE(1)
     A            S#GAMT         9Y 0O 10 56EDTCDE(1)
     A            S#IAMT         9Y 0O 10 69EDTCDE(1)
     A*================================================================
     A          R AR050F1C                  SFLCTL(AR050F1)
     A*%%TS  SD  19920306  132832  S02CSF      REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0006)
     A N71                                  SFLDSPCTL
     A N72                                  SFLDSP
     A  73                                  SFLCLR
     A N74                                  SFLEND
     A                                      OVERLAY
     A                                  5  2'客戶代號'
     A                                  5 13'銀行名稱'
     A                                  5 24'承購額度'
     A                                  5 36'前日承購金額'
     A                                  5 51'本日承購金額'
     A                                  5 66'本日承購餘額'
     A                                  6  2'客戶名稱'
     A                                  6 15'融資額度'
     A                                  6 26'已融資金額'
     A                                  6 41'逾期未兌現'
     A                                  6 55'可動撥餘額'
     A                                  6 70'帳上餘額'
     A            S#LIN1        78A  O  7  2
     A            S#KEY1         5A  B  8  4DSPATR(PC)
     A            S#NBR          4S 0H      SFLRCDNBR(CURSOR)
     A*================================================================
     A          R AR050F1M
     A*%%TS  SD  19920306  133833  S02CSF      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                 23 16'F3=結束'
     A                                 23 26'F12=回前畫面'
     A                                 23 42'PA1=下頁'
     A                                 23 53'PA2=上頁'
     A            S#LIN2        78A  O 21  2
     A            S#ERR2        70A  O 24  2DSPATR(HI)
