     A                                      UNIQUE
     A          R RARINVM                   TEXT('承購發票主檔')
     A            AMFLAG         1A         COLHDG('處理代碼')
     A            AMINNO        10A         COLHDG('發票號碼')
     A            AMINDT         8S 0       COLHDG('發票日期')
     A            AMDUDT         8S 0       COLHDG('到期日期')
     A            AMINTP         1A         COLHDG('發票聯式')
     A            AMDELT         1A         COLHDG('作廢碼')
     A            AMDELD         8S 0       COLHDG('作廢日期')
     A            AMCUNO         6A         COLHDG('客戶編號')
     A            AMCUNM        10O         COLHDG('客戶簡稱')
     A            AMAAMT        12S 0       COLHDG('銷貨金額')
     A            AMATAX         9S 0       COLHDG('銷貨稅額')
     A            AMBAMT        12S 0       COLHDG('折讓金額')
     A            AMBTAX         9S 0       COLHDG('折讓稅額')
     A            AMCAMT        12S 0       COLHDG('預收金額')
     A            AMDAMT        12S 0       COLHDG('發票金額')
     A            AMEAMT        12S 0       COLHDG('已融資金額')
     A            AMFAMT        12S 0       COLHDG('已沖銷金額')
     A            AMAPN1         6A         COLHDG('承購單號')
     A            AMAPD1         8S 0       COLHDG('承購日期')
     A            AMAPN2         6A         COLHDG('客戶請款單號')
     A            AMAPD2         8S 0       COLHDG('客戶請款日期')
     A            AMORNO         6A         COLHDG('訂單號碼')
     A            AMAREA         1A         COLHDG('開立廠區')
     A            AMACN1         7A         COLHDG('手續費傳票號碼')
     A            AMDAT1         8S 0       COLHDG('手續費代開日期')
     A            AMDLC1         1A         COLHDG('承購下載碼')
     A            AMBLCB        30A         COLHDG('承購下載批號')
     A            AMDLM1        10A         COLHDG('承購下載人員')
     A            AMDLD1         8S 0       COLHDG('承購下載日期')
     A            AMAPCD         1A         COLHDG('承購確認碼')
     A            AMCHKC         1A         COLHDG('對帳碼')
     A            AMCHKM        10A         COLHDG('對帳人員')
     A            AMCHKD         8S 0       COLHDG('對帳日期')
     A            AMDLC2         1A         COLHDG('對帳下載碼')
     A            AMDLM2        10A         COLHDG('對帳下載人員')
     A            AMDLD2         8S 0       COLHDG('對帳下載日期')
     A            AMCLOC         1A         COLHDG('結案碼')
     A            AMCLOM        10A         COLHDG('結案人員')
     A            AMCLOD         8S 0       COLHDG('結案日期')
     A            AMUPDM        10A         COLHDG('異動人員')
     A            AMUPDD         8S 0       COLHDG('異動日期')
     A            AMUPDT         6S 0       COLHDG('異動時間')
     A*
     A          K AMINNO
