     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/11  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R RARINVD                   TEXT('承購發票明細檔')
     A            AVFLAG         1A         COLHDG('處理代碼')
     A            AVINNO        10A         COLHDG('發票號碼')
     A            AVACNT         1A         COLHDG('類別')
     A            AVITEM         2S 0       COLHDG('項次')
     A            AVACDT         8S 0       COLHDG('入帳日期')
     A            AVORNO         9A         COLHDG('訂單號碼')
0409AA            AVPDCD         5A         COLHDG('品名代號')
     A            AVQTY          7P 0       COLHDG('數量')
     A            AVUPRC         5P 3       COLHDG('單價')
     A            AVAMT         11P 0       COLHDG('金額')
     A            AVDECD         1A         COLHDG('作廢碼')
     A            AVDEDT         8S 0       COLHDG('作廢日期')
     A            AVAPNO         8A         COLHDG('憑證編號')
     A            AVACNO         7A         COLHDG('傳票編號')
     A            AVFL01         1A         COLHDG('過訂單碼')
     A            AVFL02         1A         COLHDG('過發票碼')
     A            AVFL03         1A         COLHDG('類別碼')
     A            AVTXAR         1A         COLHDG('異動廠區')
     A            AVTXDT         8S 0       COLHDG('異動日期')
     A            AVRESV         5A         COLHDG('保留碼')
     A*
     A          K AVINNO
     A          K AVACNT
     A          K AVITEM
