     A                                      UNIQUE
     A          R RARINVMW                  TEXT('承購發票主檔')
     A            AWFLAG         1A         COLHDG('處理代碼')
     A            AWINNO        10A         COLHDG('發票號碼')
     A            AWINDT         8S 0       COLHDG('發票日期')
     A            AWDUDT         8S 0       COLHDG('到期日期')
     A            AWINTP         1A         COLHDG('發票聯式')
     A            AWDELT         1A         COLHDG('作廢碼')
     A            AWDELD         8S 0       COLHDG('作廢日期')
     A            AWCUNO         6A         COLHDG('客戶編號'        )
     A            AWCUNM        10O         COLHDG('客戶簡稱')
     A            AWAAMT        12S 0       COLHDG('銷貨金額')
     A            AWATAX         9S 0       COLHDG('銷貨稅額')
     A            AWBAMT        12S 0       COLHDG('折讓金額')
     A            AWBTAX         9S 0       COLHDG('折讓稅額')
     A            AWCAMT        12S 0       COLHDG('預收金額')
     A            AWDAMT        12S 0       COLHDG('發票金額')
     A            AWEAMT        12S 0       COLHDG('已融資金額')
     A            AWFAMT        12S 0       COLHDG('已沖銷金額')
     A            AWAPN1         6A         COLHDG('承購單號')
     A            AWAPD1         8S 0       COLHDG('承購日期')
     A            AWAPCD         1A         COLHDG('承購確認碼')
     A            AWAPN2         6A         COLHDG('客戶請款單號')
     A            AWAPD2         8S 0       COLHDG('客戶請款日期')
     A            AWORNO         6A         COLHDG('訂單號碼')
     A            AWAREA         1A         COLHDG('開立廠區')
     A            AWACN1         7A         COLHDG('手續費傳票號碼')
     A            AWDAT1         8S 0       COLHDG('手續費代開日期')
     A            AWDLC1         1A         COLHDG('承購下載碼')
     A            AWDLM1        10A         COLHDG('承購下載人員')
     A            AWDLD1         8S 0       COLHDG('承購下載日期')
     A            AWBLCB        30A         COLHDG('承購下載批號')
     A            AWCHKC         1A         COLHDG('對帳碼')
     A            AWCHKM        10A         COLHDG('對帳人員')
     A            AWCHKD         8S 0       COLHDG('對帳日期')
     A            AWDLC2         1A         COLHDG('對帳下載碼')
     A            AWDLM2        10A         COLHDG('對帳下載人員')
     A            AWDLD2         8S 0       COLHDG('對帳下載日期')
     A            AWCLOC         1A         COLHDG('結案碼')
     A            AWCLOM        10A         COLHDG('結案人員')
     A            AWCLOD         8S 0       COLHDG('結案日期')
     A            AWUPDM        10A         COLHDG('異動人員')
     A            AWUPDD         8S 0       COLHDG('異動日期')
     A            AWUPDT         6S 0       COLHDG('異動時間')
     A*
     A          K AWINNO
