     A          R RARINVM                   TEXT('©”¡ µo≤º•D¿…')
     A                                      PFILE(DALIB/ARINVM)
     A          K AMAPD1
     A          K AMAPN1
     A          K AMCUNO
     A          K AMINNO
