     A          R RARINVM                   TEXT('©”¡ µo≤º•D¿…')
     A                                      PFILE(ARINVM)
     A          K AMCUNO
     A          K AMINDT
     A          K AMINNO
