     A                                      UNIQUE
     A          R RARINVMX                  TEXT('承購發票主檔')
     A            AWAPD1         8S 0       COLHDG('承購日期')
     A            AWCUNO         6A         COLHDG('客戶編號')
     A            AWCUNM        10O         COLHDG('客戶簡稱')
     A            AWAPN1         6A         COLHDG('承購單號')
     A            AWDAMT        12S 0       COLHDG('承購單總金額')
     A            AWAPCD         1S         COLHDG(' OP CODE ')
     A            AWEAMT        12S 0       COLHDG('承購單選取金額')
     A*
     A          K AWAPD1
     A          K AWCUNO
     A          K AWAPN1
