     A          R RARINVM                   TEXT('©”¡ µo≤º•D¿…')
     A                                      PFILE(ARINVM)
     A          K AMBLCB
     A          K AMINNO
