     A                                      UNIQUE
     A          R RARLCDSW                  TEXT('請款單介面檔')
     A            AWORNO         6A         COLHDG('訂單號碼')
     A            AWRCDT         8S 0       COLHDG('最後繳款日期')
     A*
     A          K AWORNO
