     A                                      UNIQUE
     A          R RARLCDS                   TEXT('請款單介面檔')
     A            ALVTNO        10A         COLHDG('客戶統編')
     A            ALCUNM        10O         COLHDG('客戶簡稱')
     A            ALAPNO         7A         COLHDG('請款單號')
     A            ALAPDT         8S 0       COLHDG('請款日期')
     A            ALORNO         6A         COLHDG('訂單號碼')
     A            ALIVDT         8S 0       COLHDG('發票日期')
     A            ALIVNO        10A         COLHDG('發票號碼')
     A            ALWTNO         8A         COLHDG('磅單號碼')
     A            ALWQTY         9S 0       COLHDG('出貨重量')
     A            ALWAMT        12S 0       COLHDG('出貨金額')
     A            ALSAMT        12S 0       COLHDG('折讓銷退金額')
     A            ALRAMT        12S 0       COLHDG('扣預收金額')
     A            ALITAX        12S 0       COLHDG('銷項稅額')
     A            ALAMNT        12S 0       COLHDG('請款金額')
     A            ALXAMT        12S 0       COLHDG('繳款金額')
     A            ALYAMT        12S 0       COLHDG('發票餘額')
     A            ALAPST         1A         COLHDG('請款狀態')
     A*                                     0:未繳款
     A*                                     1:部分繳款
     A*                                     2:已繳款
     A            ALPDAT         8S 0       COLHDG('繳款日期')
     A            ALBANK         3A         COLHDG('承購銀行代號')
     A            ALBADT         8S 0       COLHDG('承購日期')
     A            ALBHKD        16O         COLHDG('單據種類')
     A            ALBHNO        20A         COLHDG('單據編號')
     A            ALBHBK        16O         COLHDG('開立銀行')
     A            ALBHD1         8S 0       COLHDG('開立日期')
     A            ALBHD2         8S 0       COLHDG('押匯日期')
     A            ALCURY         3A         COLHDG('幣別')
     A            ALBAMT        11S 0       COLHDG('單據餘額')
     C*
     A          K ALVTNO
     A          K ALAPNO
     A          K ALORNO
     A          K ALIVNO
     A          K ALWTNO
