     A                                      UNIQUE
     A          R RARLCLG                   TEXT('請款單L/C紀錄檔')
     A            ALFLAG         1A         COLHDG('處理代碼')
     A            ALCUNO         6A         COLHDG('客戶編號')
     A            ALCUNM        10O         COLHDG('客戶名稱')
     A            ALORNO         6A         COLHDG('訂單編號')
     A            ALAPNO         6A         COLHDG('請款單號')
     A            ALLCNO        20A         COLHDG('信用狀編號')
     A            ALBANK        16O         COLHDG('銀行分行')
     A            ALAAMT        11P 0       COLHDG('信用狀額度')
     A            ALBAMT        11P 0       COLHDG('信用狀餘額')
     A            ALCURY         3A         COLHDG('幣別')
     A            ALDAT1         8S 0       COLHDG('開立日期')
     A            ALDAT2         8S 0       COLHDG('押匯日期')
     A            ALUPAR         1A         COLHDG('異動廠區')
     A            ALUPDM        10A         COLHDG('異動人員')
     A            ALUPDD         8S 0       COLHDG('異動日期')
     A            ALUPDT         6S 0       COLHDG('異動時間')
     A            ALRESV        24A         COLHDG('保留碼')
     A*
     A          K ALAPNO
