     A                                      UNIQUE
     A          R RARLCBL                   TEXT('信用狀主檔FOR SQL')
     A            ALVANO        10A         COLHDG('客戶統編')
     A            ALCUNM        10O         COLHDG('客戶名稱')
     A            ALLCNO        20A         COLHDG('信用狀編號')
     A            ALBANK        16O         COLHDG('開狀銀行')
     A            ALEFDT         8S 0       COLHDG('開狀日期')
     A            ALDUDT         8S 0       COLHDG('到期日期')
     A            ALCRLM        11S 0       COLHDG('信用狀金額')
     A            ALXAMT        11S 0       COLHDG('餘額')
     A            ALCLOS         1A         COLHDG('結案碼')
     A            ALADDM        10A         COLHDG('異動人員')
     A            ALADDD         8S 0       COLHDG('異動日期')
     A            ALADDT         6S 0       COLHDG('異動時間')
     A*
     A          K ALLCNO
