     A*================================================================
     A* 管制類別: 01訂單開立02交單開立03出單開立
     A*             04發票開立05請款作業06傳票代開
     A*             20材證    21無輻射
     A*================================================================
     A*
     A* 管制類別為發票類者：
     A*
     A* 開立方式：    00每日隨車開立（一車一張）
     A*                 01每日一訂單一張（與一車一張一起處理）
     A*                 02每月一訂單一張
     A*                 03依日期區間彙總一張
     A*                 04挑選銷貨明細開立
     A*                 05人工開立發票
     A*
     A*                 **不在本管制記錄內者為隨車開立（一車一張）
     A*                 -----------------------------------
     A*
     A* 管制類別為材證、無輻射者：
     A*
     A* 開立方式：    00每日隨車開立（一車一張）
     A*                 01每日一訂單一張（與一車一張一起處理）
     A*                 03依日期區間彙總一張
     A*                 -----------------------------------
     A*
     A* 附屬類別一：  00不考慮加工費（手開調整單處理）
     A*                 01加工費合開在出貨發票內
     A*                 02加工費另開一張發票
     A*
     A*                 **不在本管制記錄內者視同不考慮
     A*                 -----------------------------------
     A*
     A* 附屬比率金額一：每公斤銷貨之加工費單價
     A*
     A*                 -----------------------------------
     A*
     A* 附屬類別二：  00不考慮廠租費（手開調整單處理）
     A*                 01廠租費合開在出貨發票內
     A*                 02廠租費另開一張發票
     A*
     A*                 **不在本管制記錄內者視同不考慮
     A*                 -----------------------------------
     A*
     A* 附屬比率金額二：每公斤銷貨之場租費單價
     A*
     A*================================================================
     A                                      UNIQUE
     A          R RARODCT                   TEXT('訂單管制檔')
     A            A2FLAG         1A         COLHDG('處理旗標')
     A            A2ORNO         9A         COLHDG('訂單編號')
     A            A2CTKD         2A         COLHDG('管制類別')
     A            A2MTHD         2A         COLHDG('開立方式')
     A            A2TYP1         2P 0       COLHDG('附屬類別一')
     A            A2RAT1        11P 3       COLHDG('附屬比率金額一')
     A            A2TYP2         2P 0       COLHDG('附屬類別二')
     A            A2RAT2        11P 3       COLHDG('附屬比率金額二')
     A            A2TYP3         2P 0       COLHDG('附屬類別三')
     A            A2RAT3        11P 3       COLHDG('附屬比率金額三')
     A*
     A          K A2ORNO
     A          K A2CTKD
