     A                                      UNIQUE
     A          R RARORCN                   TEXT('訂單國別對照檔')
     A            ANORNO         6A         COLHDG('訂單編號')
     A            ANCOUN         2A         COLHDG('國別')
     A*
     A          K ANORNO
