     A                                      UNIQUE
     A          R RARORDE                   TEXT('承購訂單彙總檔')
     A            ARCUNO         6A         COLHDG('客戶代號')
     A            ARORNO         6A         COLHDG('訂單號碼')
     A            ARAAMT        12S 0       COLHDG('承購金額')
     A            ARBAMT        12S 0       COLHDG('預支金額')
     A            ARCAMT        12S 0       COLHDG('沖銷金額')
     A            ARDAT1         8S 0       COLHDG('承購起日')
     A            ARDAT2         8S 0       COLHDG('結案日期')
     A            ARCLOC         1A         COLHDG('結案碼')
     A*
     A          K ARCUNO
     A          K ARORNO
