     A*%%TS  SD  19900719  105409  S02HYS      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP076S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02HYS
     A*            4.FUNCTION     銷貨帳款兌現天數處理程式
     A*            5.DATE-WRITTEN  90/07/19
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '結束作業')
     A                                      CA12(12 '取消')
     A*================================================================
     A          R ARP0761
     A*%%TS  SD  19900719  105409  S02HYS      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 26'も　東和鋼鐵股份有限公司　も'
     A                                  1 70'ARP076S '
     A                                  2  2TIME
     A                                  2 29'★銷貨帳款處理程式★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  8 22'1.第一年度:'
     A            S#DAT1         6Y 0B  8 36EDTCDE(Y)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  8 45'～'
     A            S#DAT2         6Y 0B  8 50EDTCDE(Y)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                  8 59'(年月日)'
     A                                 10 22'2.第二年度:'
     A            S#DAT3         6Y 0B 10 36EDTCDE(Y)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 10 45'～'
     A            S#DAT4         6Y 0B 10 50EDTCDE(Y)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 10 59'(年月日)'
     A                                 23  2'F3=結束作業 F12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
