     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP052RS
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     應收系統檔案備份移出作業畫面
     A*            5.DATE-WRITTEN  86/12/20
     A*
     A***************************************************************
     A*  畫面一:輸入統計年月及是否重新統計
     A*
     A*        記錄格式 AR052F1
     A***************************************************************
     A*--------------------------------------------------------------
     A          R AR052F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                  1 70'ARP052RS'
     A            S#COMP        35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 25'應收系統主要檔案備份移出作業'
     A            S#DEVI        10A  O  2 70
     A*--------------------------------------------------------------
     A                                  9 16'-----------------------------------
     A                                      ------------------'
     A                                 10 16'備份移出止日（不含所輸日期）:'
     A            S#YMD          8Y 0B    +1
     A                                      EDTCDE(4)
     A                                 11 16'-----------------------------------
     A                                      ------------------'
     A*--------------------------------------------------------------
     A                                 23 12'F3:結束'
     A                                 23 29'F12:回前畫面'
     A                                 23 51'ENTER:執行'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
