     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP057RS
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     重開上月最後一日發票（外銷）
     A*            5.DATE-WRITTEN  86/03/14
     A*            6.UPDATE  DATE  99/08/30  2010AR517  S00WCJ (9908A)
     A*
     A*****************************************************************
     A          R AR057F1
     A                                      OVERLAY
     A                                      CF03(03)
     A*----------------------------------------------------------------
     A                                  1 70'ARP057S'
     A            S#COMP        35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'も外銷統一發票開立作業'
     A            S#DEVI        10A  O  2 70
     A                                  7 20'開立廠別：'
     A            S#AREA         1A  B  7 33
     A                                  7 35'(P:台北L:林口T:桃園M:台中K-
     A                                      :高雄)'
     A                                  9 20'截止日期：'
9908AA*           S#DATE         6Y 0O  9 33
9908AA            S#DATE         8Y 0O  9 33
     A                                      EDTCDE(4)
     A*----------------------------------------------------------------
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A                                  3 30'（重開上月最後一日）'
     A                                 15  7'注意：請確定財會人員尚未進行上月+
     A                                      份之結帳作業後，方可進行本作業。'
     A                                      DSPATR(HI)
