     A*%%***********************************************************************
     A*%%TS  RD  19890828  141755  S02YSH      REL-V3R7M0  5716-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARP072T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     發票與銷貨差異代開傳票
     A*           4.DATE-WRITTEN  89/05/19
     A*           5.WRITER        S02YSH
     A*
     A*****************************************************************
     A          R AR072TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      ' PRT-ID  : ARP072T'
     A                                    50
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   110
     A                                      '列表日期:'
     A                                   121
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR-ID  :'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
     A                                   +28
     A                                      '發票與銷貨差異入帳清單'
     A                                   110
     A                                      '列表時間:'
     A                                   121
     A                                      TIME
     A                                     2
     A                                      '入帳日期'
     A                                      SPACEB(001)
     A            R#DATE         8S  O    +1
     A                                      EDTWRD('    /  /  ')
     A                                    54
     A                                      '代開年月:'
     A            U#YYMM         4S 0O    66
     A                                      EDTWRD('  /  ')
     A                                   110
     A                                      '頁　　次:'
     A                                   121
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '發票號碼'
     A                                      SPACEB(002)
     A                                    13
     A                                      '訂單'
     A                                    21
     A                                      '客戶名稱'
     A                                    33
     A                                      '借貸'
     A                                    41
     A                                      '會計科目'
     A                                    67
     A                                      '品　名'
     A                                    88
     A                                      '借方金額'
     A                                   100
     A                                      '貸方金額'
     A                                   112
     A                                      '部門'
     A                                   120
     A                                      '傳票編號'
     A            T#LINE       132         1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR072T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#IVNO        10         2
     A                                      SPACEB(001)
     A            T#ORNO         5        13
     A            T#CUNM        10        +3
     A            T#DC           1        +4
     A            T#NO           4        +6
     A            T#NONM        16        +1
     A            T#TYCO         1        +1
     A            T#DSC2         3        +3
     A            T#DSCN         8        +1
     A            T#CORT         2        +3
     A            T#DAMT         6  0     +6
     A                                      EDTCDE(4)
     A            T#CAMT         6  0     +6
     A                                      EDTCDE(4)
     A            T#DPNO         4       113
     A            T#VRNO         6       121
     A                                    +0
     A                                      '-'
     A            T#ITEM         2        +0
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR072T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SPACEB(002)
     A                                    40
     A                                      '入帳筆數:'
     A            T#RCNT         3S  O    55
     A                                      EDTCDE(J)
     A                                    70
     A                                      '借方合計:'
     A            T#CNTD         7  0     83
     A                                      EDTCDE(J)
     A                                   100
     A                                      '貸方合計:'
     A            T#CNTC         7  0    113
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR072TX
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 046
     A*%%***********************************************************************
     A                                      SKIPB(059)
     A                                     2
     A                                      '<財會>'
     A                                    +0
     A                                      '主管:'
     A                                    +0
     A                                      '            '
     A                                      UNDERLINE
     A                                    +0
     A                                      '複核:'
     A                                    +0
     A                                      '            '
     A                                      UNDERLINE
     A                                    +0
     A                                      '入帳:'
     A                                    +0
     A                                      '            '
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR072TM
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SPACEB(003)
     A                                      SPACEA(002)
     A*----------------------------------------------------------------
     A                                    19
     A                                      '*****無條件符合之資料！！'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARP072T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       222      *N     )
     A*%%***********************************************************************
