     A*%%***********************************************************************
     A*%%TS  RD  19910325  090647  S02LYW      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP083T
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     承購發票下載清單
     A*            5.DATE-WRITTEN  90/02/08
     A*
     A***************************************************************
     A          R AR083TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報表代號: ARR083T'
     A                                    28
     A                                      '東和鋼鐵企業股份有限公司'
     A                                    60
     A                                      '列表日期:'
     A                                    71
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '列表人員:'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
     A                                    +3
     A                                      '應收帳款承購發票下載明細表'
     A                                    60
     A                                      '列表時間:'
     A                                    71
     A                                      TIME
     A                                    60
     A                                      '頁　　次:'
     A                                      SPACEB(001)
     A                                    71
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '客戶代號:'
     A                                      SPACEB(002)
     A            AMCUNO         6A  O    +1
     A            AMCUNM        10O  O    +1
     A                                     2
     A                                      '下載批號:'
     A                                      SPACEB(001)
     A            AMBLCB        30A  O    +1
     A*
     A            T#LIN1        80   O     1
     A                                      SPACEB(001)
     A                                     2
     A                                      '項次'
     A                                      SPACEB(002)
     A                                    +1
     A                                      '發票號碼'
     A                                    +2
     A                                      '發票日期'
     A                                    +1
     A                                      '到期日期'
     A                                    +5
     A                                      '發票金額'
     A                                    +2
     A                                      '請款單'
     A                                    +1
     A                                      '訂單'
     A                                    +1
     A                                      '業務'
     A            T#LIN2        80   O     1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A***************************************************************
     A          R AR083T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#ITEM         3  0O     4
     A                                      EDTCDE(3)
     A                                      SPACEB(001)
     A            AMINNO        10   O     9
     A            T#INDT         8  0O    21
     A                                      EDTWRD('    /  /  ')
     A            T#DUDT         8  0O    32
     A                                      EDTWRD('    /  /  ')
     A            AMDAMT        12  0O    44
     A                                      EDTCDE(1)
     A            AMAPN1         6A  O    60
     A            T#ORNO         6A  O    68
     A            T#RVID         2A  O    77
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR083T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    31
     A                                      '請款單小計：'
     A                                      SPACEB(001)
     A            T#AMT1        12S 0O    50
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR083T3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A                                    37
     A                                      '合計：'
     A                                      SPACEB(001)
     A            T#AMTT        12S 0O    50
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARP083T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       158      *N     )
     A*%%***********************************************************************
