     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A          R WDREC                     TEXT('鋼筋地磅重與銷貨重差異')
     A            WDCUNO         6          COLHDG('客戶編碼')
     A            WDORNO         6          COLHDG('訂單號碼')
     A            WDWTNO         8          COLHDG('磅單號碼')
     A            WDVNO1         2          COLHDG('進出別')
0409AA            WDGROP         2          COLHDG('產品大類')
     A            WDTRCD         2          COLHDG('異動代號')
     A            WDPDWT        12P 0       COLHDG('地磅重')
     A            WDSA04        12P 0       COLHDG('應收出貨重')
     A            WDPADF        12P 0       COLHDG('差異重')
     A*
     A          K WDCUNO
     A          K WDORNO
     A          K WDWTNO
