     A*%%TS  SD  19910429  155154  S02YSH      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARP004S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     統一發票開立作業（外銷）-新版
     A*            5.DATE-WRITTEN  91/04/25
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '離開')
     A                                      CA12(12 '回上頁')
     A*================================================================
     A          R AR004H
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A            S#SRID        10A  O  1 70
     A                                  2  2TIME
     A                                  2 30'★新版外銷發票開立★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A*================================================================
     A          R AR004F1
     A*%%TS  SD  19910429  153458  S02YSH      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                 10 30'開立廠區：'
     A            S#AREA         1A  B 10 43
     A  40                                  DSPATR(PC)
     A  40                                  DSPATR(RI)
     A                                 10 45'(T:桃園H:苗栗M:台中'
     A                                 11 46'K:高雄P:台北)'
     A                                 12 30'訂單號碼：'
     A            S#ORNO         6A  B 12 43
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                 14 30'截止日期：'
     A            S#DATE         6Y 0B    +1EDTCDE(Y)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 23  2'F3/F12=離開'
     A            S#ERR1        70A  O 24  2DSPATR(HI)
     A*================================================================
     A          R AR004F2                   SFL
     A*%%TS  SD  19910429  104531  S02YSH      REL-V4R4M0  5769-PW1
     A            S#OSEQ         3Y 0O 11  4EDTCDE(4)
     A            S#ICNM        30A  O 11 13
     A            S#CINO        10A  O 11 49
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A*================================================================
     A          R AR004F2C                  SFLCTL(AR004F2)
     A*%%TS  SD  19910429  155154  S02YSH      REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A N71                                  SFLDSPCTL
     A N72                                  SFLDSP
     A N73                                  SFLEND
     A  74                                  SFLCLR
     A                                      CF10(10 '確認開立')
     A                                      OVERLAY
     A                                  4  2'訂單編號:'
     A            S#ORNO         6A  O  4 15
     A                                  4 25'開立截止日:'
     A            S#DATE         6Y 0O  4 39EDTCDE(Y)
     A                                  5  2'訂單客戶代號:'
     A            S#CUNO         6A  O  5 18
     A                                  5 25'訂單客戶名稱:'
     A            S#CUNM        10A  O  5 41
     A                                  6  2'參考匯率:'
     A            S#RRAT         7Y 4O  6 14EDTCDE(4)
     A                                  6 23'報關匯率:'
     A            S#TRAT         7Y 4O  6 35EDTCDE(4)
     A                                  6 44'報關日期:'
     A            S#CDTE         6Y 0O  6 56EDTCDE(Y)
     A                                  7  2'開立金額:'
     A                                    +1'Ｈ廠:'
     A            S#AMTH        10Y 0O    +1EDTCDE(4)
     A                                    +1'Ｋ廠:'
     A            S#AMTK        10Y 0O    +1EDTCDE(4)
     A            S#LIN1        78A  O  8  2
     A                                  9  2'流水號'
     A                                  9 14'CI客戶名稱'
     A                                  9 49'CI號碼'
     A            S#LIN2        78A  O 10  2
     A            S#NBR2         4S 0H      SFLRCDNBR(CURSOR)
     A*================================================================
     A          R AR004F2M
     A                                      OVERLAY
     A            S#LIN3        78A    22  2
     A                                 23  2'F3=離開'
     A                                    +1'F12=回上頁'
     A                                    +1'F10=確認開立'
     A                                      DSPATR(RI)
     A            S#ERR2        70A  O 24  2DSPATR(HI)
