     A          R RARP079                   TEXT('現金流出入預估')
     A            WFDATE         8S 0       COLHDG('預估兌現日期')
     A            WFNO          10A         COLHDG('單據編號')
     A            WFORNO         6A         COLHDG('訂單號碼')
     A            WFNOTP         2A         COLHDG('單據類別')
     A*                                            TN:銷貨明細
     A*                                            IN:發票
     A            WFNODT         8S 0       COLHDG('單據日期')
     A            WFAMT         12P 0       COLHDG('兌現金額')
     A            WFCUNO         6A         COLHDG('客戶代號')
     A            WFCUNM        10O         COLHDG('客戶簡稱')
     A            WFENTD         8S 0       COLHDG('處理日期')
     A            WFCODE         1A         COLHDG('狀態別')
     A*                                           1:未請款
     A*                                           2:已請款
     A*                                           3:轉催收
     A            WFDATS         4S 0       COLHDG('天數')
     A*
     A          K WFDATE
     A          K WFNO
