     A                                      UNIQUE
     A          R AR096F1                   TEXT('磅單,發票與類別對照檔')
     A*
     A            A1TXNO         8A         COLHDG('磅單號碼')
     A            A1CUNO         6A         COLHDG('客戶號碼')
     A            A1ORNO         9A         COLHDG('訂單號碼')
     A            A1PDNM         3A         COLHDG('磅單類別')
     A            A1IVNO        10A         COLHDG('發票號碼')
     A            A1IVDT         8S 0       COLHDG('發票開立日')
     A            A1UPRC         7S 5       COLHDG('類別單價')
     A            A1IVQT         9S 0       COLHDG('類別數量')
     A            A1LAQT         9S 0       COLHDG('未分攤數量')
     A            A1CODE         1A         COLHDG('數量相符')
     A*
     A          K A1TXNO
     A          K A1PDNM
     A          K A1ORNO
     A          K A1IVNO
