     A          R WXREC                     TEXT('鋼筋地磅重與銷貨重差異')
     A            WXCUNO         6          COLHDG('客戶號碼')
     A*
     A          K WXCUNO
