     A                                      UNIQUE
     A          R ARP096X                   TEXT('反傾銷SECTION B')
     A*
     A            OBSH           6S         COLHDG('OBSH')
     A            PRODH          3A         COLHDG('PRODCODH')
     A            COMH           7A         COLHDG('CONNUMH')
     A            PRIMEH         1A         COLHDG('PRIMEH')
     A            FORMH          1A         COLHDG('FORMH')
     A            SHAPEH         3A         COLHDG('SHAPEH')
     A            STRGH          2A         COLHDG('STRENGTHH')
     A            COATH          1A         COLHDG('COATH')
     A            SPECH2        16A         COLHDG('SPECH')
     A            SIZEH          7A         COLHDG('SIZEH')
     A            WEIGTH         4S 1       COLHDG('WEIGHTH')
     A            CUIDH          6A         COLHDG('CUSCODH')
     A            CURLH          1A         COLHDG('CUSRELH')
     A            CUCTH          1A         COLHDG('CUSCATH')
     A*
     A            CHNLH          1A         COLHDG('CHANNELH')
     A            SLIVDH         8S 0       COLHDG('SALINDTH')
     A            SALDTH         8S 0       COLHDG('SALEDATH')
     A            INVOCH        10A         COLHDG('INVOICH')
     A            SHPDTH         8S 0       COLHDG('SHIPDTH')
     A            PAYDTH         8S 0       COLHDG('PAYDTH')
     A            SALTMH         1A         COLHDG('SALETERH')
     A            PAYTMH         1A         COLHDG('PAYTRMH')
     A*
     A            QTYH           9S 0       COLHDG('QTYH')
     A            QTUMH          1A         COLHDG('QTYUNITH')
     A            GSUPH          7S 5       COLHDG('GRSUPRH')
     A            BILADH         5S 4       COLHDG('BILLADJH')
     A            REBAT1         5S 4       COLHDG('REBATE1H')
     A            REBAT2         5S 4       COLHDG('REBATE2H')
     A            REBAT3         5S 4       COLHDG('REBATE3H')
     A            REBAT4         5S 4       COLHDG('REBATE4H')
     A            LOTH           1S 0       COLHDG('LOTH')
     A            LOTDJH         1S 0       COLHDG('LOTADJH')
     A            INFTH          5S 4       COLHDG('INLFTCH')
     A            DESTH          5A         COLHDG('DESTH')
     A            CREDTH         5S 4       COLHDG('CREDITH')
     A            INTRVH         5S 4       COLHDG('INTREVH')
     A            WARRH          7S 6       COLHDG('WARRH')
     A            TECHH          5S 4       COLHDG('TECHSERH')
     A            DRSCH          5S 4       COLHDG('DIRSELH')
     A            INDIRH         5S 4       COLHDG('INDIRSH')
     A            INVCRH         5S 4       COLHDG('INVCARH')
     A            PACKH          5S 4       COLHDG('PACKH')
     A            VCOMH          6S 4       COLHDG('VCOMH')
     A            MFRH           1A         COLHDG('MFRH')
     A            EXPRTH         1A         COLHDG('EXPORTH')
     A            AVDAYH         4S 0       COLHDG('AVDAYS')
     A            TCOM          10S 8       COLHDG('TCOM')
     A            WTNO           8A         COLHDG('磅單號碼')
     A            ORNO           6A         COLHDG('訂單號碼')
     A            ORIT           3S 0       COLHDG('訂單項次')
     A            VUNO           7A         COLHDG('傳票號碼')
     A            RCNO           6A         COLHDG('繳款單號')
     A            MAR1           1A         COLHDG('退貨碼')
     A            ARNO           8A         COLHDG('退貨單號')
     A            RQTY          13S 0       COLHDG('退貨量')
     A            MAR3           1A         COLHDG('異常碼')
     A            MAR4           1A         COLHDG('暫收碼')
     A            ODNO           9A         COLHDG('出單號碼')
     A            QCCD           1A         COLHDG('品質等級')
     A            LETH           4A         COLHDG('長度')
     A*
     A          K OBSH
