     A*%%TS  SD  19910204  152505  S02YSH      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP083S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     承購發票下載作業
     A*            5.DATE-WRITTEN  91/02/04
     A*
     A***************************************************************
     A          R AR083F1
     A*%%TS  SD  19910204  152505  S02YSH      REL-V4R4M0  5769-PW1
     A                                      CF03(03)
     A                                      CF12(12)
     A                                  1 70'ARP083S-01'
     A                                  1 27'東和鋼鐵企業股份有限公司'
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 29'承購發票下載試算作業'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A            S#USER        10A  O  3 70
     A                                  8 27'承購銀行:'
     A            S#BKID         3A  B  8 39
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                 10 27'客戶代號:'
     A            S#CUID         6A  B 10 39
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 10 46'(空白表全部)'
     A                                 12 27'承購金額:'
     A            S#AMT1        12Y 0B 12 39EDTCDE(1)
     A                                 12 55'( 0表不限金額)'
     A                                 14 25'可承購金額:'
     A  50                                  DSPATR(ND)
     A  51                                  DSPATR(RI)
     A            S#AMT2        12Y 0O 14 39EDTCDE(J)
     A  50                                  DSPATR(ND)
     A  51                                  DSPATR(RI)
     A                                 23  3'F3/F12:結束'
     A                                      DSPATR(RI)
     A            S#ERR         70A  O 24  2DSPATR(HI)
