     A*%%TS  SD  19811012  145900  JEFF        REL-V2R1M1  5738-PW1
     A*%%EC
     A*****************************************************************
     A*
     A*            UPDATE  DATE  98/12/31 2009AR406 S00WCJ (9812A)
     A*                         112/03/03 2023AR00006 S00WCJ (1203A)
     A*                          新增大業廠
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19811012  145900  JEFF        REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARP027S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 30'も預收貨款傳輸作業も'
     A            DEVNM         10A  O  2 70
     A                                  7 20'訂單號碼：'
     A            ORNO           6   B  7 33
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A  70                                  DSPATR(PR)
     A                                  9 21'FROM'
     A            AREA1          1   O  9 26
     A                                  9 28'廠'
     A                                  9 33'TO'
1203AA            AREA2          1   B  9 37VALUES('P' 'N' 'T' 'M' 'K' 'H' 'U')
     A                                  9 39'廠'
1203AA                                 11 23'(P:台北M:台中K-
     A                                      :高雄H:苗栗U:新桃N:大業)'
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
