     A          R WDREC                     TEXT('型鋼地磅重與銷貨重差異')
     A            WDCUNO         6A         COLHDG('客戶編號')
     A            WDCUNM        10A         COLHDG('客戶簡稱')
     A            WDORNO         6A         COLHDG('訂單號碼')
     A            WDPDWT        12P 0       COLHDG('地磅重')
     A            WDSA04        12P 0       COLHDG('出貨重')
     A            WDAR05        12P 0       COLHDG('調整重')
     A            WDAR06        12P 0       COLHDG('折退重')
     A            WDARSM        12P 0       COLHDG('營業重合計')
     A            WDPADF        12P 0       COLHDG('差異重')
     A*
     A          K WDCUNO
     A          K WDORNO
