     A                                      UNIQUE
     A          R AR096F4                   TEXT('反傾銷WORKFILE')
     A*
     A            A4CNNO         7A         COLHDG(' CONTROL NO.')
     A            A4WTNO         8A         COLHDG('磅單號碼')
     A            A4WTIT         2S 0       COLHDG('磅單項次')
     A            A4ENTD         8S 0       COLHDG('填單日期')
     A            A4TRCD         2A         COLHDG('異動代號')
     A            A4NAME         3A         COLHDG('類別')
     A            A4STND         1A         COLHDG('規範')
     A            A4QULT         8A         COLHDG('鋼種')
     A            A4SPE1         5A         COLHDG(' H/T/D ')
     A            A4SPE2         5A         COLHDG(' B/W ')
     A            A4LENG         4A         COLHDG('長度')
     A            A4QCCD         1A         COLHDG('品級')
     A            A4UNIT         1A         COLHDG('長度單位')
     A            A4UPRC         7S 5       COLHDG('單價')
     A            A4CUNO         6A         COLHDG('客戶代號')
     A            A4ORNO         6A         COLHDG('訂單號碼')
     A            A4ORIT         3S 0       COLHDG('訂單項次')
     A            A4TRWT         9S 0       COLHDG('銷貨重量')
     A            A4IVNO        10A         COLHDG('發票號碼')
     A            A4IVDT         8S 0       COLHDG('發票日期')
     A            A4IVWT         9S 0       COLHDG('發票重量')
     A            A4IVTP         1A         COLHDG('發票種類')
     A*                                     1:隨車
     A*                                     2:區間
     A            A4COD1         1A         COLHDG('異常碼')
     A            A4DAYS         3S 0       COLHDG('開立帳齡')
     A            A4VUNO         7A         COLHDG('傳票號碼')
     A            A4ODNO         9A         COLHDG('出單號碼')
     A            A4CARY         7S 5       COLHDG('單位運費')
     A            A4DAT1         7S 3       COLHDG('在庫天數')
     A            A4DAT2         7S 3       COLHDG('兌現天數')
     A            A4DPRC         7S 5       COLHDG('折讓單價')
     A*
     A          K A4WTNO
     A          K A4WTIT
     A          K A4IVNO
