     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R RARP090X                  TEXT('兌現預估明細檔')
     A            A1CODE         4A         COLHDG('單據代號')
     A            A1NO          10A         COLHDG('單據號碼')
     A            A1CUNO         6A         COLHDG('客戶代號')
     A            A1SALE         2A         COLHDG('業務代號')
     A            A1AMT         12S 0       COLHDG('單據金額')
     A            A1INDT         8S 0       COLHDG('單據日期')
     A            A1DAT1         8S 0       COLHDG('預計兌現日')
     A            A1DAT2         8S 0       COLHDG('調整兌現日')
     A            A1CODX         1A         COLHDG('調整碼')
0409AA            A1PROD         2A         COLHDG('產品大類')
     A****
     A          K A1NO
