     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP059S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     營業繳款過入財會還原
     A*            5.DATE-WRITTEN  87/05/29
     A*
     A***************************************************************
     A*  畫面一:業務員、過帳日期
     A*
     A*        記錄格式 AR059F1
     A***************************************************************
     A          R AR059F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A  50                                  LOCK
     A*--------------------------------------------------------------
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR059S '
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 26'★營業繳款過入財會還原作業★'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A*--------------------------------------------------------------
     A                                  8 18'繳款單號:'
     A            S#RVNO         6A  B    +1
     A  51                                  DSPATR(PC RI)
     A                                 10  6'通關密碼（解除托收）:'
     A            S#PASS        10A  I    +1DSPATR(ND CS)
     A  53                                  DSPATR(PC RI)
     A                                 12 12'輸入還原之原因:'
     A            S#CGCA        40O  B    +1
     A  52                                  DSPATR(PC RI)
     A*--------------------------------------------------------------
     A                                 23  3'F3:結束'
     A                                 23 17'F12:回前畫面'
     A                                 23 37'ENTER:執行'
     A*
     A            S#MSG1        70A  O 24  2DSPATR(HI)
