     A                                      UNIQUE
     A          R AR096F1                   TEXT('發票繳款紀錄')
     A            A1IVNO        10A         COLHDG('發票號碼')
     A            A1IVDT         8S 0       COLHDG('開立日期')
     A            A1IVIT         2S 0       COLHDG('項次')
     A            A1RCNO         6A         COLHDG('繳款編號')
     A            A1RCDT         8S 0       COLHDG('繳款日期')
     A            A1DATE         8S 0       COLHDG('加權兌現日')
     A            A1DAY2         4S 0       COLHDG('兌現帳齡')
     A            A1AMT         11P 0       COLHDG('發票金額')
     A****
     A          K A1IVNO
     A          K A1IVIT
