     A                                      UNIQUE
     A          R AR096F5                   TEXT('反傾銷WORKFILE')
     A*
     A            A5CNNO         7A         COLHDG(' CONTROL NO.')
     A            A5WTNO         8A         COLHDG('磅單號碼')
     A            A5WTIT         2S 0       COLHDG('磅單項次')
     A            A5ENTD         8S 0       COLHDG('填單日期')
     A            A5TRCD         2A         COLHDG('異動代號')
     A            A5NAME         3A         COLHDG('類別')
     A            A5STND         3A         COLHDG('規範')
     A            A5QULT         8A         COLHDG('鋼種')
     A            A5SPE1         5A         COLHDG(' H/T/D ')
     A            A5SPE2         5A         COLHDG(' B/W ')
     A            A5LENG         4A         COLHDG('長度')
     A            A5QCCD         1A         COLHDG('品級')
     A            A5UNIT         1A         COLHDG('長度單位')
     A            A5STDW         6S 0       COLHDG('理論重')
     A            A5UPRC         7S 5       COLHDG('單價')
     A            A5CUNO         6A         COLHDG('客戶代號')
     A            A5ORNO         6A         COLHDG('訂單號碼')
     A            A5ORIT         3S 0       COLHDG('訂單項次')
     A            A5TRWT         9S 0       COLHDG('銷貨重量')
     A            A5IVNO        10A         COLHDG('發票號碼')
     A            A5CINO        10A         COLHDG(' CI號碼')
     A            A5IVDT         8S 0       COLHDG('發票日期')
     A            A5IVWT         9S 0       COLHDG('發票重量')
     A            A5IVTP         1A         COLHDG('發票種類')
     A*                                     1:隨車
     A*                                     2:區間
     A            A5COD1         1A         COLHDG('異常碼')
     A            A5DAYS         3S 0       COLHDG('開立帳齡')
     A            A5VUNO         7A         COLHDG('傳票號碼')
     A            A5ODNO         9A         COLHDG('出單號碼')
     A            A5COD2         2A         COLHDG('國別')
     A            A5RAT1         7S 5       COLHDG('參考匯率')
     A            A5RAT2         7S 5       COLHDG('報關匯率')
     A            A5RAT3         7S 5       COLHDG('財會匯率')
     A            A5CARY         7S 5       COLHDG('單位運費')
     A            A5DAT1         7S 3       COLHDG('在庫天數')
     A            A5DAT2         7S 3       COLHDG('兌現天數')
     A            A5DPRC         7S 5       COLHDG('折讓單價')
     A*
     A          K A5WTNO
     A          K A5WTIT
     A          K A5IVNO
