     A*%%TS  SD  19920129  085812  S02YSH      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03(03)
     A                                      CF12(12)
     A          R AR096F1
     A*%%TS  SD  19920129  085812  S02YSH      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                  1 70'ARP096S-1'
     A                                  1 27'東和鋼鐵企業股份有限公司'
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 30'反傾銷預警處理作業'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3 70
     A                                  8 25'處理年月:'
     A            S#STYM         4Y 0B  8 38EDTCDE(Y)
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                  8 44'～'
     A            S#EDYM         4Y 0B  8 49EDTCDE(Y)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                  9 25'變動成本(VCOM):'
     A                                 10 37'內銷:'
     A            S#BVOM         7Y 5B 10 45
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 10 54'外銷:'
     A            S#CVOM         7Y 5B 10 62
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 11 25'總成本(TCOM):'
     A                                 12 37'內銷:'
     A            S#BTOM         7Y 5B 12 45
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 12 54'外銷:'
     A            S#CTOM         7Y 5B 12 62
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                 13 25'借款利率:'
     A                                 14 37'內銷:'
     A            S#BRAT         7Y 5B 14 45
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                 14 54'外銷:'
     A            S#CRAT         7Y 5B 14 62
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A                                 15 25'包裝成本:'
     A                                 16 37'內銷:'
     A            S#BPCK         7Y 5B 16 45
     A  38                                  DSPATR(PC)
     A  38                                  DSPATR(RI)
     A                                 16 54'外銷:'
     A            S#CPCK         7Y 5B 16 62
     A  39                                  DSPATR(PC)
     A  39                                  DSPATR(RI)
     A                                 18 26'以上單位皆為(幣別/公斤)'
     A                                      DSPATR(HI)
     A            S#ERR         70A  O 24  2DSPATR(RI)
