     A*%%TS  SD  19890506  104256  S02HYS      REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A****************************************************************
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP073S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02HYS
     A*            4.FUNCTION     外銷訂單單價處理
     A*            5.DATE-WRITTEN  89/05/05
     A*            6.DATE-MODIFY   89/05/05
     A*
     A*****************************************************************
     A          R ARP073H
     A*%%TS  SD  19890506  104256  S02HYS      REL-V3R7M0  5716-PW1
     A                                      CA03(03 '離開')
     A                                      CA12(12 '回上頁')
     A                                  1  2DATE
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARP073S'
     A                                  2  2TIME
     A                                  2 30'★外銷訂單單價處理★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  8 28'請輸入訂單號碼:'
     A            S#ORNO         6A  B  8 46
     A  30                                  DSPATR(RI)
     A                                  9 28'請輸入美金匯率:'
     A            S#ORN1         5Y 3B  9 46EDTCDE(4)
     A                                 11 28'此程式會將外銷訂單之單價依所輸入'
                                       12 28'美金匯率與所對應之銷貨明細作自動'
                                       13 28'轉換若訂單之單價已為台幣則美金匯'
                                       14 28'率值為1'
     A                                 22  2'F3:離開'
     A                                 22 14'F12:回上頁'
     A            S#ERR         40A  O 23  2
