     A                                      UNIQUE
     A          R AR096F3                   TEXT('反傾銷WORKFILE')
     A*
     A            A3WTNO         8A         COLHDG('磅單號碼')
     A            A3WTIT         2S 0       COLHDG('磅單項次')
     A            A3ENTD         8S 0       COLHDG('填單日期')
     A            A3TRCD         2A         COLHDG('異動代號')
     A            A3NAME         3A         COLHDG('類別')
     A            A3QULT         8A         COLHDG('鋼種')
     A            A3SPE1         5A         COLHDG(' H/T/D ')
     A            A3SPE2         5A         COLHDG(' B/W ')
     A            A3LENG         4A         COLHDG('長度')
     A            A3QCCD         1A         COLHDG('品級')
     A            A3UNIT         1A         COLHDG('長度單位')
     A            A3STDW         6S 0       COLHDG('理論重')
     A            A3UPRC         7S 5       COLHDG('單價')
     A            A3CUNO         6A         COLHDG('客戶代號')
     A            A3ORNO         6A         COLHDG('訂單號碼')
     A            A3ORIT         3S 0       COLHDG('訂單項次')
     A            A3TRWT         9S 0       COLHDG('銷貨重量')
     A            A3IVNO        10A         COLHDG('發票號碼')
     A            A3IVDT         8S 0       COLHDG('發票日期')
     A            A3IVWT         9S 0       COLHDG('發票重量')
     A            A3IVTP         1A         COLHDG('發票種類')
     A*                                     1:隨車
     A*                                     2:區間
     A            A3COD1         1A         COLHDG('異常碼')
     A            A3DAYS         3S 0       COLHDG('開立帳齡')
     A            A3VUNO         7A         COLHDG('傳票號碼')
     A            A3ODNO         9A         COLHDG('出單號碼')
     A            A3COD2         1A         COLHDG('第三國碼')
     A*
     A          K A3WTNO
     A          K A3WTIT
     A          K A3IVNO
