     A                                      UNIQUE
     A          R AR096F3                   TEXT('發票折讓紀錄')
     A            A3IVNO        10A         COLHDG('發票號碼')
     A            A3PDNM         3A         COLHDG('類別')
     A            A3QTY          7S 0       COLHDG('銷貨數量')
     A            A3AAMT         9S 0       COLHDG('銷貨金額')
     A            A3BAMT         9S 0       COLHDG('折讓金額')
     A****
     A          K A3IVNO
     A          K A3PDNM
