     A                                      UNIQUE
     A          R RARP090F                  TEXT('兌現預估調整檔')
     A            AFCOD1         6A         COLHDG('調整代號')
     A            AFCOD2        10A         COLHDG('代號名稱')
     A            AFDAY1         4S 0       COLHDG('建議天數')
     A            AFDAY2         4S 0       COLHDG('調整天數')
     A****
     A          K AFCOD1
