     A                                      UNIQUE
     A          R ARP096Y                   TEXT('反傾銷-外銷正式檔案')
     A*
     A            OBSU           6S         COLHDG('OBSU')
     A            PRODU          3A         COLHDG('PRODCODU')
     A            COMU           7A         COLHDG('CONNUMU')
     A            PRIMEU         1A         COLHDG('PRIMEU')
     A            FORMU          1A         COLHDG('FORMU')
     A            SHAPEU         3A         COLHDG('SHAPEU')
     A            STRGU          2A         COLHDG('STRENGTHU')
     A            COATU          1A         COLHDG('COATU')
     A            SPECU         16A         COLHDG('SPECU')
     A            SIZEU          7A         COLHDG('SIZEU')
     A            WEIGTU         4S 1       COLHDG('WEIGHTU')
     A            SALEU          2A         COLHDG('SALEU')
     A*           CONSGU         2A         COLHDG('CONSIGNU')
     A            CUIDU          6A         COLHDG('CUSCODU')
     A            CUCTU          1A         COLHDG('CUSCATU')
     A*
     A            CHNLU          1A         COLHDG('CHANNELU')
     A            SLIVDU         8S 0       COLHDG('SALINDTU')
     A            SALDTU         8S 0       COLHDG('SALEDATU')
     A            INVOCU        10A         COLHDG('INVOICEU')
     A            SHPDTU         8S 0       COLHDG('SHIPDATU')
     A            PAYDTU         8S 0       COLHDG('PAYDATEU')
     A            SALTMU         1A         COLHDG('SALETERU')
     A            PAYTMU         1A         COLHDG('PAYTERMU')
     A*
     A            QTYU           9S 0       COLHDG('QTYU')
     A            QTUMU          1A         COLHDG('QTYUNITU')
     A            GSUPU          5S 4       COLHDG('GRSUPRU')
     A            CHGRAT         5S 3       COLHDG('EXCHANGE RATE')
     A            INVVAL        10S 0       COLHDG('INVOICE VALUE1')
     A            INVVA2        10S 4       COLHDG('INVOICE VALUE2')
     A            LOTU           1S 0       COLHDG('LOTU')
     A            INFTU          5S 4       COLHDG('DINLFTPU')
     A            DBRO1U         5S 4       COLHDG('DBROK1U')
     A            DBRO2U         7S 6       COLHDG('DBROK2U')
     A            CREDTU         5S 4       COLHDG('CREDITU')
     A*           WARRU          5S 4       COLHDG('WARRU')
     A*           TECHU          5S 4       COLHDG('TECHSERU')
     A            BANCH1         5S 4       COLHDG('BANKCHG1U')
     A            BANCH2         5S 4       COLHDG('BANKCHG2U')
     A            INDIRU         5S 4       COLHDG('DINDIRSU')
     A            INVCRU         5S 4       COLHDG('DINVCARU')
     A            PACKU          5S 4       COLHDG('PACKU')
     A            VCOMU          6S 4       COLHDG('VCOMU')
     A            TCOMU          6S 4       COLHDG('TCOMU')
     A            MFRU           1A         COLHDG('MFRU')
     A            AVDAYU         4S         COLHDG('AVDAYU')
     A            WTNO           8A         COLHDG('磅單號碼')
     A            ORNO           9A         COLHDG('訂單號碼')
     A            IVNO          10A         COLHDG('發票號碼')
     A            RCNO           6A         COLHDG('繳款單號')
     A            RCDT           8S 0       COLHDG('繳款日期')
     A            VUNO           7A         COLHDG('傳票號碼')
     A            ODNO           9A         COLHDG('出單號碼')
     A            QCCD           1A         COLHDG('品質等級')
     A*
     A          K OBSU
