     A*%%TS  SD  19901110  122649  S02YSH      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP084SA
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     承購發票預支試算作業--輸入
     A*            5.DATE-WRITTEN  90/11/10
     A*
     A***************************************************************
     A          R AR084F1
     A*%%TS  SD  19901110  122649  S02YSH      REL-V4R4M0  5769-PW1
     A                                      CF03(03)
     A                                      CF10(10)
     A                                      CF12(12)
     A                                  1 70'ARP084SA'
     A            S#COMP        35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 26'承購發票預支試算作業--輸入'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A            S#USER        10A  O  3 70
     A                                  9 27'預支日期:'
     A            S#DATE         6Y 0O  9 39
     A                                      EDTCDE(Y)
     A                                 11 27'預支銀行:'
     A            S#BKID         3A  B 11 39
     A  30                                  DSPATR(PC RI)
     A                                 13 27'預支金額:'
     A            S#PAMT        12Y 0B 13 39EDTCDE(4)
     A  31                                  DSPATR(PC RI)
     A                                 15 27'預支利率:'
     A            S#PRAT         4Y 3B 15 39EDTCDE(4)
     A  32                                  DSPATR(PC RI)
     A                                    +1'%'
     A                                 23  3'F3/F12:結束'
     A                                    +2' F10:開始試算'
     A                                      DSPATR(RI)
     A            S#ERR         70A  O 24  2DSPATR(HI)
