     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP051RS
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     日期客戶別磅單重量差異分析畫面
     A*            5.DATE-WRITTEN  86/04/20
     A*
     A***************************************************************
     A*  畫面一:
     A*
     A*        記錄格式 AR051F1
     A***************************************************************
     A          R AR051F1                   SFL
     A  70                                  SFLNXTCHG
     A            S#ITEM         2  0O 10 25
     A            S#CUNO         6A  B 10 32
     A  51                                  DSPATR(RI)
     A***************************************************************
     A          R AR051F1C                  SFLCTL(AR051F1)
     A                                      SFLSIZ(0099)
     A                                      SFLPAG(0012)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF10(10)
     A  71                                  SFLDSPCTL
     A  72                                  SFLDSP
     A  73                                  SFLINZ
     A  74                                  SFLEND
     A                                      SFLCSRRRN(&S#CRN1)
     A            S#NBR1         4S 0H      SFLRCDNBR(CURSOR)
     A            S#CRN1         5S 0H
     A*----------------------------------------------------------------
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARP051RS'
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 27'日期客戶別磅單重量差異分析'
     A            S#DEVI        10A  O  2 70
     A*----------------------------------------------------------------
     A                                  4 16'統計日期起日:'
     A            S#YMS          8Y 0B  4 32
     A                                      EDTCDE(4)
     A  40                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  6 16'統計日期止日:'
     A            S#YME          8Y 0B  6 32
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI PC)
     A                                  7  9'-----------------------------------
     A                                      ----------------------------'
     A                                  8 22'項次'
     A                                      DSPATR(HI)
     A                                  8 30'客戶編號'
     A                                      DSPATR(HI)
     A                                  9  9'-----------------------------------
     A                                      ----------------------------'
     A***************************************************************
     A          R AR051F1M
     A                                      OVERLAY
     A                                 22  6'-----------------------------------
     A                                      ----------------------------------'
     A                                 23  9'F3:取消程式'
     A                                 23 27'F12:取消程式'
     A                                 23 45'ENTER:檢核'
     A                                 23 61'F10:存檔'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
