     A          R WFREC                     TEXT('未結案客戶檔')
     A            WFCUNO         6A         COLHDG('客戶編號')
     A*
     A          K WFCUNO
