     A*%%***********************************************************************
     A*%%TS  RD  19920616  132453  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARP103T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     折扣代開傳票
     A*           4.DATE-WRITTEN  92/05/23
     A*           5.WRITER        S02YSH
     A*
     A*****************************************************************
     A          R AR103TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      ' PRT-ID  : ARP103T'
     A                                    50
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   108
     A                                      '列表日期:'
     A                                   119
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR-ID  :'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
     A                                   +31
     A                                      '銷貨折扣入帳清單'
     A                                   108
     A                                      '列表時間:'
     A                                   119
     A                                      TIME
     A                                     2
     A                                      '入帳日期'
     A                                      SPACEB(001)
     A            R#DATE         8S  O    +1
     A                                      EDTWRD('    /  /  ')
     A                                    54
     A                                      '代開年月:'
     A            U#YYMM         4S 0O    66
     A                                      EDTWRD('  /  ')
     A                                   108
     A                                      '頁　　次:'
     A                                   119
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '發票號碼'
     A                                      SPACEB(002)
     A                                    13
     A                                      '發票日期'
     A                                    24
     A                                      '訂單'
     A                                    31
     A                                      '客戶名稱'
     A                                    42
     A                                      '借貸'
     A                                    50
     A                                      '會計科目'
     A                                    74
     A                                      '品　名'
     A                                    88
     A                                      '借方金額'
     A                                   100
     A                                      '貸方金額'
     A                                   111
     A                                      '部門'
     A                                   118
     A                                      '傳票編號'
     A            T#LINE       130         1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR103T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#IVNO        10         2
     A                                      SPACEB(001)
     A N50        T#INDT         8  0     13
     A                                      EDTWRD('    /  /  ')
     A            T#ORNO         6        24
     A            T#CUNM        10        31
     A            T#DC           1        44
     A            T#NO           4        49
     A            T#NONM        16        54
     A            T#TYCO         1        71
     A            T#DSC2         3        73
     A            T#DSCN         8        76
     A            T#CORT         2        85
     A            T#DAMT         7  0     88
     A                                      EDTCDE(J)
     A            T#CAMT         7  0    100
     A                                      EDTCDE(J)
     A            T#DPNO         4       112
     A            T#VRNO         6       119
     A                                   125
     A                                      '-'
     A            T#ITEM         2       126
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR103T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SPACEB(002)
     A                                    40
     A                                      '入帳筆數:'
     A            T#RCNT         3S  O    52
     A                                      EDTCDE(J)
     A                                    68
     A                                      '借方合計:'
     A            T#CNTD         9  0     81
     A                                      EDTCDE(J)
     A                                    95
     A                                      '貸方合計:'
     A            T#CNTC         9  0    108
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR103T3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SPACEB(002)
     A                                    40
     A                                      '會計科目:'
     A            T#NO1          4        52
     A            T#NO2         14        57
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR103T4
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                    40
     A                                      '品名'
     A                                    53
     A                                      '金額合計'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR103T5
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            T#PDN1         3        41
     A            T#AMT1        10  0     49
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR103T6
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                    40
     A                                      '合計'
     A            T#AMT2        10  0     49
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR103TX
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 041
     A*%%***********************************************************************
     A                                      SKIPB(059)
     A                                     2
     A                                      '<財會>'
     A                                    +0
     A                                      '主管:'
     A                                    +0
     A                                      '            '
     A                                      UNDERLINE
     A                                    +0
     A                                      '複核:'
     A                                    +0
     A                                      '            '
     A                                      UNDERLINE
     A                                    +0
     A                                      '入帳:'
     A                                    +0
     A                                      '            '
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR103TM
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SPACEB(003)
     A                                      SPACEA(002)
     A*----------------------------------------------------------------
     A                                    19
     A                                      '*****無條件符合之資料！！'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARP103T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       222      *N     )
     A*%%***********************************************************************
