     A*%%TS  SD  19930902  162408  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARP110S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     電子商務--發票與銷貨資料重新下載處理
     A*            5.DATE-WRITTEN  93/09/02
     A*            6.DATE-UPDATED
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR110F1
     A*%%TS  SD  19930902  162408  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 28'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARP110S'
     A                                  2  2TIME
     A                                  2 25'★發票與銷貨資料重新下載處理★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                 10 19'下載資料日期:'
     A            S#DAT1         8Y 0B 10 35EDTWRD('    /  /  ')
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(RI)
     A                                 10 46' ~ '
     A            S#DAT2         8Y 0B 10 50EDTWRD('    /  /  ')
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                 23  3'PF3=結束作業'
     A                                 23 20'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
