     A                                      UNIQUE
     A          R RAR108F                   TEXT('修正發票檔')
     A            AFCUNO         6A         COLHDG('客戶代號')
     A            AFCUNM        10A         COLHDG('客戶名稱')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A            AFRVID         1A         COLHDG('業務員別')
     A            AFINNO        10A         COLHDG('發票號碼')
     A            AFINDT         8S 0       COLHDG('發票日期')
     A            AFAPNO         6A         COLHDG('請款單號')
     A            AFAPDT         8S 0       COLHDG('請款日期')
     A            AFDAMT        12S 0       COLHDG('發票金額')
     A            AFFAMT        12S 0       COLHDG('繳款金額')
     A            AFNBAL        12S 0       COLHDG('未繳金額')
     A*
     A          K AFINNO
