     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARP120S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     獎勵金製票代開處理報表
     A*            5.DATE-WRITTEN  101/02/10 2011AR641
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                      CF13(13)
     A                                  1 70'ARP120S'
     A            COMP          35A  O  1 23
     A                               O  1  2DATE
     A                                      EDTWRD('01  /  /  ')
     A                                  2 27'も獎勵金製票代開處理報表'
     A            DEVNM         10A  O  2 70
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 10 24'代開年月:'
     A            S#DATE         6Y 0B 10 36EDTWRD('    /  ')
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A                                    +5'PF13:確定代開'
