     A***************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A***************************************************************
     A*
     A                                      UNIQUE
     A          R RAR101F5                  TEXT('銷貨利息計算')
     A            A5YM2          6S 0       COLHDG('利息年月')
     A            A5CUNO         6A         COLHDG('客戶代號')
     A            A5CUNM        10A         COLHDG('客戶名稱')
     A            A5ORNO         6A         COLHDG('訂單號碼')
0409AA            A5PDNM         5A         COLHDG('品名')
     A            A5RAMT         8S 0       COLHDG('利息')
     A*
     A          K A5YM2
     A          K A5ORNO
     A          K A5PDNM
