     A                                      UNIQUE
     A          R RAR101F2                  TEXT('銷貨利息計算')
     A            A2INNO        10A         COLHDG('發票號碼')
     A            A2INDT         8S 0       COLHDG('開立日期')
     A            A2CUNO         6A         COLHDG('客戶代號')
     A            A2CUNM        10A         COLHDG('客戶名稱')
     A            A2DAT1         8S 0       COLHDG('加權兌現日')
     A            A2AMT         11S 0       COLHDG('發票金額')
     A*
     A          K A2INNO
