     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP121S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     獎勵金代開作業
     A*            5.DATE-WRITTEN  101/02/17  2012AR641
     A*
     A***************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR121F1
     A                                      CF03(03)
     A                                      CF13(13)
     A                                  1 70'ARP121S'
     A            S#COMP        35A  O  1 23
     A                                  1  2DATE
     A                                      EDTWRD('01  /  /  ')
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 32'獎勵金製票代開'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A                                  7 24'代開廠別:'
     A            S#AREA         1A  O  7 36
     A                                  7 40'( M:台中 K:高雄 H:苗栗'
     A                                  8 40'  L:林口 T:桃園)'
     A                                 10 24'代開年月:'
     A            S#DATE         6Y 0B 10 36EDTCDE(4)
     A  41                                  DSPATR(PC RI)
     A                                 14 18'（本作業每次針對該月份內的全部資+
     A                                      料來進行處理。）'
     A                                 23 12'F3:結束'
     A                                    +3'F13:代開還原'
     A                                 23 40'ENTER:執行'
     A            S#ERR         70A  O 24  2DSPATR(HI)
