     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP130S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02WCJ
     A*            4.FUNCTION     フ祇布癳筿祇布ざ郎穨
     A*            5.DATE-WRITTEN  107/03/27 2017AR1112
     A*
     A***************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR130F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                  1 70'ARP130S '
     A            S#COMP        35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 24'フ祇布癳筿祇布ざ郎穨'
     A            S#DEVI        10A  O  2 70
     A*--------------------------------------------------------------
     A                                  9 16'-----------------------------------
     A                                      ------------------'
     A                                 10 16'癳る:'
     A            S#YMD          6Y 0B    +1
     A                                      EDTCDE(4)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                    +2'临癳:'
     A            S#CHYN         1A  B    +1VALUES('Y' ' ')
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A                                    +1'(Y)'
     A                                 12 16'フ祇布癳筿祇布ざ+
     A                                      郎赣る玥礚猭秨ミ祇布'
     A                                      DSPATR(HI)
     A                                 11 16'-----------------------------------
     A                                      ------------------'
     A*--------------------------------------------------------------
     A                                 23 12'F3:挡'
     A                                 23 29'F12:玡礶'
     A                                 23 51'ENTER:磅︽'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
