     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*                                     UNIQUE
     A          R RAR101F4                  TEXT('銷貨利息計算')
     A            A4YM1          6S 0       COLHDG('銷貨年月')
     A            A4YM2          6S 0       COLHDG('利息年月')
     A            A4CUNO         6A         COLHDG('客戶代號')
     A            A4CUNM        10A         COLHDG('客戶名稱')
     A            A4ORNO         6A         COLHDG('訂單號碼')
0409AA            A4PDNM         5A         COLHDG('品名')
     A            A4AMT         10S 0       COLHDG('銷貨金額')
     A            A4RAMT         8S 0       COLHDG('利息')
     A*
     A          K A4YM1
     A          K A4YM2
     A          K A4ORNO
     A          K A4PDNM
