     A**************************************
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARP203T
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     業務員基本資料檔介面傳輸-錯誤清單
     A*            5.DATE-WRITTEN  112/09/27 2023AR00043
     A*
     A*****************************************************************
     A          R AR03T21
     A**************************************************************************
     A                                      SKIPB(003)
     A                                    45
     A                                      '東和鋼鐵企業股份有限公司'
     A                                      SPACEA(001)
     A                                     1
     A                                      '報表編號: ARP203T'
     A                                    43
     A                                      '業務員基本資料介面檔-錯誤清單'
     A                                   101
     A                                      '印表日期:'
     A            W#DATE         8  0     +1EDTWRD('    /  /  ')
     A                                      SPACEA(1)
     A                                     1
     A                                      '上傳者: '
     A            C#USER        10        13
     A                                   101
     A                                      '印表時間:'
     A                                    +1
     A                                      TIME
     A                                      SPACEA(1)
     A                                   101'頁　　數:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1'處理'
     A                                     7'業務員代號'
     A                                    19'業務員姓名'
     A                                    31'廠區別'
     A                                    39'部門代號'
     A                                    49'使用者代號'
     A                                    61'傳輸序號'
     A                                    75'傳輸日期'
     A                                    86'時間'
     A                                    93'傳輸人員'
     A                                   104'傳送訊息'
     A                                      SPACEA(001)
     A                                     1
     A                                      '=================================='
     A                                    35
     A                                      '=================================='
     A                                    69
     A                                      '=================================='
     A                                   103
     A                                      '=============================='
     A                                   133
     A                                      '=========='
     A                                      SPACEA(001)
     A**************************************************************************
     A          R AR03T22
     A**************************************************************************
     A                                      SPACEA(001)
     A            SIACD          1         4
     A            SIRVID         2        12
     A            SINAME        10        20
     A            SILOCA         1        35
     A            SIDEPT         4        42
     A            SIUSID        10        49
     A            SISQNO        13        61
     A            SITMDT         8  0     76
     A            SITMTM         6  0     86
     A            SITMOP        10        93
     A            S#STCL        38       104
     A**************************************************************************
     A          R AR03T23
     A**************************************************************************
     A                                      SPACEA(001)
     A                                    59
     A                                      '---- END OF DATA ----'
