     A                                      UNIQUE
     A          R RARPRPY                   TEXT('預收貨款介面檔')
     A            AYVTNO        10A         COLHDG('客戶統編')
     A            AYCUNM        10O         COLHDG('客戶簡稱')
     A            AYORNO         6A         COLHDG('訂單號碼')
     A            AYINNO        10A         COLHDG('發票號碼')
     A            AYCKNO        10A         COLHDG('票據號碼')
     A            AYSTDT         8S 0       COLHDG('開立日期')
     A            AYPYDT         8S 0       COLHDG('到期日期')
     A            AYCAMT        12S 0       COLHDG('票據金額')
     A            AYBSTS         1A         COLHDG('票據別')
     A*                                       L:信用狀
     A*                                       C:支票
     A*                                       O:現金
     A            AYPAMT        12S 0       COLHDG('預收貨款總餘額')
     A*
     A          K AYVTNO
     A          K AYORNO
     A          K AYINNO
     A          K AYCKNO
