     A          R RRPYST                    TEXT('互抵客戶應付金額記錄檔')
     A                                      PFILE(ARPYST)
     A****
     A          K RRCUNO
     A          K RRINDT
