     A*%%***********************************************************************
     A*%%TS  RD  19930819  153931  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARQ017T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.WRITER        S02CSF
     A*           4.FUNCTION     發票別出貨明細查詢─ＦＯＲ型鋼
     A*           5.DATE-WRITTEN  93/08/19
     A*           6.DATE-MODIFY
     A*
     A*
     A**************************************************************************
     A          R AR017T1H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報　　表：ARQ017T'
     A                                    54
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   121
     A                                      '列表日期：'
     A                                   133
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR-ID ：'
     A                                      SPACEB(001)
     A            U#USID        10A  O    14
     A                                    58
     A                                      '發票別出貨明細表'
     A                                   121
     A                                      '列表時間：'
     A                                   133
     A                                      TIME
     A                                     2
     A                                      '發票號碼：'
     A                                      SPACEB(001)
     A            T#INNO        10A  O    14
     A                                   121
     A                                      '頁　　次：'
     A                                   133
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1       142         2
     A                                      SPACEB(001)
     A                                     2
     A                                      '訂單編號'
     A                                      SPACEB(001)
     A                                    16
     A                                      '磅單編號'
     A                                    30
     A                                      '規範'
     A                                    40
     A                                      '鋼種'
     A                                    51
     A                                      '品名'
     A                                    65
     A                                      '規　　　　　格'
     A                                    94
     A                                      '長度'
     A                                   103
     A                                      '支數'
     A                                   113
     A                                      '重量'
     A                                   124
     A                                      '單價'
     A                                   134
     A                                      '金　　額'
     A                                     7
     A                                      '交貨地點'
     A                                      SPACEB(001)
     A                                    54
     A                                      '備　　註'
     A            T#LIN2       142         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR017T1D
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#ORNO         6         2
     A                                      SPACEB(001)
     A                                     8
     A                                      '-'
     A            T#ORTM         3  0      9
     A            T#VRNO         8        15
     A                                    23
     A                                      '-'
     A            T#VRTM         3        24
     A            T#STND         1        33
     A            T#QULT         8        39
     A            T#PDNM         3        53
     A            T#SPE1         5  0     60
     A                                      EDTCDE(4)
     A N53                                66
     A                                      'X'
     A            T#SPE2         5  0     68
     A                                      EDTCDE(4)
     A N51                                74
     A                                      'X'
     A            T#SPE3         5  0     76
     A                                      EDTCDE(4)
     A N52                                82
     A                                      'X'
     A            T#SPE4         5  0     84
     A                                      EDTCDE(4)
     A            T#SPE5         5  3     94
     A                                      EDTCDE(3)
     A            T#PNUM         5  0    103
     A                                      EDTCDE(4)
     A            T#QTY          9  0    111
     A                                      EDTCDE(1)
     A            T#UPRC         5  3    125
     A                                      EDTCDE(2)
     A            T#AMT          9  0    133
     A                                      EDTCDE(1)
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A            T#PLE1        50         4
     A            T#NOTE        98        56
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR017T1S
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A                                   102
     A                                      '小計:'
     A                                      SPACEB(001)
     A            T#QTYS        10S 0    110
     A                                      EDTCDE(1)
     A            T#AMTS        10S 0    131
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR017T1T
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A                                   102
     A                                      '合計:'
     A                                      SPACEB(001)
     A            T#QTYT        10S 0    110
     A                                      EDTCDE(1)
     A            T#AMTT        10S 0    131
     A                                      EDTCDE(1)
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A*         R AR017T1A
     A**************************************************************************
     A*                                  102
     A*                                     '總計:'
     A*                                     SPACEB(002)
     A*           T#QTYA        11S 0    110
     A*                                     EDTCDE(1)
     A*           T#AMTA        11S 0    132
     A*                                     EDTCDE(1)
     A**************************************************************************
     A          R AR017T1M
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A                                    19
     A                                      '*****無符合條件之資料!!!'
     A                                      SPACEB(008)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 008
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARP079T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       222      *N     )
     A*%%***********************************************************************
     A
