     A*%%TS  SD  19810919  112715  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19810908  124544  VIN         REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARQ013S-1'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'***  票據兌現查詢  ***   '
     A            DEVNM         10A  O  2 70
     A                                  7 30'到期日期起:'
     A            DATE1          6Y 0B  7 44EDTWRD('  /  /  ')
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  9 30'　　　　迄:'
     A            DATE2          6Y 0B  9 44EDTWRD('  /  /  ')
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A***************************************************************
     A          R SF1                       SFL
     A*%%TS  SD  19810919  112715  VIN         REL-V2R1M1  5738-PW1
     A  88                                  SFLNXTCHG
     A            W01       R        O 10  4REFFLD(ACBNAM BANKAC)
     A            W02       R        O 10 16REFFLD(RVTANO RCVDTL)
     A            W03       R        O 10 30REFFLD(RVNTNO RCVDTL)
     A            W04       R        O 11 42REFFLD(RVDATE RCVDTL)
     A                                      EDTWRD('    /  /  ')
     A            W05       R        O 10 53REFFLD(RVDUDT RCVDTL)
     A                                      EDTWRD('    /  /  ')
     A            W06       R        O 10 62REFFLD(RVRAMT RCVDTL)
     A                                      EDTCDE(K)
     A            W21       R        O 11  6REFFLD(ACBNAM BANKAC)
     A            W22       R        O 11 18REFFLD(RVSANO RCVDTL)
     A            W23       R        O 11 30REFFLD(RVNO RCVDTL)
     A            W24           10O  O 11 41
     A            W25            7A  O 11 53
     A            W26            8O  O 11 62
     A            W27       R        O 11 73REFFLD(RVUSTP RCVDTL)
     A***************************************************************
     A          R SFCTL1                    SFLCTL(SF1)
     A*%%TS  SD  19810919  110612  VIN         REL-V2R1M1  5738-PW1
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A                                      OVERLAY
     A                                      CF03(03)
     A                                      CF12
     A  80                                  SFLCLR
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  10                                  SFLEND
     A                                  1 70'ARQ013S-2'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'***  票據兌現查詢  ***   '
     A            DEVNM         10A  O  2 70
     A                                  4  4'到期日期:'
     A            DATE1          6Y 0O  4 16EDTWRD('  /  /  ')
     A                                  4 25'-'
     A            DATE2          6Y 0O  4 27EDTWRD('  /  /  ')
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      DSPATR(HI)
     A                                  9  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      DSPATR(HI)
     A                                  6 21'入'
     A                                  6 10'存'
     A                                  6 21'入'
     A                                  7  8'（託'
     A                                  7 21'收）'
     A                                  7 30'票據號碼'
     A                                  7 41'繳款日期'
     A                                  7 52'到期日期'
     A                                  7 66'票據金額　　'
     A                                  8  5'帳號名稱'
     A                                  8 17'銀行帳號'
     A                                  8 30'繳款編號'
     A                                  8 41'客戶名稱'
     A                                  8 52'傳票號碼　付款地　款項別'
     A***************************************************************
     A          R UND01
     A                                      OVERLAY
     A                                 22  3'------------------------------+
     A                                      ----------------------------------+
     A                                      --------------'
     A                                      DSPATR(HI)
     A            ERRMSG        70A  O 23 02DSPATR(HI)
     A                                 24  5'PF03:結束'
     A                                    +2'PF12:回前畫面'
     A***************************************************************
