     A*%%TS  SD  19930816  160320  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARQ017SA
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     祇布砯灿琩高⒃⑤⑧供
     A*            5.DATE-WRITTEN  93/08/16
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '挡穨')
     A                                      CA12(12 '玡礶')
     A*================================================================
     A          R AR017F1
     A*
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 27'狥㎝葵臟穨Τそ'
     A            S#SRID        10A  O  1 70
     A                                  2  2TIME
     A                                  2 28'」祇布砯灿琩高」'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                 10 26'祇布腹絏'
     A            S#IVNO        10A  B 10 39
     A  50                                  DSPATR(PC RI)
     A                                 23  2'F3=挡穨'
     A                                 23 16'F12=玡礶'
     A            S#ERR1        70A  O 24  2DSPATR(HI)
