     A*%%TS  SD  19811118  093935  JEFF        REL-V2R1M1  5738-PW1
     A************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19811118  093935  JEFF        REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR038S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'も折讓開立未簽回明細表も'
     A            DEVNM         10A  O  2 70
     A                                  7 24'開立廠區：'
     A            AREA           1A  B  7 37
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A*                                 9 39' '
     A                                  7 41'(" ":全部'
     A                                  8 42'"P":台北'
     A                                  9 42'"T":桃園'
     A                                 10 42'"K":高雄'
     A                                 11 42'"H":苗栗'
     A                                 12 42'"M":台中)'
     A                                 14 24'客戶代號：'
     A            S#CUNO         6A  B 14 37
     A                                 14 45'(客戶代號空白表示全部)'
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
