     A************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR004S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 24'も　客戶別訂單餘額明細表　も'
     A            DEVNM         10A  O  2 70
     A                               O  6 31'*請輸入客戶號碼*'
     A                               O  8 31'起:'
     A            CUNOF          6   B  8 39DSPATR(MDT)
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                 10 31'訖:'
     A            CUNOT          6   B 10 39DSPATR(MDT)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
