     A          R RAR096F                   TEXT('訂單銷貨')
     A            AXCUNO         6A         COLHDG('客戶編號')
     A            AXCUNM        10O         COLHDG('客戶簡稱')
     A            AXORNO         6A         COLHDG('訂單編號')
     A            AXORTM         3S 0       COLHDG('訂單項次')
     A            AXWTNO         8A         COLHDG('磅單號碼')
     A            AXWTTM         3S 0       COLHDG('磅單項次')
     A            AXWTDT         8S 0       COLHDG('出貨日期')
     A            AXSPC1         5A         COLHDG('Ｈ')
     A            AXSPC2         5A         COLHDG('Ｂ')
     A            AXLENG         4A         COLHDG('長度')
     A            AXSPEC         6S 0       COLHDG('支數')
     A            AXWGHT         9S 0       COLHDG('重量')
     A            AXUPRC         7S 5       COLHDG('單價')
     A            AXINNO        10A         COLHDG('發票號碼')
     A*
     A          K AXORNO
     A          K AXORTM
     A          K AXWTNO
     A          K AXWTTM
