     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR084F
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     前期出貨本期開立發票磅單重複工作檔
     A*            5.DATE-WRITTEN  108/07/09  2019AR00017
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A*
     A*                                     UNIQUE
     A          R RARR84F1                  TEXT('前出本開磅單重複工作檔')
     A            T1CUNO         6A         COLHDG('客戶編號')
     A            T1CUNM        10O         COLHDG('客戶名稱')
     A            T1IVNO        10A         COLHDG('發票號碼')
     A            T1IVDT         8S 0       COLHDG('發票日期')
     A            T1BAMT        11S 0       COLHDG('扣預收')
     A            T1NO           8A         COLHDG('磅單號碼')
     A            T1DATE         8S 0       COLHDG('出貨日期')
     A            T1PDNM         5A         COLHDG('品名')
     A            T1UPRC         5S 2       COLHDG('單價')
     A            T1QTY          7S 0       COLHDG('數量')
     A            T1AMT         11S 0       COLHDG('原始金額')
     A            T1ORNO         6A         COLHDG('訂單號碼')
     A****
     A          K T1NO
     A          K T1PDNM
     A          K T1UPRC
     A          K T1QTY
     A          K T1IVNO
