     A************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR001S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'も請　款　單　列　印も'
     A            DEVNM         10A  O  2 70
     A                                  7 24'客戶編號：'
     A            CUNO           6   B   + 1
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  9 24'請款單號：'
     A            APNO           6   B   + 1
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
