     A*%%TS  SD  19940818  105644  S02CSF      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR072S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     客戶別各廠成品別出貨表
     A*            5.DATE-WRITTEN  87/06/29
     A*            5.DATE-MODIFY   92/06/24
     A*
     A***************************************************************
     A*  畫面一:處理日期
     A*
     A*        記錄格式 AR072F1
     A***************************************************************
     A          R AR072F1
     A*%%TS  SD  19940818  105644  S02CSF      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR072S '
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 25'★客戶別各廠成品出貨明細表★'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A                                  6 15'內外銷別:'
     A            S#COD1         1A  B  6 27VALUES('1' '2' '3')
     A  55                                  DSPATR(PC)
     A  55                                  DSPATR(RI)
     A                                  6 29'(1:內銷2:外銷3:內外銷)'
     A                                  8 15'成品大類:'
     A            S#TYPE         1A  B  8 27VALUES('1' '2' '3' '4' '5' '6' '7' -
     A                                      '8' '9')
     A                                  8 29'(1:鋼筋2:型鋼（不含ＢＨ）3:+
     A                                      鋼板4:槽鋼'
     A                                 10 30'5:Ｉ型鋼6:型鋼＋鋼板＋槽鋼＋Ｉ+
     A                                      型鋼7:ＢＨ'
     A                                 12 30'8:型鋼＋鋼板＋槽鋼＋Ｉ型鋼＋ＢＨ-
     A                                      9:圓鋼棒'
     A                                 14 15'年月區間:'
     A            S#FRYM         6Y 0B 14 27EDTCDE(4)
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                 14 34'至'
     A            S#TOYM         6Y 0B 14 39EDTCDE(4)
     A  52                                  DSPATR(PC)
     A  52                                  DSPATR(RI)
     A                                 14 46'(第二欄位空白只挑單月)'
     A                                 16 15'客戶代號:'
     A            S#CUN1         6A  B 16 27
     A  53                                  DSPATR(PC)
     A  53                                  DSPATR(RI)
     A                                 16 34'至'
     A            S#CUN2         6A  B 16 39
     A  54                                  DSPATR(PC)
     A  54                                  DSPATR(RI)
     A                                 16 46'(第二欄位空白只挑單客戶)'
     A                                 17 46'(二欄皆空白代表全部客戶)'
     A                                 23  3'F3:結束'
     A                                 23 17'F12:回前畫面'
     A                                 23 37'ENTER:執行'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
