     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR076R
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     銷貨帳款帳齡分析彙總表
     A*            5.DATE-WRITTEN  88/06/11
     A*
     A***************************************************************
     A          R AR076T1H
     A                                      SKIPB(003)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報表代號: ARR076T'
     A                                    66
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   138
     A                                      '列表日期:'
     A                                   149
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '列表人員:'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
     A                                    67
     A                                      '銷貨帳款帳齡分析彙總表'
     A                                   138
     A                                      '列表時間:'
     A                                   149
     A                                      TIME
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '逾領日數: '
     A                                      SPACEB(002)
     A            R#DAY1         4S 0O    +0
     A                                      EDTCDE(2)
     A                                    +6
     A                                      '逾期日數: '
     A            R#DAY2         4S 0O    +0
     A                                      EDTCDE(2)
     A                                    +6
     A                                      '催收日數: '
     A            R#DAY3         4S 0O    +0
     A                                      EDTCDE(2)
     A                                   +64
     A                                      '（含應收帳款及未兌現票據）'
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '統計截止日: '
     A                                      SPACEB(001)
     A            R#ETXD         8S 0O    +0EDTWRD('    /  /  ')
     A*----------------------------------------------------------------*********
     A                                     8
     A                                      '部門'
     A                                      SPACEB(002)
     A                                    25
     A                                      '業務員'
     A            R#DA1B         4S  O    +6
     A                                      EDTCDE(4)
     A                                    +1
     A                                      '--'
     A            R#DA1E         4S  O    +1
     A                                      EDTCDE(4)
     A                                    +2
     A                                      '比率％'
     A            R#DA2B         4S  O    +4
     A                                      EDTCDE(4)
     A                                    +1
     A                                      '--'
     A            R#DA2E         4S  O    +1
     A                                      EDTCDE(4)
     A                                    +2
     A                                      '比率％'
     A            R#DA3B         4S  O    +4
     A                                      EDTCDE(4)
     A                                    +1
     A                                      '--'
     A            R#DA3E         4S  O    +1
     A                                      EDTCDE(4)
     A                                    +2
     A                                      '比率％'
     A            R#DA4B         4S  O    +4
     A                                      EDTCDE(4)
     A                                    +2
     A                                      '以上'
     A                                    +2
     A                                      '比率％'
     A                                    +7
     A                                      '合計'
     A*----------------------------------------------------------------*********
     A                                     3
     A                                      '----------------'
     A                                      SPACEB(001)
     A                                    21
     A                                      '--'
     A                                    +1
     A                                      '----------'
     A                                    +4
     A                                      '--------------'
     A                                    +1
     A                                      '-------'
     A                                    +4
     A                                      '--------------'
     A                                    +1
     A                                      '-------'
     A                                    +4
     A                                      '--------------'
     A                                    +1
     A                                      '-------'
     A                                    +4
     A                                      '--------------'
     A                                    +1
     A                                      '-------'
     A                                    +4
     A                                      '--------------'
     A***************************************************************
     A          R AR076T1D
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A            R#DEPT         4A        3
     A            R#DEPN        12O       +0
     A            R#RVID         2A       +2
     A            R#RVNM        10O       +1
     A            R#AMTA        11S 0     +4
     A                                      EDTCDE(1)
     A            R#RATA         6S 3     +1
     A                                      EDTCDE(1)
     A            R#AMTB        11S 0     +4
     A                                      EDTCDE(1)
     A            R#RATB         6S 3     +1
     A                                      EDTCDE(1)
     A            R#AMTC        11S 0     +4
     A                                      EDTCDE(1)
     A            R#RATC         6S 3     +1
     A                                      EDTCDE(1)
     A            R#AMTD        11S 0     +4
     A                                      EDTCDE(1)
     A            R#RATD         6S 3     +1
     A                                      EDTCDE(1)
     A            R#AMTE        11S 0     +4
     A                                      EDTCDE(1)
     A**************************************************************************
     A          R AR076T1S
     A                                      SPACEB(001)
     A                                      SPACEA(003)
     A*----------------------------------------------------------------
     A                                     7
     A                                      '部門小計：'
     A            R#SAMA        11S 0     38
     A                                      EDTCDE(1)
     A            R#SRTA         6S 3     53
     A                                      EDTCDE(1)
     A            R#SAMB        11S 0     64
     A                                      EDTCDE(1)
     A            R#SRTB         6S 3     79
     A                                      EDTCDE(1)
     A            R#SAMC        11S 0     90
     A                                      EDTCDE(1)
     A            R#SRTC         6S 3    105
     A                                      EDTCDE(1)
     A            R#SAMD        11S 0    116
     A                                      EDTCDE(1)
     A            R#SRTD         6S 3    131
     A                                      EDTCDE(1)
     A            R#SAME        11S 0    142
     A                                      EDTCDE(1)
     A**************************************************************************
     A          R AR076T1T
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A                                     9
     A                                      '合計：'
     A            R#TAMA        11S 0     38
     A                                      EDTCDE(1)
     A            R#TRTA         6S 3     53
     A                                      EDTCDE(1)
     A            R#TAMB        11S 0     64
     A                                      EDTCDE(1)
     A            R#TRTB         6S 3     79
     A                                      EDTCDE(1)
     A            R#TAMC        11S 0     90
     A                                      EDTCDE(1)
     A            R#TRTC         6S 3    105
     A                                      EDTCDE(1)
     A            R#TAMD        11S 0    116
     A                                      EDTCDE(1)
     A            R#TRTD         6S 3    131
     A                                      EDTCDE(1)
     A            R#TAME        11S 0    142
     A                                      EDTCDE(1)
     A**************************************************************************
     A          R AR076T1M
     A                                      SPACEB(003)
     A                                      SPACEA(002)
     A                                    19
     A                                      '*****無條件符合之資料！！'
     A**************************************************************************
