     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     H*
     A*            1.PROGRAM-ID    ARR065S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02KRH
     A*            4.FUNCTION     訂單銷貨發票明細表
     A*            5.DATE-WRITTEN  85/12/17
     A*
     A***************************************************************
     A*  畫面一:輸入客戶及訂單
     A*
     A*        記錄格式 AR030F1
     A***************************************************************
     A          R AR030F1                   CF03(03)
     A*--------------------------------------------------------------
     A                                  1 70'ARE030S-1'
     A            S#COMP        35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 32'訂單銷貨發票明細列印'
     A            S#DEVI        10A  O  2 70
     A*--------------------------------------------------------------
     A                                 10 20'訂單號碼:'
     A            S#ORNO         6A  B    +1
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                 23 12'F3:回主畫面'
     A                                    +4'ENTER:完成輸入'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
     A
