     A*%%TS  SD  19811013  163909  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19811013  163909  VIN         REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR006S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 26'もも電子計算機統一發票もも'
     A            DEVNM         10A  O  2 70
     A                                  8 26'發票號碼起:'
     A            W0101         10A  B  8 40
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                 10 34'止:'
     A            W0102         10A  B 10 40
     A            ERRMSG        60O  O 20 18
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
