     A                                      UNIQUE
     A          R AR051F#                   TEXT('折讓開立彙總檔')
     A            TFFLAG         1A         COLHDG('處理代碼')
     A            TFCODE         4A         COLHDG('單據代號')
     A            TFNO           8A         COLHDG('單據號碼')
     A            TFCUNO         6A         COLHDG('客戶代號')
     A            TFCUNM        10O         COLHDG('客戶名稱')
     A            TFDATE         8S 0       COLHDG('單據日期')
     A            TFITEM         2S 0       COLHDG('項次')
     A            TFACNT         1A         COLHDG('原因別')
     A            TFACDT         8S 0       COLHDG('入帳日期')
     A            TFAMT         11P 0       COLHDG('金額')
     A            TFTAX         11P 0       COLHDG('稅額')
     A            TFTXAR         1A         COLHDG('廠區')
     A****
     A          K TFCODE
     A          K TFNO
     A          K TFITEM
     A          K TFTXAR
