     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR036S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     未開立發票明細表
     A*            5.DATE-WRITTEN  89/04/05
     A*            6.UPDATE  DATE  99/12/06  2010ARXXX  S00WCJ (9912A)
     A*                            增加U廠選項
     A*
     A***************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR036F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR036S '
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 29'★未開立發票明細表★'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A                                  8 30'銷貨年月：'
     A            S#YYMM         6Y 0B  8 43
     A                                      EDTWRD('    /  ')
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                    +1'～'
     A            S#YYM2         6Y 0B    +1
     A                                      EDTWRD('    /  ')
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 10 30'銷貨廠區：'
     A            S#AREA         1A  B 10 43
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
9912AA                                 10 45'(   T :八德'
     A                                 11 45'    H :苗栗'
     A                                 12 45'    M :台中'
     A                                 13 45'    K :高雄'
9912AA                                 14 45'    U :桃園'
9912AA                                 15 45'空白:全部)'
     A            S#ERR         70A  O 23  2DSPATR(HI)
     A                                 24  5'PF03:結束'
     A                                 24 18'PF12:回前畫面'
