     A*%%TS  SD  19811008  092927  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19811008  092927  VIN         REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR016S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'***票據票齡分析表***'
     A            DEVNM         10A  O  2 70
     A                                  7 26'地區別  :'
     A            AREA           1A  B  7 38
     A  40                                  DSPATR(PC)
     A  40                                  DSPATR(RI)
     A                                  7 40'( " ":全公司 "P":台北'
     A                                  7 66'"T":桃園'
     A                                  8 40'  "K":高雄   "M":台中'
     A                                  8 66'"H":苗栗)'
     A                                 11 26'客戶編號:'
     A            CUST1     R        B 11 38REFFLD(CUCUNO CURCPR)
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                 11 45'-'
     A            CUST2     R        B 11 47REFFLD(CUCUNO CURCPR)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
