     A*%%TS  SD  19901123  103359  S02YSH      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR091S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     應收款項檢核表
     A*            5.DATE-WRITTEN  90/11/13
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR091F1
     A*%%TS  SD  19901123  103359  S02YSH      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARR091S'
     A                                  2  2TIME
     A                                  2 33'應收款項檢核表'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  8 18'廠　區 :'
     A            S#AREA         1A  B  8 29VALUES(' ' 'P' 'M' 'T' 'H' 'K')
     A  24                                  DSPATR(PR)
     A                                    +1'(空白表全部)'
     A                                 10 18'到期日 :'
     A            S#DUS          8Y 0B 10 29EDTWRD('    /  /  ')
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                 10 40'至'
     A            S#DUE          8Y 0B 10 45EDTWRD('    /  /  ')
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                 10 56'(空白：與前項同)'
     A                                 12 18'異常狀況:'
     A                                 12 30'A:轉催收'
     A                                 13 30'B:發票未開逾'
     A            S#DAT1         2Y 0B 13 45EDTCDE(4)
     A                                 13 48'天（不含）'
     A                                 14 30'C:已開發票逾'
     A            S#DAT2         2Y 0B 14 45EDTCDE(4)
     A                                 14 48'天未請款（不含）'
     A                                 15 30'D:已請款逾'
     A            S#DAT3         2Y 0B 15 43EDTCDE(4)
     A                                 15 46'天未繳款（不含）'
     A                                 17 18'報表類別:'
     A            S#TYPE         1A  B 17 30VALUES('A' 'B')
     A                                      DSPATR(RI)
     A                                 17 33'(A:異常檢核表B:應收明細表)'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
