     A          R RARREC                    TEXT('廠區別應收')
     A            ARCUNO         6A         COLHDG('客戶編號')
     A            ARCUNM        10O         COLHDG('客戶簡稱')
     A            ARORNO         5A         COLHDG('訂單編號')
     A            ARPDTP         1A         COLHDG('品名別')
     A            ARDAMP        11S 0       COLHDG('台北應收')
     A            ARDAMM        11S 0       COLHDG('台中應收')
     A            ARDAMT        11S 0       COLHDG('桃園應收')
     A            ARDAMH        11S 0       COLHDG('苗栗應收')
     A            ARDAMK        11S 0       COLHDG('高雄應收')
     A*
     A          K ARCUNO
     A          K ARORNO
     A          K ARPDTP
