     A*%%TS  SD  19810909  140739  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A*       UPDATE  DATE   113/01/19  2024AR00005 S00WCJ (1301A)
     A*                       日期改為區間，增加票據別及託收帳號篩選
     A*                       欄位
     A****************************************************************
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19810909  140739  VIN         REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR011S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 26'もも　票據託收明細表　もも'
     A            DEVNM         10A  O  2 70
1301AA                                  8 21'託收日期：'
1301AA            DATE           8Y 0B    +1EDTWRD('    /  /  ')
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
1301AA                                    +1'～'
1301AA            S#DATE         8Y 0B    +1EDTWRD('    /  /  ')
1301AA  43                                  DSPATR(PC)
1301AA  43                                  DSPATR(RI)
1301AA                                 10 21'廠　　區：'
1301AA            AREA           1A  B    +1
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
1301AA  48                                  DSPATR(PR)
1301AA                                 12 21'票據別 :'
1301AA            S#NTTP         1A  B    +1VALUES('A' 'B' 'C' 'D' +
1301AA                                             'E' 'F' 'I' ' ')
1301AA                                    +1'(A=支票B=背書支票C=+
1301AA                                      本票D=背書本票'
1301AA                                 13 35'E=銀行本票F=匯票+
1301AA                                       I=信用狀 " "=全部)'
1301AA                                 15 21'託收帳號:'
1301AA            S#TANO        10A  B    +1
1301AA  44                                  DSPATR(PC)
1301AA  44                                  DSPATR(RI)
1301AA                                    +1'(空白表全部)'
     A*
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
