     A*%%TS  SD  19901112  174544  S02YSH      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A****************************************************************
     A*                >> PROGRAM  INTRODUCTION <<
     A*                1.PROGARM-ID    ARR090S
     A*                2.PROGRAM-TYPE  DSPF
     A*                3.AUTHOR        S02YSH
     A*                4.FUNCTIN      客戶訂單別每月應收帳款明細表
     A*                5.DATE-WRITTEN  90/11/12
     A*                6.DATE-UPDATE
     A****************************************************************
     A          R ARR090S
     A*%%TS  SD  19901112  174544  S02YSH      REL-V4R4M0  5769-PW1
     A                                      CA03(03 '離開')
     A                                      CA12(12 '回上頁')
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  2 26'客戶訂單別每月應收帳款明細表'
     A                                  1  2DATE
     A                                  1 70'ARR090S'
     A                                  2  2TIME
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  9 24'客戶代號:'
     A            S#CUNO         6A  B  9 36
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 11 24'訂單號碼:'
     A            S#ORNS         6A  B 11 36
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 11 43'～'
     A            S#ORNE         6A  B 11 48
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                 13 24'統計年月:'
     A            S#DATS         6Y 0B 13 36EDTCDE(4)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 13 43'～'
     A            S#DATE         6Y 0B 13 48EDTCDE(4)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 22  2'F3:離開 F12:回上一頁'
     A            S#ERR         40A  O 23  2
