     A*%%TS  SD  19931126  165544  S02CSF      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19931126  165544  S02CSF      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            COMP          35A  O  1 23
     A                                  1 70'ARR055S'
     A                                  2 26'も部門別繳款明細表（營業）も'
     A            DEVNM         10A  O  2 70
     A                                  7 15'印表類別:'
     A            S#TYPE         1A  B  7 27
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A                                  7 29'(1繳款日期別, 2業務別3 客戶+
     A                                      別, 4票據到期日)'
     A                                 10 15'日　　期:'
     A            DATE1          8Y 0B 10 27EDTWRD('    /  /  ')
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                 10 38'~~'
     A            DATE2          8Y 0B 10 41EDTWRD('    /  /  ')
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 12 15'業　　務:'
     A            S#RCV1         1A  B 12 27
     A                                 12 29'~~'
     A            S#RCV2         1A  B 12 32
     A                                 14 15'客　　戶:'
     A            S#CUN1         6A  B 14 27
     A                                 14 34'~~'
     A            S#CUN2         6A  B 14 37
     A                                 16 15'訂　　單:'
     A            S#ORNO         6A  B 16 27
     A                                 16 34'（空白表示全部）'
     A                                 18 10'印表類別若為繳款日期，則日期區+
     A                                      間請輸入繳款日。反之，'
     A                                      DSPATR(HI)
     A                                 19 10'印表類別為票據到期日，則日期區間+
     A                                      請輸入票據到期日。'
     A                                      DSPATR(HI)
     A                                 21 10'業務及客戶範圍設定：起始值空白表+
     A                                      示全選，終止值空白只採用起始值。'
     A                                      DSPATR(HI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
