     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR082S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     信用狀押匯月報表
     A*            5.DATE-WRITTEN  88/12/08
     A*            6.UPDATE  DATE 111/11/17 2022AR00050 S00WCJ (1111A)
     A*                            增加票據別欄位
     A*
     A***************************************************************
     A*  畫面一:押匯年月
     A*
     A*        記錄格式 AR082F1
     A***************************************************************
     A          R AR082F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A*----------------------------------------------------------------
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR082S '
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
1111AA                                  2 28'★財務用應收帳款月報表★'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A*----------------------------------------------------------------
     A                                 10 26'統計日期:'
     A            S#YY           4Y 0B    +1EDTCDE(4)
     A                                    +1'年'
     A            S#MM           2Y 0B    +2EDTCDE(4)
     A                                    +1'月'
1111AA*
1111AA                                 12 26'  票據別:'
1111AA            S#NTTP         1A  B    +1VALUES('A' 'I' 'J' ' ')
1111AA                                    +1'(A=應收票據I=信用狀'
1111AA                                 13 40' J=銀行存款，空白表+
1111AA                                        A+I+J)'
     A*----------------------------------------------------------------
     A                                 23  3'F3:結束'
     A                                 23 19'F12:回前'
     A                                 23 36'ENTER:執行'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
