     A*                                     UNIQUE
     A          R RAR035F                   TEXT('當月開立發票明細表')
     A            AFCUNO         6A         COLHDG('客戶代號')
     A            AFCUNM        10O         COLHDG('客戶名稱')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A            AFBAMT        12S 0       COLHDG('預收金額')
     A*
     A          K AFCUNO
