     A          R RARR092                   TEXT('瞷瑈箇︳')
     A            A9CUNO         6A         COLHDG('め腹')
     A            A9DATS         4S 0       COLHDG('綪砯眀闹ぱ计')
     A            A9DAT2         4S 0       COLHDG('祇布眀闹ぱ计')
     A            A9CONT         4S 0       COLHDG('瞷掸计')
     A*
     A          K A9CUNO
