     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR009S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 24'もも　應收帳款帳齡分析表　もも'
     A            DEVNM         10A  O  2 70
     A                                  8 28'客戶編號:'
     A            CUNOS          6A  B    +1
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                    +1'~'
     A            CUNOE          6A  B    +1
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A*
     A                                 10 28'截止日期:'
     A            DATE1          8  0B    +1EDTWRD('    /  /  ')
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
