     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR088T
     A*            2.PROGRAM-TYPE  PRTF
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     應收發票明細表(查帳用)
     A*            5.DATE-WRITTEN  89/08/03
     A*            6.DATE-MODIFY   89/08/03
     A*
     A*****************************************************************
     A          R AR088H
     A                                      SKIPB(003)
     A                                     2
     A                                      ' RPT - ID : ARR088T'
     A                                    57
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   110
     A                                      '印表日期:'
     A                                   122
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '訂單號碼:'
     A                                      SPACEB(001)
     A            T#ORNO         6        +1
     A
     A N50                                57
     A                                      '應收發票明細表(查帳用)'
     A  50                                57
     A                                      '應收磅單明細表(查帳用)'
     A                                   110
     A                                      '頁　　數:'
     A                                   122
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     1' '
     A                                      SPACEB(001)
     A N50                                 2
     A                                      '發票日期:'
     A  50                                 2
     A                                      '出貨日期:'
     A            T#DATE         6  0     +1
     A                                      EDTCDE(Y)
     A                                    +1
     A                                      '(含之前)'
     A                                     2
     A                                      '客戶編號:'
     A                                      SPACEB(001)
     A            T#CUNO         6        +1
     A            T#CUNM        10        +2
     A            T#LIN1       131         2
     A                                      SPACEB(002)
     A                                     2
     A                                      '訂單號碼'
     A                                      SPACEB(001)
     A N50                                15
     A                                      '發票號碼'
     A  50                                15
     A                                      '磅單號碼'
     A N50                                28
     A                                      '發票日期'
     A  50                                28
     A                                      '出貨日期'
     A                                    45
     A                                      '出貨金額'
     A                                    60
     A                                      '折/退金額'
     A                                    79
     A                                      '扣預收貨款'
     A                                   103
     A                                      '稅額'
     A                                   117
     A                                      '發票餘額'
     A            T#LIN2       131         2
     A                                      SPACEB(001)
     A*****************************************************************
     A          R AR088T1
     A            T#ORN1         6         4
     A                                      SPACEB(001)
     A            T#INNO        10        15
     A            T#INDT         6  0     29
     A                                      EDTCDE(Y)
     A            T#AAMT        11  0     40
     A                                      EDTCDE(J)
     A            T#CAMT        11  0     58
     A                                      EDTCDE(J)
     A            T#DAMT        11  0     76
     A                                      EDTCDE(J)
     A            T#TAX         11  0     94
     A                                      EDTCDE(J)
     A            T#NBAL        11  0    112
     A                                      EDTCDE(J)
     A**************************************************************
     A          R AR088T2
     A                                    28
     A                                      '訂單小計:'
     A                                      SPACEB(001)
     A            T#AMT1        11  0     40
     A                                      EDTCDE(J)
     A            T#CMT1        11  0     58
     A                                      EDTCDE(J)
     A            T#DMT1        11  0     76
     A                                      EDTCDE(J)
     A            T#TAX1        11  0     94
     A                                      EDTCDE(J)
     A            T#BAL1        11  0    112
     A                                      EDTCDE(J)
     A**************************************************************
     A          R AR088T3
     A
     A                                    28
     A                                      '客戶合計:'
     A                                      SPACEB(001)
     A            T#AMT2        11  0     40
     A                                      EDTCDE(J)
     A            T#CMT2        11  0     58
     A                                      EDTCDE(J)
     A            T#DMT2        11  0     76
     A                                      EDTCDE(J)
     A            T#TAX2        11  0     94
     A                                      EDTCDE(J)
     A            T#BAL2        11  0    112
     A                                      EDTCDE(J)
