     A*%%***********************************************************************
     A*%%TS  RD  19890809  092118  S02YSH      REL-V3R7M0  5716-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR084T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     前期出貨本月開立發票明細表
     A*           4.DATE-WRITTEN  89/04/08
     A*           5.WRITER        S02YSH
     A*
     A*
     A*****************************************************************
     A          R AR084TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A                                     2
     A                                      '報表代號: ARR084T'
     A                                    65
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   131
     A                                      '列表日期:'
     A                                   143
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '列表人員:'
     A                                      SPACEB(001)
     A            T#USID        10A       +1
     A                                    64
     A                                      '前期出貨本月開立發票明細表'
     A                                   131
     A                                      '列表時間:'
     A                                   143
     A                                      TIME
     A                                     2
     A                                      '發票年月:'
     A                                      SPACEB(001)
     A            T#YYMM         4S 0     14
     A                                      EDTCDE(Y)
     A                                   131
     A                                      '頁　　次:'
     A                                   143
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '開立廠區:'
     A                                      SPACEB(001)
     A            T#BARA         6        13
     A            T#LIN1       152         1
     A                                      SPACEB(001)
     A                                     2
     A                                      '客戶編號'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '客戶名稱'
     A                                    +1
     A                                      '發票號碼'
     A                                    +1
     A                                      '發票日期'
     A                                    +6
     A                                      '扣預收'
     A                                    +1
     A                                      '磅單號碼'
     A                                    +0
     A                                      '出貨日期'
     A                                    +3
     A                                      '品　名'
     A                                    +0
     A                                      '單　價'
     A                                    +3
     A                                      '數　量'
     A                                   118
     A                                      '原始金額'
     A                                   130
     A                                      '訂單號碼'
     A            T#LIN2       152A        1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR084T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#CUNO         6A        4
     A                                      SPACEB(001)
     A            T#CUNM        10O       13
     A            T#IVNO        10A       24
     A N43        T#IVDT         6S 0     35
     A                                      EDTCDE(Y)
     A N43        T#BAMT        11S 0     44
     A                                      EDTCDE(J)
     A            T#NO           8A       60
     A            T#DATE         6S 0     71
     A                                      EDTCDE(Y)
     A            T#PDNM         3A       85
     A            T#UPRC         5S 2     +4
     A                                      EDTCDE(J)
     A            T#QTY          7S 0     +1
     A                                      EDTCDE(J)
     A            T#AMT         11S 0     +3
     A                                      EDTCDE(J)
     A            T#ORNO         5A      132
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR084T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    28
     A                                      '發票小計：'
     A                                      SPACEB(001)
     A            T#BAM1        11S 0     44
     A                                      EDTCDE(J)
     A            T#QTY1         8S 0     99
     A                                      EDTCDE(J)
     A            T#AMT1        12S 0    112
     A                                      EDTCDE(J)
     A                                   130
     A                                      '餘額:'
     A            T#BAL1        11S 0    137
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR084T3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    28
     A                                      '訂單小計：'
     A                                      SPACEB(001)
     A            T#BAM2        11S 0     44
     A                                      EDTCDE(J)
     A            T#QTY2         8S 0     99
     A                                      EDTCDE(J)
     A            T#AMT2        12S 0    112
     A                                      EDTCDE(J)
     A                                   130
     A                                      '餘額:'
     A            T#BAL2        11S 0    137
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR084T4
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    28
     A                                      '客戶小計：'
     A                                      SPACEB(001)
     A            T#BAM3        11S 0     44
     A                                      EDTCDE(J)
     A            T#QTY3         9S 0     98
     A                                      EDTCDE(J)
     A            T#AMT3        13S 0    110
     A                                      EDTCDE(J)
     A                                   130
     A                                      '餘額:'
     A            T#BAL3        11S 0    137
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR084T5
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    28
     A                                      '廠區小計：'
     A                                      SPACEB(001)
     A            T#BAM4        11S 0     44
     A                                      EDTCDE(J)
     A            T#QTY4         9S 0     98
     A                                      EDTCDE(J)
     A            T#AMT4        13S 0    110
     A                                      EDTCDE(J)
     A                                   130
     A                                      '餘額:'
     A            T#BAL4        11S 0    137
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARR084T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       200      *N     )
     A*%%***********************************************************************
