     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A          R W1REC                     TEXT('訂單別出貨發票表DOWNLOAD')
     A            W1YY           4S 0       COLHDG('年份')
     A            W1MM           2S 0       COLHDG('月份')
     A            W1FACT         1A         COLHDG('廠區')
     A            W1CUNO         6A         COLHDG('客戶代號')
     A            W1CUNM        10O         COLHDG('客戶名稱')
     A            W1ORNO         6A         COLHDG('訂單號碼')
0409AA            W1PDNM         2A         COLHDG('產品別')
     A            W1DATS         8S 0       COLHDG('銷售起日')
     A            W1DATE         8S 0       COLHDG('銷售止日')
     A            W1QTY          7P 0       COLHDG('銷售量')
     A            W1AMT         11P 0       COLHDG('銷貨金額')
     A            W1QTYA         7P 0       COLHDG('退貨量')
     A            W1AMTA        11P 0       COLHDG('退貨金額')
     A            W1AR06        11P 0       COLHDG('折讓金額')
     A*
     A          K W1YY
     A          K W1MM
     A          K W1FACT
     A          K W1CUNO
     A          K W1ORNO
