     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR001G
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     請款發票列印LOG檔
     A*            5.DATE-WRITTEN  112/09/20  2023AR00042
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A*                                     UNIQUE
     A          R RAR001G                   TEXT('請款發票LOG檔')
     A            AGAPNO         6A         COLHDG('請款單號')
     A            AGINNO        10A         COLHDG('發票號碼')
     A            AGAREA         1A         COLHDG('廠區')
     A            AGPTDD         8S 0       COLHDG('列印日期')
     A            AGPTDT         6S 0       COLHDG('列印時間')
     A            AGPTSR        10A         COLHDG('列印人員')
     A            AGBUMD         1A         COLHDG('營業單位')
     A*
     A          K AGAPNO
     A          K AGINNO
