     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR008S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02LBU
     A*            4.FUNCTION     外銷應收帳款明細表
     A*            5.DATE-WRITTEN  96/01/26
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A*================================================================
     A          R AR008F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 70'ARR008S'
     A                                  1 24'東和鋼鐵企業股份有限公司'
     A                                  2 29'應收帳款明細表'
     A            S#DEVN        10A  O  2 70
     A*
     A                                  8 28'客戶編號:'
     A            S#CUNS         6A  B  8 40
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  8 47'-'
     A            S#CUNE         6A  B  8 49
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A*
     A                                 10 28'部門別：'
     A            S#DPNO         4A  B 10 40
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A*
     A            S#ERR         70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A*****************************************************************
