     A*%%TS  SD  19821104  090038  JEFF        REL-V2R1M1  5738-PW1
     A*       UPDATE  DATE  99/10/11  2010AR530  S00WCJ (9910A)
     A*                    104/05/18  S00WCJ (0405A)
     A*                     廠區改為由USER自行輸入
     A************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19821104  090038  JEFF        REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR039S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'も出貨日報表（代傳票）も'
     A            DEVNM         10A  O  2 70
     A                                  7 24'地　區：'
0405AA            AREA           1A  B  7 35
0405AA                                      VALUES('U' 'K')
     A                                  9 24'日期起：'
     A            DATEF          8Y 0B  9 35EDTCDE(Z)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                 11 24'　　迄：'
     A            DATET          8Y 0B 11 35EDTCDE(Z)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
9910AA                                 13 24'產品別：'
9910AA            S#PROC         1   B    +1VALUES('1' '2')
9910AA                                    +1'("1=鋼胚 2=鋼筋")'
9910AA                                 15 22'內外銷別：'
9910AA            S#SALE         1   B    +1VALUES('1' '2')
9910AA                                    +1'("1=內銷 2=外銷")'
     A*                                15 24'出貨別：'
     A*           TYPE           1A  B 15 35
     A* 43                                  DSPATR(RI)
     A* 43                                  DSPATR(PC)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A*                                13 38'(1:鋼筋'
     A*                                14 39'2:型鋼)'
