     A*%%***********************************************************************
     A*%%TS  RD  19910617  164911  S02YSH      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR094T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     進倉履約折讓自動處理-呈核表
     A*           4.DATE-WRITTEN  91/02/25
     A*           5.WRITER        S02YSH
     A*
     A*
     A*****************************************************************
     A          R AR094TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A                                     2
     A                                      '報表代號: ARR094T'
     A                                    52
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   110
     A                                      '列表日期:'
     A                                   122
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '列表人員:'
     A                                      SPACEB(001)
     A            T#USID        10        +1
     A                                    52
     A                                      '銷貨折讓自動處理-呈核表'
     A                                   110
     A                                      '列表時間:'
     A                                   122
     A                                      TIME
     A                                     2
     A                                      '業務代號:'
     A                                      SPACEB(001)
     A            T#SAID         2        14
     A            T#SANM        10        +2
     A                                   110
     A                                      '頁　　次:'
     A                                   122
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '處理年月:'
     A                                      SPACEB(001)
     A            T#YYMM         6  0     14
     A                                      EDTWRD('    /  ')
     A                                    +5
     A                                      '第'
     A            T#CONT         3  0     +0
     A                                      EDTCDE(4)
     A                                    +0
     A                                      '次處理'
     A            T#LIN1       132         1
     A                                      SPACEB(001)
     A                                     2
     A                                      '客戶代號'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '客戶簡稱'
     A                                    +1
     A                                      '廠區'
     A                                    +1
     A                                      '訂單號碼'
     A                                    42
     A                                      '單價'
     A                                    49
     A                                      '發票開立量'
     A                                    64
     A                                      '發票金額'
     A                                    +2
     A                                      '繳款金額'
     A                                    +1
     A                                      '其他折讓金額'
     A                                    +1
     A                                      '折讓單價'
     A                                   113
     A                                      '折讓金額'
     A                                   123
     A                                      '折讓方式'
     A            T#LIN2       132         1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR094T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A N60        T#CUNO         6         4
     A N60        T#CUNM        10        +3
     A            T#AREA         1        26
     A            T#ORNO         6        33
     A            T#UNPR         5  3     42
     A                                      EDTCDE(1)
     A            T#QTY1         7  0     51
     A                                      EDTCDE(1)
     A            T#AMT1         9  0     62
     A                                      EDTCDE(1)
     A            T#AMT3         9  0     +1
     A                                      EDTCDE(1)
     A            T#AMT2         9  0     +4
     A                                      EDTCDE(1)
     A            T#AMT4         4  3     +4
     A                                      EDTCDE(2)
     A            T#AMT5         9  0     +2
     A                                      EDTCDE(2)
     A            T#COD1         6        +3
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR094T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#PROD         3        37
     A                                      SPACEB(001)
     A            T#QTYX         8  0     50
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR094T3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    33
     A                                      '廠區小計:'
     A                                      SPACEB(001)
     A            T#3TY1         8  0     51
     A                                      EDTCDE(1)
     A            T#3MT1         9  0     62
     A                                      EDTCDE(1)
     A            T#3MT3         9  0     74
     A                                      EDTCDE(1)
     A            T#3MT2         9  0     89
     A                                      EDTCDE(1)
     A            T#3MT5         9  0    111
     A                                      EDTCDE(2)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR094TM
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 046
     A*%%***********************************************************************
     A                                      SKIPB(062)
     A                                    50
     A                                      '核准：'
     A            T#NAM1        14        59
     A                                      UNDERLINE
     A                                    78
     A                                      '覆核：'
     A            T#NAM2        14        +1
     A                                      UNDERLINE
     A                                    +5
     A                                      '製表：'
     A            T#NAM3        14        +1
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR094TR
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 009
     A*%%***********************************************************************
     A                                      SKIPB(010)
     A                                    46
     A                                      '查無區間內資料'
     A*%%***********************************************************************
     A*%%SS
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARE050T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       200      *N     )
     A*%%***********************************************************************
