     A*%%***********************************************************************
     A*%%TS  RD  19920627  134614  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR072T1
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     客戶別各廠成品出貨數明細表
     A*           4.WRITER        S02CSF
     A*           5.DATE-WRITTEN  92/06/27
     A*           6.DATE-MODIFY
     A*
     A*
     A*****************************************************************
     A          R AR072T1H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報表代號: ARR072T1'
     A                                    57
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   121
     A                                      '列表日期:'
     A                                   132
     A                                      DATE
0212AA                                      EDTWRD('01  /  /  ')
     A                                     2
     A                                      '列表人員:'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
     A                                    55
     A                                      '客戶別各廠成品出貨數量明細表'
     A                                   121
     A                                      '列表時間:'
     A                                   132
     A                                      TIME
     A                                     2
     A                                      '客戶代號:'
     A                                      SPACEB(001)
     A            R#CUNO         6A  O    14
     A                                   121
     A                                      '頁　　次:'
     A            R#PGNO         4S 0O   132
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '客戶名稱:'
     A                                      SPACEB(001)
     A            R#CUNM        10A  O    13
     A                                   121
     A                                      '單  位:  KG'
     A                                     2
     A                                      '內外銷別:'
     A                                      SPACEB(001)
     A            R#COD1         8A  O    13
     A                                     2
     A                                      '成品大類:'
     A                                      SPACEB(001)
     A            R#PDNM        24A  O    13
     A*----------------------------------------------------------------
     A                                    28
     A                                      '苗　栗　廠'
     A                                      SPACEB(001)
     A                                    74
     A                                      '高　雄　廠'
     A                                   120
     A                                      '總　　　計'
     A                                    28
     A                                      '------------'
     A                                      SPACEB(001)
     A                                    74
     A                                      '------------'
     A                                   120
     A                                      '------------'
     A                                     2
     A                                      '出貨年月'
     A                                      SPACEB(001)
     A                                    16
     A                                      '出貨數量'
     A                                    28
     A                                      '平均單價'
     A                                    43
     A                                      '出貨金額'
     A                                    61
     A                                      '出貨數量'
     A                                    74
     A                                      '平均單價'
     A                                    89
     A                                      '出貨金額'
     A                                   108
     A                                      '出貨數量'
     A                                   120
     A                                      '平均單價'
     A                                   135
     A                                      '出貨金額'
     A                                     2
     A                                      '--------'
     A                                      SPACEB(001)
     A                                    15
     A                                      '-----------------------------------
     A                                      -----'
     A                                    61
     A                                      '-----------------------------------
     A                                      -----'
     A                                   107
     A                                      '-----------------------------------
     A                                      -----'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL+001
     A*%%CL+
     A*%%CL            13:1
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR072T1D
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            R#YYMM         6  0O     4
     A                                      EDTCDE(4)
     A                                      SPACEB(001)
     A            R#QTYH         8  0O    16
     A                                      EDTCDE(1)
     A            R#PRCH         5  3O    30
     A                                      EDTCDE(1)
     A            R#AMTH        10  0O    39
     A                                      EDTCDE(1)
     A            R#QTYK         8  0O    61
     A                                      EDTCDE(1)
     A            R#PRCK         5  3O    76
     A                                      EDTCDE(1)
     A            R#AMTK        10  0O    85
     A                                      EDTCDE(1)
     A            R#QTY         10  0O   105
     A                                      EDTCDE(1)
     A            R#PRC          5  3O   122
     A                                      EDTCDE(1)
     A            R#AMT         12  0O   129
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR072T1T
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     2
     A                                      '合　　計:'
     A                                      SPACEB(002)
     A            R#TQTH        10  0O    13
     A                                      EDTCDE(1)
     A            R#TPRH         5  3O    30
     A                                      EDTCDE(1)
     A            R#TAMH        12  0O    37
     A                                      EDTCDE(1)
     A            R#TQTK        10  0O    58
     A                                      EDTCDE(1)
     A            R#TPRK         5  3O    76
     A                                      EDTCDE(1)
     A            R#TAMK        12  0O    83
     A                                      EDTCDE(1)
     A            R#TQTY        10  0O   105
     A                                      EDTCDE(1)
     A            R#TPRC         5  3O   122
     A                                      EDTCDE(1)
     A            R#TAMT        12  0O   129
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR072T1M
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SPACEB(003)
     A                                      SPACEA(002)
     A                                    19
     A                                      '*****無條件符合之資料！！'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARR072T#)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       200      *N     )
     A*%%***********************************************************************
     A**************************************************************************
