     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR080RS
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CLJ
     A*            4.FUNCTION     發票與銷貨金額差異表－畫面
     A*            5.DATE-WRITTEN  88/07/22
     A*
     A***************************************************************
     A*  畫面一:
     A*
     A*        記錄格式 AR080F1
     A***************************************************************
     A          R AR080F1
     A                                      CF03(03)
     A                                      CF12(12)
     A*---------------------------------------------------------------
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR080S'
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 29'★發票與銷貨金額差異★'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A*---------------------------------------------------------------
     A                                  8 21'請輸入統計廠區:'
     A            S#AREA         1A  B  8 40VALUES('P' 'M' 'T' 'H' 'K' ' ')
     A                                  8 43'(P台北, M台中, T桃園,'
     A                                  9 44' H苗栗, K高雄, 空白＝全公司)'
     A                                 11 21'請輸入統計年月:'
     A            S#YYMM         6Y 0B 11 40EDTCDE(4)
     A*---------------------------------------------------------------
     A                                 22  5'F3:結束'
     A                                 22 19'F12:回前'
     A                                 22 34'ENTER:執行'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
