     A************************************************************
     A*                                                          *
     A*         PROGRAM   ID        :   ARR032S                  *
     A*         PROGRAM   FUNCTION  :  銷項統一發票明細表列印  *
     A*         AUTHER              :   ANNCY                    *
     A*         CREATE    DATE      :   81/09/24                 *
     A*         MAINTAIN  DATE      :                            *
     A*         RELATION  PROGRAM   :   ARR032P                  *
     A*         NOTE                :                            *
     A*                                                          *
     A************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR032S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'も銷項統一發票明細表列印も'
     A            DEVNM         10A  O  2 70
     A                               O  4 31'   ***請輸入***'
     A                                  6 28'廠區:'
     A            AREA           1   B    +1
     A  41                                  DSPATR(RI PC)
     A                                    +1'(P:台北M:台中K:高雄)'
     A                                  8 28'聯式:'
     A            KIND           1   B    +1
     A  42                                  DSPATR(RI PC)
     A                                    +1'(2:二聯式3:三聯式)'
     A                                 10 28'年月:'
     A            YM             6Y 0B    +1DSPATR(MDT)
     A  43                                  DSPATR(RI PC)
     A                                      EDTCDE(Z)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
