     A          R WFREC                     TEXT('訂單別出貨發票表')
     A            WFORNO         6A         COLHDG('訂單號碼')
     A            WFDATE         8S 0       COLHDG('日期')
     A            WFWTNO         8A         COLHDG('磅單編號')
     A            WFPDNM         3A         COLHDG('品名')
     A            WFQULT         8A         COLHDG('材質')
     A            WFSPE1         5A         COLHDG('徑度')
     A            WFQTY          7P 0       COLHDG('出貨數量')
     A            WFIVNO        10A         COLHDG('發票號碼')
     A            WFIVAM        11P 0       COLHDG('出貨金額')
     A            WFAR06        11P 0       COLHDG('折退金額')
     A            WFPRRV        11P 0       COLHDG('預收款')
     A            WFIVTX        11P 0       COLHDG('稅額')
     A            WFIVAR        11P 0       COLHDG('發票餘額')
     A            WFAPNO         6A         COLHDG('繳款單號')
     A            WFCUNO         6A         COLHDG('客戶單號')
     A*
     A          K WFORNO
     A          K WFDATE
     A          K WFWTNO
     A          K WFPDNM
     A          K WFQULT
     A          K WFSPE1
