     A*%%***********************************************************************
     A*%%TS  RD  19920220  170937  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR087T
     A*            2.PROGRAM-TYPE  PRTF
     A*            3.AUTHOR        S02HYS
     A*            4.FUNCTION     專案退稅明細表
     A*            5.DATE-WRITTEN  89/05/03
     A*            6.DATE-MODIFY   89/05/03
     A*
     A*****************************************************************
     A          R ARR087H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A                                     2
     A                                      ' RPT - ID : ARR087T'
     A                                    90
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   176
     A                                      '印表日期:'
     A                                   188
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '歸屬年月:'
     A                                      SPACEB(001)
     A            T#YYMM         4        +1
     A                                    +1
     A                                      '至'
     A            T#YYM1         4        +1
     A                                    95
     A                                      '專案退稅明細表'
     A                                   176
     A                                      '頁　　數:'
     A                                   188
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1       195         2
     A                                      SPACEB(001)
     A                                    48
     A                                      '合約'
     A                                      SPACEB(001)
     A                                    55
     A                                      '發票'
     A                                    64
     A                                      '作廢'
     A                                    91
     A                                      '扣預收'
     A                                   146
     A                                      '發票'
     A                                   155
     A                                      '重開'
     A                                     2
     A                                      '統一編號'
     A                                      SPACEB(001)
     A                                    +7
     A                                      '客戶名稱'
     A                                    48
     A                                      '號碼'
     A                                    55
     A                                      '日期'
     A                                    62
     A                                      '發票號碼'
     A                                    72
     A                                      '索編'
     A                                    79
     A                                      '銷貨收入'
     A                                    92
     A                                      '貨款'
     A                                   104
     A                                      '銷售額'
     A                                   118
     A                                      '稅額'
     A                                   130
     A                                      '總計'
     A                                   136
     A                                      '單據編號'
     A                                   146
     A                                      '日期'
     A                                   153
     A                                      '發票號碼'
     A                                   165
     A                                      '發票金額'
     A                                   181
     A                                      '稅額'
     A                                   189
     A                                      '索編'
     A            T#LIN2       195         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R ARR0871
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#MUID         8         2
     A                                      SPACEB(001)
     A            T#CUNM        36        11
     A            T#ORNO         6        48
     A N97        T#INDT         6  0     55
     A*                                     EDTCDE(K)
     A N97        T#INNO        10        62
     A N97                                73
     A                                      'A'
     A N97        T#NNNO         3  0     74
     A N97        T#AAMT         8  0     78
     A                                      EDTCDE(K)
     A N97        T#BAMT         8  0     90
     A                                      EDTCDE(1)
     A N97        T##AMT         8  0    101
     A                                      EDTCDE(K)
     A N97        T#ATAX         8  0    113
     A                                      EDTCDE(K)
     A N97        T#AATT         8  0    125
     A                                      EDTCDE(K)
     A            T#VNNO         8       137
     A N96        T#ENDT         6  0    146
     A*                                     EDTCDE(K)
     A            T#SNNO        10       153
     A            T#NAMT         8  0    164
     A                                      EDTCDE(K)
     A            T#NTAX         8  0    176
     A                                      EDTCDE(K)
     A                                   190
     A                                      'B'
     A            T#NNN1         3  0    191
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R ARR0872
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    61
     A                                      '合約編號小計'
     A                                      SPACEB(001)
     A            T#AAM1         9  0     77
     A                                      EDTCDE(K)
     A            T#BAM1         9  0     89
     A                                      EDTCDE(1)
     A            T##AM1         9  0    100
     A                                      EDTCDE(K)
     A            T#ATA1         9  0    112
     A                                      EDTCDE(K)
     A            T#AAT1         9  0    124
     A                                      EDTCDE(K)
     A            T#NAM1         9  0    163
     A                                      EDTCDE(K)
     A            T#NTA1         9  0    175
     A                                      EDTCDE(K)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************
     A          R ARR0873
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A
     A                                    63
     A                                      '客戶別合計'
     A                                      SPACEB(001)
     A            T#AAM2         9  0     77
     A                                      EDTCDE(K)
     A            T#BAM2         9  0     89
     A                                      EDTCDE(1)
     A            T##AM2         9  0    100
     A                                      EDTCDE(K)
     A            T#ATA2         9  0    112
     A                                      EDTCDE(K)
     A            T#AAT2         9  0    124
     A                                      EDTCDE(K)
     A            T#NAM2         9  0    163
     A                                      EDTCDE(K)
     A            T#NTA2         9  0    175
     A                                      EDTCDE(K)
     A            T#LIN3       195         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************
     A          R ARR0874
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    65
     A                                      '總計'
     A                                      SPACEB(001)
     A            T#AAM3        11  0     71
     A                                      EDTCDE(K)
     A            T#BAM3        11  0     86
     A                                      EDTCDE(1)
     A            T##AM3        11  0    100
     A                                      EDTCDE(K)
     A            T#ATA3        11  0    115
     A                                      EDTCDE(K)
     A            T#AAT3        11  0    130
     A                                      EDTCDE(K)
     A            T#LIN4       195         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R ARR0875
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#CUN4         7        56
     A                                      SPACEB(001)
     A                                    64
     A                                      '月份總計'
     A            T#AAM4        11  0     74
     A                                      EDTCDE(K)
     A            T#BAM4        11  0     89
     A                                      EDTCDE(1)
     A            T##AM4        11  0    103
     A                                      EDTCDE(K)
     A            T#ATA4        11  0    118
     A                                      EDTCDE(K)
     A            T#AAT4        11  0    133
     A                                      EDTCDE(K)
     A            T#LIN5       195         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R ARR0876
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*單月
     A            T#CUN5         4  0     59
     A                                      SPACEB(001)
     A                                    64
     A                                      '月份總計'
     A            T#AAM5        11  0     74
     A                                      EDTCDE(K)
     A            T#BAM5        11  0     89
     A                                      EDTCDE(1)
     A            T##AM5        11  0    103
     A                                      EDTCDE(K)
     A            T#ATA5        11  0    118
     A                                      EDTCDE(K)
     A            T#AAT5        11  0    133
     A                                      EDTCDE(K)
     A            T#LIN6       195         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R ARR0877
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*訊息
     A                                    67
     A                                      '輸入區段'
     A                                      SPACEB(001)
     A            T#YYM1         4        78
     A                                    83
     A                                      '至'
     A            T#YYM2         4        88
     A                                    93
     A                                      '抱歉該區段無資料! '
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R ARR087A
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
0519 A*發票年月
     A N94                                74
     A                                      '銷貨收入'
     A                                      SPACEB(001)
     A N94                                89
     A                                      '扣預收貨款'
     A N94                               105
     A                                      '銷售額'
     A N94                               123
     A                                      '稅額'
     A N94                               137
     A                                      '總計'
     A N94                               150
     A                                      '張數'
     A            T#CUNC         2  0     48
     A                                      SPACEB(001)
     A            T#CUND         2  0     50
     A                                    52
     A                                      '-'
     A            T#CUNA         2  0     53
     A            T#CUNB         2  0     55
     A                                    57
     A                                      '作廢發票合計'
     A            T#AAMA        11  0     71
     A                                      EDTCDE(K)
     A            T#BAMA        11  0     86
     A                                      EDTCDE(1)
     A            T##AMA        11  0    100
     A                                      EDTCDE(K)
     A            T#ATAA        11  0    115
     A                                      EDTCDE(K)
     A            T#AATA        11  0    130
     A                                      EDTCDE(K)
     A            T#CUNT         3  0    151
     A                                      EDTCDE(1)
     A            T#LIN7       195         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARR087T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       198      *N     )
     A*%%***********************************************************************
