     A*%%TS  SD  19811212  090105  VIN         REL-V2R1M1  5738-PW1
     A************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19811212  090105  VIN         REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR051S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'も折讓開立簽回明細表も'
     A            DEVNM         10A  O  2 70
     A                                  5 24'開立廠區：'
     A            AREA           1A  B  5 37
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  5 43'(" ":全部'
     A                                  6 44'"P":台北'
     A                                  7 44'"T":桃園'
     A                                  8 44'"K":高雄'
     A                                  9 44'"M":台中)'
     A                                 10 44'"H":苗栗)'
     A                                 12 24'簽回日期：'
     A            DATE1          8Y 0B 12 37EDTWRD('    /  /  ')
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 12 48'-'
     A            DATE2          8Y 0B 12 50EDTWRD('    /  /  ')
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A*
     A                                 14 24'訂單編號：'
     A            ORNO           6A  B 14 37
     A                                 14 44'(空白=全部)'
     A                                 16 24'客戶代號：'
     A            CUNO           6A  B 16 37
     A                                 16 44'(空白=全部)'
     A                                 18 24'業務代號：'
     A            SALE           2A  B 18 37
     A                                 18 44'(空白=全部)'
     A*
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
