     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR063TP
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     發票列印分類檢核表
     A*           4.DATE-WRITTEN  85/05/17
     A*
     A*****************************************************************
     A          R HEADP                     SKIPB(3)
     A                                     2' PRT-ID   : ARR063T'
     A                                    46'東和鋼鐵企業股份有限公司'
     A                                    91'印表日期:'
     A                                   102DATE EDTCDE(Y)
     A                                      SPACEA(1)
     A                                     2'發票廠區:'
     A            R#AREA         1A       +1
     A            R#ARNM         6A       +1
     A                                    49'發票列印分類檢核表'
     A                                    91'時　　間:'
     A                                   102TIME
     A                                      SPACEA(001)
     A                                    91'頁　　數:'
     A                                   102PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     2'發票號碼'
     A                                    16'發票日期'
     A                                    28'類別'
     A                                    36'聯式'
     A                                    44'客戶編號'
     A                                    56'客戶名稱'
     A                                    69'訂單號碼'
     A                                    82'開立廠區'
     A                                    96'業務員代號'
     A                                      SPACEA(1)
     A                                     2'------------'
     A                                    16'----------'
     A                                    28'------'
     A                                    36'------'
     A                                    44'----------'
     A                                    56'----------'
     A                                    69'----------'
     A                                    82'----------'
     A                                    96'--------------'
     A                                      SPACEA(1)
     A          R DATAP
     A            CUNO          10A        3
     A            CUINDT         6  0     17
     A                                      EDTCDE(Y)
     A            CUTYPE         1A       30
     A            CUKIND         1A       38
     A            CUCUNO         6A       46
     A            CUCUNM        10O       56
     A            CUORNO         5A       72
     A            CUINEA         1A       84
     A            C#ARNM         6A       85
     A            CURVID         2A       97
     A            SANAME        10O       99
     A                                      SPACEA(1)
     A**************************************************************************
     A          R TOTALP
     A**************************************************************************
     A                                    86'發票總計：'
     A            R#SUM          9  0     98
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
