     A*%%TS  SD  19910925  142751  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*             >>  PROGRAM INTRODUCTION  <<
     A*
     A*           1.PROGRAM-ID       ARR097SX
     A*           2.PROGRAM-TYPE     DSPF
     A*           3.AUTHOR           S02LBU
     A*           4.FUNCTION        應收帳款明細表（查帳用）
     A*           5.DATE-WRITTEN     91/09/03
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '離開')
     A                                      CA12(12 '離開')
     A*================================================================
     A          R AR097F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR097S'
     A                                  2  2TIME
     A                                  2 24'應收帳款明細表（查帳用）'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3 70
     A*
     A                                 10 24'客戶代號：'
     A            S#CUNO         6A  B 10 38
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 10 50'(空白表全部)'
     A*
     A                                 12 24'訂單編號：'
     A            S#ORNO         6A  B 12 38
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 12 50'(空白表全部)'
     A*
     A                                 14 24'統計年月：'
     A            S#YYMM         6Y 0B 14 38EDTWRD('    /  ')
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 23  2'F3/F12 =離開'
     A            S#ERR         70A  O 24  2DSPATR(HI)
