     A                                      UNIQUE
     A          R RARR001N                  TEXT('請款單暫時檔')
     A            ANFLAG         1A         COLHDG('下傳旗標')
     A            ANCODE         1A         COLHDG(' ACD碼')
     A            ANCUNO         6A         COLHDG('客戶編號')
     A            ANORNO         6A         COLHDG('訂單號碼1')
     A            ANAPNO         6A         COLHDG('請款單號')
     A            ANAPIT         3S 0       COLHDG('請款項次')
     A            ANAPDT        10A         COLHDG('請款日期')
     A            ANSALE         2A         COLHDG('收款業務')
     A            ANINNO        10A         COLHDG('發票號碼')
     A            ANINDT        10A         COLHDG('發票日期')
     A            ANWTNO         8A         COLHDG('磅單號碼')
     A            ANQTY          7P 0       COLHDG('出貨數量')
     A            ANAAMT         8P 0       COLHDG('出貨金額')
     A            ANBAMT         7P 0       COLHDG('折退金額')
     A            ANCAMT         8P 0       COLHDG('預收金額')
     A            ANDAMT         7P 0       COLHDG('銷項稅額')
     A            ANEAMT         8P 0       COLHDG('請款金額')
     A            ANRCNO         6A         COLHDG('繳款單號')
     A            ANORN1         6A         COLHDG('訂單號碼2')
     A*
     A          K ANAPNO
     A          K ANAPIT
