     A*%%***********************************************************************
     A*%%TS  RD  19910620  142158  S02YSH      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR096T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     訂單別記帳出貨明細表
     A*           4.DATE-WRITTEN  91/06/20
     A*           5.WRITER        S02YSH
     A*
     A*****************************************************************
     A          R AR096TH
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      ' PRT-ID  : ARR096T'
     A                                    41
     A                                      '東和鋼鐵企業股份有限公司'
     A                                    87
     A                                      '列表日期:'
     A                                    98
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '客戶代號:'
     A                                      SPACEB(001)
     A            T#CUNO         6A       +1
     A            T#CUNM        10A       +1
     A                                    43
     A                                      '訂單別記帳出貨明細表'
     A                                    87
     A                                      '列表時間:'
     A                                    98
     A                                      TIME
     A                                     2
     A                                      '訂單號碼:'
     A                                      SPACEB(001)
     A            T#ORNO         6A       +1
     A                                    87
     A                                      '頁　　次:'
     A                                    98
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
     A                                      '出貨日期:'
     A                                      SPACEB(001)
     A            T#DATS         6  0     +1
     A                                      EDTCDE(Y)
     A                                    +1
     A                                      '~'
     A            T#DATE         6  0     +1
     A                                      EDTCDE(Y)
     A            T#LIN1       108         1
     A                                      SPACEB(001)
     A                                     3
     A                                      '磅單號碼'
     A                                      SPACEB(001)
     A                                    18
     A                                      '出貨日期'
     A                                    37
     A                                      '品　　名'
     A                                    57
     A                                      '支數'
     A                                    70
     A                                      '重　量'
     A                                    81
     A                                      '單價'
     A                                    93
     A                                      '發票號碼'
     A            T#LIN2       108         1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR096T1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     1
     A                                      ' '
     A                                      SPACEB(001)
     A N40        T#WTNO         8         4
     A N40        T#WTDT         6  0     19
     A                                      EDTCDE(Y)
     A            T#H            3        34
     A                                    +1
     A                                      'X'
     A            T#B            3        40
     A            T#LENG         4  2     45
     A                                      EDTCDE(1)
     A                                    50
     A                                      'M'
     A            T#SPEC         6  0     55
     A                                      EDTCDE(1)
     A            T#WGHT         9  0     66
     A                                      EDTCDE(1)
     A            T#UPRC         5  3     81
     A                                      EDTCDE(1)
     A            T#INNO        10        93
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR096T2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    42
     A                                      '日小計:'
     A                                      SPACEB(001)
     A            T#SPE1         6S 0     55
     A                                      EDTCDE(1)
     A            T#WGH1         9S 0     66
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR096T3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    40
     A                                      '總　　計:'
     A                                      SPACEB(001)
     A            T#SPE2         9S 0     51
     A                                      EDTCDE(1)
     A            T#WGH2        12S 0     62
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARP079T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       222      *N     )
     A*%%***********************************************************************
