     A*%%TS  SD  19890920  150752  S02YSH      REL-V3R7M0  5716-PW1
     A*%%EC
     A****************************************************************
     A*
     A*        UPDATE  DATE  99/12/01  2010AR555 S00WCJ (9912A)
     A*                     112/05/03  2023AR00022 S00WCJ (1205A)
     A*                      新增N廠選項
     A*
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19890920  150752  S02YSH      REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR035S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 26'もも當月開立發票明細表もも'
     A            DEVNM         10A  O  2 70
     A                                  7 26'廠別:'
     A            W0100          1A  B  7 34
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
9912AA*                                 7 38'( P:台北林口桃園苗栗'
9912AA                                  7 38'( P:台北林口八德桃+
9912AA                                      園苗栗'
1205AA                                  8 38'  M:台中 K:高雄N:大業)'
     A                                 10 26'年月:'
     A            W0101          6Y 0B 10 34EDTCDE(Z)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 13 22'報表種類:'
     A            S#OPT          1A  B 13 34VALUES('1' '2' '3')
     A                                 13 36'( 1 :自動代開發票'
     A                                 14 36'  2 :人工開立發票'
     A                                 15 36'  3 :所有發票)'
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
