     A                                      UNIQUE
     A          R ARREC                     TEXT('請款單暫時檔')
     A            ARINNO        10A         COLHDG('發票號碼')
     A            ARINDT         8S 0       COLHDG('發票日期')
     A            ARORNO         6A         COLHDG('訂單號碼')
     A            ARNO           6A         COLHDG('折讓單號')
     A            ARWTNO         8A         COLHDG('磅單號碼')
     A            ARQTY          7P 0       COLHDG('出貨數量')
     A            ARAAMT         9P 0       COLHDG('出貨金額')
     A            ARBAMT         7P 0       COLHDG('折退金額')
     A            ARCAMT         8P 0       COLHDG('預收金額')
     A            ARDAMT         8P 0       COLHDG('銷項稅額')
     A            AREAMT         9P 0       COLHDG('請款金額')
     A            ARPLE1        40O         COLHDG('工地地點')
     A*
     A          K ARINNO
     A          K ARWTNO
