     A*%%TS  SD  19910124  142320  S02LYW      REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19910124  142320  S02LYW      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR008S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 28'もも　應收帳款明細表　もも'
     A            DEVNM         10A  O  2 70
     A                                  8 28'客戶編號:'
     A            CUST1          6A  B  8 40
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  8 47'-'
     A            CUST2          6A  B  8 49
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 10 28'單位別：'
     A            S#DPNO         4A  B 10 40
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A            ERRMSG        70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
