     A*%%TS  SD  19811014  084704  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R TITLE
     A*%%TS  SD  19811014  084704  VIN         REL-V2R1M1  5738-PW1
     A                                      OVERLAY
     A                                      CF03(03)
     A                                  1 70'ARR007S'
     A            COMP          35A  O  1 23
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  2 26'もも電子計算機統一發票もも'
     A            DEVNM         10A  O  2 70
     A                                  8 28'發票日期:'
     A            W0101          8Y 0B  8 40EDTWRD('    /  /  ')
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            ERRMSG        60O  O 20 19
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
