     A*%%TS  SD  19930416  170803  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR098S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     自製出貨明細表
     A*            5.DATE-WRITTEN  91/09/24
     A*            6.DATE-UPDATED
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR098F1
     A*%%TS  SD  19930416  170803  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARR098S'
     A                                  2  2TIME
     A                                  2 31'★自製出貨明細表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  8 28'廠　　區: '
     A            S#AREA         1A  B  8 42
     A  25                                  DSPATR(PC)
     A  25                                  DSPATR(RI)
     A                                 10 28'入帳年日:'
     A            S#YYMM         8Y 0B 10 42EDTWRD('    /  /  ')
     A  26                                  DSPATR(PC)
     A  26                                  DSPATR(RI)
     A                                 10 53' ~ '
     A            S#YYM1         8Y 0B 10 57EDTWRD('    /  /  ')
     A  27                                  DSPATR(PC)
     A  27                                  DSPATR(RI)
     A                                 12 28'品　　名: '
     A            S#PDNM         1A  B 12 42
     A  28                                  DSPATR(PC)
     A  28                                  DSPATR(RI)
     A                                 12 44'(2:鋼筋(含鋼胚)'
     A                                 13 44' 3:型鋼 '
     A                                 14 44' 4:鋼板 '
     A                                 15 44' 5:槽鋼 '
     A                                 16 44'空白表示全部)'
     A                                 18 28'列印時是否包含銷貨明細表'
     A                                 19 28'與外構成品出貨明細表:'
     A            S#OPT          1A  B 19 52
     A  29                                  DSPATR(PC)
     A  29                                  DSPATR(RI)
     A                                 23  3'PF3=結束作業'
     A                                 23 20'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
