     A*%%TS  SD  19920304  173346  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR110S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     應收帳款發票異常檢核表
     A*            5.DATE-WRITTEN  92/03/04
     A*            6.DATE-MODIFY
     A*
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR110F1
     A*%%TS  SD  19920304  173346  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 26'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR110S'
     A                                  2  2TIME
     A                                  2 27'應收帳款發票異常檢核表'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                 10 29'應收帳款逾'
     A            S#DATE         3Y 0B 10 42EDTCDE(4)
     A                                 10 46'天'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
