     A*%%TS  SD  19940722  095827  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR119S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     折讓單開立統計表
     A*            5.DATE-WRITTEN  94/07/22
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR119F1
     A*%%TS  SD  19940722  095827  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 28'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR119S'
     A                                  2  2TIME
     A                                  2 30'★折讓單開立統計表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USID        10A  O  3  2
     A                                  7 24'廠　　區:'
     A            S#AREA         1A  B  7 36
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                  7 38'(空白表全部)'
     A                                  9 24'客戶代號:'
     A            S#CUNO         6A  B  9 36
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                  9 43'(空白表全部)'
     A                                 11 24'開立日期:'
     A            S#DAT1         8Y 0B 11 36EDTWRD('    /  /  ')
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 11 47'~~'
     A            S#DAT2         8Y 0B 11 50EDTWRD('    /  /  ')
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 11 61'(空白表全部)'
     A                                 13 24'折讓種類:'
     A            S#ACNT         1A  B 13 36
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 13 38'(2:銷退3:折讓4:預收折讓空+
     A                                      白表全部)'
     A                                 15 24'折讓原因:'
     A            S#RESV         1A  B 15 36
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                 15 38'(1:磅差折讓3:價差折讓)'
     A                                 17 24'注意：折讓種類為3時，才需輸入+
     A                                      折讓原因'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
