     A*%%***********************************************************************
     A*%%TS  RD  19940811  153039  S02CSF      REL-V4R2M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR120T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.WRITER        S02CSF
     A*           4.FUNCTION     型鋼折讓資負同在查核明細表
     A*           5.DATE-WRITTEN  94/08/08
     A*           6.DATE-MODIFY
     A*
     A*
     A**************************************************************************
     A          R AR120T1H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報　　表：ARR120T'
     A                                    47
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   110
     A                                      '列表日期：'
     A                                   122
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR-ID ：'
     A                                      SPACEB(001)
     A            U#USID        10A  O    14
     A                                    46
     A                                      '型鋼折讓資負同在查核明細表'
     A                                   110
     A                                      '列表時間：'
     A                                   122
     A                                      TIME
     A                                     2
     A                                      '查帳年月：'
     A                                      SPACEB(001)
     A            T#YYMH         6  0O    14
     A                                      EDTWRD('    /  ')
     A                                   110
     A                                      '頁　　次：'
     A                                   122
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1       130         2
     A                                      SPACEB(001)
     A                                     4
     A                                      '客戶代號'
     A                                      SPACEB(001)
     A                                    16
     A                                      '客戶名稱'
     A                                    28
     A                                      '訂單編號'
     A                                    40
     A                                      '折讓年月'
     A                                    52
     A                                      '折讓單號'
     A                                    64
     A                                      '傳票號碼'
     A                                    77
     A                                      '發票號碼'
     A                                    90
     A                                      '折讓金額'
     A                                   104
     A                                      '折讓稅額'
     A                                   118
     A                                      '折讓總額'
     A            T#LIN2       130         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR120T1D
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A N50        T#CUNO         6         6
     A N50        T#CUNM        10        16
     A N51        T#ORNO         6        30
     A N52        T#YYMM         6  0     41
     A                                      EDTWRD('    /  ')
     A N52        T#TXNO         6        54
     A N52        T#VRNO         7        65
     A            T#INNO        10        77
     A            T#AMT1         7  0     92
     A                                      EDTCDE(1)
     A            T#TAX          6  0    104
     A                                      EDTCDE(1)
     A            T#AMT2         8  0    118
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR120T1S
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A                                    78
     A                                      '折讓單小計:'
     A                                      SPACEB(001)
     A            T#AM1S         7S 0     92
     A                                      EDTCDE(1)
     A            T#TAXS         6S 0    104
     A                                      EDTCDE(1)
     A            T#AM2S         8S 0    118
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR120T1T
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A            T#LIN3        55        76
     A                                      SPACEB(001)
     A                                    78
     A                                      '客戶合計:'
     A                                      SPACEB(001)
     A            T#AM1T         8S 0     91
     A                                      EDTCDE(1)
     A            T#TAXT         7S 0    102
     A                                      EDTCDE(1)
     A            T#AM2T         9S 0    117
     A                                      EDTCDE(1)
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL+001
     A*%%CL+                                                          XXXXXXXX
     A*%%CL     XXX
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR120T1A
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A                                    78
     A                                      '總　　計:'
     A                                      SPACEB(002)
     A            T#AM1A         8S 0     91
     A                                      EDTCDE(1)
     A            T#TAXA         7S 0    102
     A                                      EDTCDE(1)
     A            T#AM2A         9S 0    117
     A                                      EDTCDE(1)
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 001
     A*%%***********************************************************************
     A**************************************************************************
     A          R AR120T1M
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A**************************************************************************
     A                                    19
     A                                      '*****無符合條件之資料!!!'
     A                                      SPACEB(008)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 008
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARP079T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       222      *N     )
     A*%%***********************************************************************
     A
