     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR140F
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     銷貨查帳報告下載檔
     A*            5.DATE-WRITTEN  103/08/04  2014AR854
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A                                      UNIQUE
     A          R RAR140F                   TEXT('銷貨查帳報告下載檔')
     A            F4NUM          2  0       COLHDG('序號')
     A            F4DATE         8  0       COLHDG('磅單日期')
     A            F4TXNO         8          COLHDG('磅單號碼')
     A            F4PDNM         5          COLHDG('品名')
     A            F4QTY          7  0       COLHDG('數量')
     A            F4UPRC         5  3       COLHDG('單價')
     A            F4AMT         11  0       COLHDG('金額')
     A            F4ACDT         8  0       COLHDG('入帳日期')
     A            F4VUNO         8          COLHDG('傳票號碼')
     A            F4CUNM        10O         COLHDG('客戶名稱')
     A            F4IVNO        10A         COLHDG('發票號碼')
     A            F4TYPE         1A         COLHDG('區別碼')
     A*
     A*區別碼1為輸入起日資料
     A*區別碼2為輸入迄日資料
     A*
     A          K F4TYPE
     A          K F4NUM
     A          K F4DATE
     A          K F4TXNO
     A          K F4PDNM
