     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR115S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     銷貨調整通知單
     A*            5.DATE-WRITTEN  93/01/16
     A*            6.DATE-MODIFY   109/04/14 2020AR00017 S00WCJ (0904A)
     A*                             新增業務員篩選欄位
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR115F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 27'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR115S'
     A                                  2  2TIME
     A                                  2 32'銷貨調整通知單'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  9 23'調整單開立日期：'
     A            S#DAT1         8Y 0B  9 42EDTWRD('    /  /  ')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                  9 53'~~'
     A            S#DAT2         8Y 0B  9 56EDTWRD('    /  /  ')
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 11 23'調整單開立廠區：'
     A            S#AREA         1A  B 11 42VALUES('P' 'T' 'M' 'K' 'H')
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 13 29'調整單號：'
     A            S#NO1          6A  B 13 42
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 13 49 '~'
     A            S#NO2          6A  B 13 51
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 13 58'(空白表示全部)'
0904AA                                 15 29'  業務員：'
0904AA            S#SALE         1A  B    +1
0904AA                                    +1'(空白表示全部)'
     A*
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
