     A*%%TS  SD  19921126  100521  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR101S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     應收帳款承購(E-FACTORING)發票異常檢核表
     A*            5.DATE-WRITTEN  91/10/21
     A*            6.DATE-MODIFY   91/11/19   BY S02CSF
     A*                            91/11/25   BY S02CSF
     A*                            92/03/10   BY S02CSF
     A*                            92/11/26   BY S02CSF
     A*           加入已開發票未做承購
 9111A*           加入已開請款單未做承購以及空白表全部
 9112A*           合併已承購未請款，已請款未繳款之欄位
 9203A*           新增發票開立廠區
 9211A*           新增業務員別
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR101F1
     A*%%TS  SD  19921126  100521  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARR101S'
     A                                  2  2TIME
     A                                  2 27'應收帳款承購發票異常檢核表'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  7 22'發票開立廠區：'
     A            S#AREA         1A  B  7 39
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  7 41'(空白表示全部) '
 9211A                                  9 24'起始業務員：'
  .  A            S#RVIS         1A  B  9 39
  .  A  61                                  DSPATR(PC)
  .  A  61                                  DSPATR(RI)
  .  A                                  9 41'(空白表示全部) '
  .  A                                 11 24'截止業務員：'
  .  A            S#RVIE         1A  B 11 39
  .  A  61                                  DSPATR(PC)
  .  A  61                                  DSPATR(RI)
 9211A                                 11 41'(空白表示全部) '
     A                                 13 17'異常狀況:'
     A                                 14 23'A:已開發票或已開請款單未承購逾'
     A            S#DAT3         3Y 0B 14 56EDTCDE(4)
     A                                 14 60'天'
     A                                 15 23'B:已承購未請款或已請款未繳款逾'
     A            S#DAT1         3Y 0B 15 56EDTCDE(4)
     A                                 15 60'天'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
