     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR150F1
     A*           2.PROGRAM-TYPE  PR
     A*           3.FUNCTION     对そ砯干基畉璹虫砞﹚郎
     A*           4.DATE-WRITTEN  107/01/26 2018AR1126
     A*           5.WRITER        S00WCJ
     A*           6.UPDATE DATE
     A*
     A*****************************************************************
     A          R RAR150F1                  TEXT('对砯干基畉璹虫砞﹚郎')
     A            A0ORNO         6A         COLHDG('璹虫絪腹')
     A            A0SAMT         4P 2       COLHDG('基畉')
     A            A0SAUE        20O         COLHDG('基畉璸衡そΑ')
     A*
     A          K A0ORNO
