     A                                      UNIQUE
     A          R RAR104F                   TEXT('承購發票作廢重開')
     A            AFBKID         3A         COLHDG('承購銀行代號')
     A            AFBKNM        10A         COLHDG('承購銀行簡稱')
     A            AFCUNO         6A         COLHDG('客戶代號')
     A            AFCUNM        10A         COLHDG('客戶名稱')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A            AFIVNO        10A         COLHDG('作廢發票號碼')
     A            AFAAMT         8S 0       COLHDG('作廢發票金額')
     A            AFDEDT         8S 0       COLHDG('作廢發票日期')
     A            AFINDD         8S 0       COLHDG('作廢發票開立日期')
     A            AFAPN1         6          COLHDG('作廢發票承購單號')
     A            AFDLD1         8S 0       COLHDG('作廢發票承購下載日')
     A            AFCUNN        10A         COLHDG('新開客戶代號')
     A            AFORNN         6A         COLHDG('新開訂單編號')
     A            AFINNO        10A         COLHDG('新開發票號碼')
     A            AFINDT         8S         COLHDG('新開發票日期')
     A            AFBAMT         8S 0       COLHDG('新開發票金額')
     A            AFTEXT        34A         COLHDG('說明')
     A*
     A          K AFIVNO
