     A*%%TS  SD  19920531  170655  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR113S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     發票折扣核對清單
     A*            5.DATE-WRITTEN  92/05/31
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR113F1
     A*%%TS  SD  19920531  170655  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR113S'
     A                                  2  2TIME
     A                                  2 28'發票折扣核對清單'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  7 21'客戶代號：'
     A            S#CUNO         6A  B  7 34
     A                                  7 41'（空白表全部）'
     A                                  9 21'業務員別：'
     A            S#SALE         1A  B  9 34
     A                                  9 41'（空白表全部）'
     A                                 11 21'發票日期：'
     A            S#IND1         8Y 0B 11 34EDTWRD('    /  /  ')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                 11 45'~~'
     A            S#IND2         8Y 0B 11 48EDTWRD('    /  /  ')
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 13 21'發票廠區：'
     A            S#AREA         1A  B 13 34
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 13 37'( H:苗栗 K:高雄空白=全部)'
     A                                 15 21'報表內容：'
     A            S#COD1         1A  B 15 34
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 15 37'( 1:折扣 2:未折扣)'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
