     A*%%TS  SD  19940916  095758  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR116S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     出貨及發票明細表─ＦＯＲ型鋼
     A*            5.DATE-WRITTEN  93/06/10
     A*            6.DATE-MODIFY   94/09/16
     A*
     A*      940916新增不同資料挑選方式
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR116F1
     A*%%TS  SD  19940916  095758  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 29'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR116S'
     A                                  2  2TIME
     A                                  2 31'★出貨及發票明細表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  8 16'請擇一出表方式:'
     A                                 10 20'請款別:'
     A            S#OPT1         1A  B 10 30VALUES(' ' 'Y')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                 10 32'(Y/ )'
     A                                 10 38'請款單號:'
     A            S#APNO         7A  B 10 50
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 12 20'客戶別:'
     A            S#OPT2         1A  B 12 30VALUES(' ' 'Y')
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 12 32'(Y/ )'
     A                                 12 38'客戶代號:'
     A            S#CUNO         6A  B 12 50
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 14 38'訂單編號:'
     A            S#ORN1         6A  B 14 50
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 14 57'~ '
     A            S#ORN2         6A  B 14 60
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                 14 67'(空白表全部)'
     A                                 16 20'繳款別:'
     A            S#OPT3         1A  B 16 30VALUES(' ' 'Y')
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                 16 32'(Y/ )'
     A                                 16 38'繳款單號:'
     A            S#RCNO         6A  B 16 50
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
