     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R WVREC                     TEXT('新桃工程自用發票開立明細檔')
     A*           W1YM           6S 0       COLHDG('年月')
     A            W1AREA         1A         COLHDG('廠區')
     A            W1TRCD         2A         COLHDG('異動代號')
0409AA            W1PDNM         5A         COLHDG('品名')
     A            W1PJNO        10A         COLHDG('專案號碼')
     A            W1NO          10A         COLHDG('發票號碼')
     A            W1DATE         8S 0       COLHDG('發票日期')
     A            W1QTY          7P 0       COLHDG('數量')
     A            W1UPRC         8P 3       COLHDG('單價')
     A            W1AMT         11P 0       COLHDG('金額')
     A            W1TAX         11P 0       COLHDG('稅額')
     A****
     A          K W1NO
     A          K W1AREA
     A          K W1TRCD
     A          K W1PDNM
