     A                                      UNIQUE
     A          R RAR128F
     A            ACFLAG         1A         COLHDG('處理代碼')
     A            ACVRTY         1A         COLHDG('ACVRTY')
     A            ACDM03         5A         COLHDG('ACDM03')
     A            ACAREA         1A         COLHDG('開立廠區')
     A            ACCARD         1A         COLHDG('廠別')
     A            ACKIND         1A         COLHDG('類別')
     A            ACYM           6S 0       COLHDG('年月')
     A            ACYMD          8S 0       COLHDG('入帳日期')
     A            ACVRNO         6A         COLHDG('傳票號碼')
     A            ACITEM         3S 0       COLHDG('項目')
     A            ACDC           1A         COLHDG('借貸')
     A            ACNO           9A         COLHDG('會計科目')
     A            ACTYCO         2A         COLHDG('方式要件代號')
     A            ACDPNO         8A         COLHDG('部門代號')
     A            ACBKNO        10A         COLHDG('銀行代號')
     A            ACRLNO        20O         COLHDG('相關號碼')
     A            ACDUE          8S 0       COLHDG('到期日')
     A            ACCUNO        10A         COLHDG('對象代號')
     A            ACCSNM        10O         COLHDG('對象簡稱')
     A            ACENNO        10A         COLHDG('工程編號')
     A            ACQTY         11S 2       COLHDG('數量')
     A            ACUNIT         2A         COLHDG('單位')
     A            ACAMT         13P 2       COLHDG('金額')
     A            ACCORT         2S 0       COLHDG('更正代號')
     A            ACBGCD         5A         COLHDG('歸屬代號')
     A            ACDSC1        20O         COLHDG('摘要（一）')
     A            ACDSC2        20O         COLHDG('摘要（二）')
     A            ACDM04        32A         COLHDG('ACDM04')
     A            ACSEPT         1A         COLHDG('ACSEPT')
     A****
     A          K ACAREA
     A          K ACYM
     A          K ACVRNO
     A          K ACITEM
