     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR140S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     磅差統計表
     A*            5.DATE-WRITTEN  103/08/04  2014AR854
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A*================================================================
     A          R AR140F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 70'ARR139S'
     A                                  1 25'東和鋼鐵企業股份有限公司'
     A                                  2 30'★銷貨查帳報告下載★'
     A            S#USER        10A  O  2  2
     A            S#DEVN        10A  O  2 70
     A*
     A                                  9 22'日期:'
     A            S#DAT1         8  0B    +1EDTCDE(Z)
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A*
     A                                    +1'~'
     A*
     A            S#DAT2         8  0B    +1EDTCDE(Z)
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A*
     A                                 11 22'抓取輸入起日後10筆磅+
     A                                      單，迄日前5筆磅單資料'
     A*----------------------------------------------------------------
     A            S#ERR         70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A*****************************************************************
