     A*%%TS  SD  19930728  173157  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR117S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     營業退款未過入財會明細表
     A*            5.DATE-WRITTEN  93/07/28
     A*            6.DATE-UPDATE
     A*
     A*==============================================================
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A***************************************************************
     A          R AR117F1
     A*%%TS  SD  19930728  173157  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR117S '
     A                                  2  2TIME
     A                                  2 28'★營業退款已確認明細表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A                                  8  9'請輸入篩選條件:'
     A                                 10 16'1.退款廠區:'
     A            S#RTDP         1A  B 10 30VALUES('P' 'M' 'T' 'H' 'K')
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                 10 32'(P:台北 M:台中 T:桃園 H:苗+
     A                                      栗 K:高雄)'
     A                                 12 16'2.退款日期:'
     A            S#RTDT         8Y 0B 12 30EDTWRD('    /  /  ')
     A  52                                  DSPATR(PC)
     A  52                                  DSPATR(RI)
     A                                 16 16'說明：本表會依輸入之篩選條件印出+
     A                                      已確認未列印'
     A                                 17 16'　　　而且未過入財會的營業退款明+
     A                                      細表。'
     A                                 23  3'F3:結束'
     A                                 23 17'F12:回前畫面'
     A                                 23 37'ENTER:執行'
     A            S#ERR         70A  O 24  2DSPATR(HI)
