     A*%%TS  SD  19930109  093227  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR114S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     折讓單統計表（含銷折／銷退／預收）
     A*            5.DATE-WRITTEN  93/01/08
     A*            6.DATE-UPDATE   99/12/03  2010AR556  S00WCJ (9912A)
     A*
     A***************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 '結束')
     A                                      CA12(12 '回上頁')
     A*================================================================
     A          R AR114F1
     A*%%TS  SD  19930109  093227  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 28'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR114S'
     A                                  2  2TIME
     A                                  2 21'★折讓單統計表（含銷折／銷退／+
     A                                      預收)★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            U#USID        10A  O  3  2
     A                                  8 21'折讓發票廠區：'
     A            S#AREA         1A  B  8 38VALUES('P' 'M' 'K' 'H')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
9912AA                                  8 40'(P:台北,八德,桃園 M:台中)'
     A                                  9 40' K:高雄, H:苗栗)'
     A                                 11 21'折讓確認年月：'
     A            S#YYMM         6Y 0B 11 38EDTWRD('    /  ')
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 13 25'報表種類：'
     A            S#KIND         1A  B 13 38VALUES('A' 'B')
     A                                 13 40'(A:明細表B:彙總表)'
     A                                 23  2'F03:結束'
     A                                      DSPATR(HI)
     A                                 23 13'F12:回前'
     A                                      DSPATR(HI)
     A                                 23 24'ENTER:執行'
     A                                      DSPATR(HI)
     A            S#ERR         70A  O 24  2
