     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR129S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02LBU
     A*            4.FUNCTION     銷貨調整單開立發票彙總表
     A*            5.DATE-WRITTEN  96/11/05
     A*            6.DATE-MODIFY  110/12/16 2021AR00051 S00WCJ (1012A)
     A*                            增加訂單編號及調整單名篩選欄位
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A*================================================================
     A          R AR129F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 27'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR129S'
     A                                  2  2TIME
     A                                  2 25'★銷貨調整單開立發票彙總表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A*
     A                                 10 24'選　　項：'
     A            S#OPT          1A  B 10 37
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 10 39'(1:鋼筋2:型鋼3:全部)'
     A*
     A                                 12 18'調整單開立區間：'
     A            S#DAT1         8Y 0B 12 37EDTWRD('    /  /  ')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A*
     A                                 12 48'~~'
     A*
     A            S#DAT2         8Y 0B 12 51EDTWRD('    /  /  ')
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
1012AA                                 14 24'訂單編號：'
1012AA            S#ORNS         6A  B    +1
1012AA  33                                  DSPATR(PC RI)
1012AA                                    +1'~'
1012AA            S#ORNE         6A  B    +1
1012AA  33                                  DSPATR(PC RI)
1012AA                                    +1'(空白表全部)'
1012AA                                 16 24'調整品名：'
1012AA            S#PDNM         5A  B    +1
1012AA                                    +1'(空白表全部)'
     A*----------------------------------------------------------------
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
     A*****************************************************************
