     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR143F
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     平均收款日彙總檔
     H*            5.DATE-WRITTEN  105/09/02
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A                                      UNIQUE
     A          R RAR143F                   TEXT('平均收款日彙總檔')
     A            AXCUNO         6A         COLHDG('客戶編號')
     A            AXCUNM        10A         COLHDG('客戶簡稱')
     A            AXDELY         5P 0       COLHDG('平均收款日數')
     A            AXENTD         8S 0       COLHDG('執行日期')
     A            AXENTM        10A         COLHDG('執行人員')
     A            AXENTT         6S 0       COLHDG('執行時間')
     A*
     A          K AXCUNO
     A*
