     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR147S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     訂單別出貨統計表─交貨地點
     A*            5.DATE-WRITTEN  113/04/24 2024AR00015
     A*            6.UPDATE  DATE
     A*
     A***************************************************************
     A*  畫面一:輸入統計年月
     A*
     A*        記錄格式 AR147F1
     A***************************************************************
     A          R AR147F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR147S '
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 27'訂單別出貨統計表─交貨地點'
     A            S#DEVI        10A  O  2 70
     A                                  6  5'請輸入篩選條件:'
     A                                  6 23'日期區間:'
     A            S#DATS         8Y 0B    +1EDTWRD('    /  /  ')
     A  41                                  DSPATR(RI PC)
     A                                    +1'～'
     A            S#DATE         8Y 0B    +1EDTWRD('    /  /  ')
     A  42                                  DSPATR(RI PC)
     A                                  8 23'客戶編號:'
     A            S#CUNO         6A  B    +1
     A  43                                  DSPATR(RI PC)
     A                                 10 23'訂單編號:'
     A            S#ORNO         6A  B    +1
     A  44                                  DSPATR(RI PC)
     A                                    +1'(空白表全部)'
     A                                 12 23'聯絡人:'
     A            S#MSMN        10J  B    +1
     A                                    +1'(空白表全部)'
     A                                 14 23'出貨廠區:'
     A            S#AREA         1A  B    +1VALUES('U' 'V' 'Q' ' ' 'M' +
     A                                             'N'                 +
     A                                             'K' 'O' 'X' 'R' 'D')
     A                                    +1'(U=桃園V=保障+
     A                                        X=雄嘉O=勇承'
     A                                 15 38'R=友德M=台中+
     A                                       K=高雄空白表全部)'
     A                                 17 23'發票開立:'
     A            S#INVT         1A  B    +1VALUES(' ' 'Y' 'N')
     A                                    +1'(Y=已開立；N=未開立'
     A                                    +1'空白表全部)'
     A                                 23  3'F3:結束'
     A                                 23 17'F12:回前畫面'
     A                                 23 37'ENTER:執行'
     A            S#MSG1        70A  O 24  2DSPATR(HI)
