     A                                      UNIQUE
     A          R RAR133F
     A            W1INNO        10A         COLHDG('發票號碼')
     A            W1CUNO         6A         COLHDG('客戶代號')
     A            W1CUNM        10O         COLHDG('客戶簡稱')
     A            W1ORNO         6A         COLHDG('訂單號碼')
     A            W1RVNO         6A         COLHDG('繳款編號')
     A            W1TYPE         1A         COLHDG('發票類別')
     A            W1AMT1        11P 0       COLHDG('預收金額')
     A            W1AMT2        11P 0       COLHDG('已兌現金額')
     A            W1AMT3        11P 0       COLHDG('預收折讓金額')
     A            W1AMT4        11P 0       COLHDG('扣預收金額')
     A            W1AMT5        11P 0       COLHDG('轉出／退票金額')
     A            W1AMT6        11P 0       COLHDG('已兌現餘額')
     A****
     A          K W1INNO
