     A*%%***********************************************************************
     A*%%TS  RD  19921126  163546  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR101T1
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     應收帳款承購(E-FACTORING)發票異常檢核表
     A*           4.AUTHOR        S02CSF
     A*           5.DATE-WRITTEN  92/02/24
     A*           6.DATE-MODIFY   92/11/26
     A*
     A*    新增"業務員別"
     A*****************************************************************
     A          R AR101T1H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A                                     2
     A                                      '報　　表:  ARR101T'
     A                                    55
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   111
     A                                      '列表日期:'
     A                                   123
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '列表人員:'
     A                                      SPACEB(001)
     A            U#USID        10A       15
     A                                    53
     A                                      '應收帳款承購未開立發票明細表'
     A                                   111
     A                                      '列表時間:'
     A                                   123
     A                                      TIME
     A                                     2
     A                                      '廠　　區: '
     A                                      SPACEB(001)
     A            T#AREA         6A  O    14
     A                                    21
     A                                      '業務員別: '
     A            T#RVID         1A  O    33
     A                                   111
     A                                      '頁　　次:'
     A                                   123
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1       132         1
     A                                      SPACEB(001)
     A                                     2
     A                                      '客戶編號'
     A                                      SPACEB(001)
     A                                    14
     A                                      '客戶名稱'
     A                                    26
     A                                      '訂單號碼'
     A                                    39
     A                                      '磅單號碼'
     A                                    51
     A                                      '出貨日期'
     A                                    63
     A                                      '品　名'
     A                                    72
     A                                      '單　價'
     A                                    85
     A                                      '數　量'
     A                                   101
     A                                      '金　額'
     A                                   111
     A                                      '傳票號碼'
     A                                   123
     A                                      '備　　註'
     A            T#LIN2       132A        1
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR101T1D
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A N50        T#CUNO         5A        4
     A N50        T#CUNM        10O       14
     A N51        T#ORNO         6A       28
     A            T#NO           8A       39
     A            T#DATE         8  0     50
     A                                      EDTWRD('    /  /  ')
     A            T#PDNM         3A       65
     A            T#UPRC         5S 2     73
     A                                      EDTCDE(1)
     A            T#QTY          7S 0     83
     A                                      EDTCDE(1)
     A            T#AMT         11S 0     95
     A                                      EDTCDE(1)
     A            T#VUNO         7A      113
     A            T#IVTP        10A      121
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR101T1S
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    68
     A                                      '客戶小計：'
     A                                      SPACEB(001)
     A            T#QTYS         9S 0     81
     A                                      EDTCDE(1)
     A            T#AMTS        13S 0     92
     A                                      EDTCDE(1)
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR101T1T
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    66
     A                                      '業務員合計：'
     A                                      SPACEB(001)
     A            T#QTYT         9S 0     81
     A                                      EDTCDE(1)
     A            T#AMTT        13S 0     92
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR101T1A
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    68
     A                                      '總　　計：'
     A                                      SPACEB(001)
     A            T#QTYA         9S 0     81
     A                                      EDTCDE(1)
     A            T#AMTA        13S 0     92
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR101T1L
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#LIN3        45A       68
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R AR101T1M
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    59
     A                                      '無符合條件之資料!!!'
     A                                      SPACEB(008)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 008
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARR101T1)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       200      *N     )
     A*%%***********************************************************************
