     A                                      UNIQUE
     A          R RAR103F                   TEXT('跨年度發票作廢統計表')
     A            AFDEPT         4A         COLHDG('營業單位')
     A            AFRVID         2A         COLHDG('業務員代號')
     A            AFAREA         1A         COLHDG('業務廠區')
     A            AFNAME        10A         COLHDG('業務員姓名')
     A            AFCUNO         6A         COLHDG('客戶代號')
     A            AFCUNM        10A         COLHDG('客戶名稱')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A            AFINNO        10A         COLHDG('發票號碼')
     A            AFNO           8A         COLHDG('磅單編號')
     A            AFAMT1         8S 0       COLHDG('發票金額')
     A*
     A          K AFINNO
