     A                                      UNIQUE
     A          R RAR131F2
     A            W2ORNO         6A         COLHDG('訂單號碼')
     A            W2AREA         1A         COLHDG('廠區')
     A            W2QTY          9P 0       COLHDG('數量')
     A            W2UAMT        13P 2       COLHDG('美金金額')
     A            W2NAMT        11P 0       COLHDG('台幣金額')
     A            W2APNO        20A         COLHDG('報單號碼')
     A            W2DATE         8S 0       COLHDG('報關日期')
     A            W2WKAR        10O         COLHDG('交運地點')
     A            W2CUNO         6A         COLHDG('客戶代號')
     A            W2CUNM        10O         COLHDG('客戶名稱')
     A            W2TRAT         7S 4       COLHDG('實際報關匯率')
     A****
     A          K W2ORNO
     A          K W2AREA
     A          K W2APNO
