     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR142F
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     折讓開立分攤未確認工作檔
     A*            5.DATE-WRITTEN  105/12/12  2016AR931
     A*            6.UPDATE  DATE
     A*
     A*****************************************************************
     A*                                     UNIQUE
     A          R RAR142F                   TEXT('折讓開立分攤未確認工作檔')
     A            A4DXNO         8A         COLHDG('折讓單號')
     A            A4DXIT         2S 0       COLHDG('折讓單項次')
     A            A4TXNO         8A         COLHDG('磅單編號')
     A            A4TXIT         2S 0       COLHDG('磅單項次')
     A            A4CUNO         6A         COLHDG('客戶編號')
     A            A4ORNO         6A         COLHDG('訂單編號')
     A            A4IVNO        10A         COLHDG('發票號碼')
     A            A4PDNM         5A         COLHDG('品名')
     A            A4METL         8A         COLHDG('鋼種')
     A            A4SPE1         5A         COLHDG('H/W/D')
     A            A4SPE2         5A         COLHDG('B/T')
     A            A4SPE5         6A         COLHDG('長度')
     A            A4QTY          7S 0       COLHDG('數量')
     A            A4UPRC         5S 3       COLHDG('單價')
     A            A4AMT         11S 0       COLHDG('金額')
     A            A4TAX         11S 0       COLHDG('稅額')
     A*
     A          K A4TXNO
     A          K A4TXIT
     A          K A4DXNO
     A          K A4DXIT
     A*
