     A*%%TS  SD  19940414  115851  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR118S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     應收票據資負在債查核明細表
     A*            5.DATE-WRITTEN  94/04/13
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR118F1
     A*%%TS  SD  19940414  115851  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 29'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR118S'
     A                                  2  2TIME
     A                                  2 26'★應收票據資負同在查核明細表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  9 25'票據到日期：'
     A            S#DUDT         8Y 0B  9 40EDTWRD('    /  /  ')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                 11 25'(例：查第一季者，請輸入XX年3+
     A                                      月31日。以此類推)'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
