     A*%%TS  SD  19930109  150226  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR103S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     跨年度發票作廢統計表
     A*            5.DATE-WRITTEN  92/01/09
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR101F1
     A*%%TS  SD  19930109  150226  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARR103S'
     A                                  2  2TIME
     A                                  2 30'跨年度發票作廢統計表'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  9 29'作廢年度:'
     A            S#YEAR         2A  B  9 41
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                 10 29'業務廠區:'
     A            S#AREA         1A  B 10 41
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 10 43'廠'
     A                                 10 48'(P:台北 T:桃園)'
     A                                 11 48'(K:高雄 M:台中)'
     A                                 12 48'(空白代表全部 )'
     A                                 23  2'F3=離開  F12=回上頁'
     A            S#ERR         70A  O 24  2DSPATR(HI)
