     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARR136F
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     銷貨發票開立方式一覽表暫存檔
     A*            5.DATE-WRITTEN  98/12/21 2009OD64
     A*
     A*****************************************************************
     A                                      UNIQUE
     A          R ARREC                     TEXT('發票開立方式暫存檔')
     A            ARMTHD         2A         COLHDG('開立方式')
     A            ARORN5         6A         COLHDG('五碼訂單')
     A            ARORNO         9A         COLHDG('訂單編號')
     A            ARCUNO         6A         COLHDG('客戶編號')
     A            ARCUNM        10A         COLHDG('客戶名稱')
     A            ARAREA         1A         COLHDG('廠區')
     A            ARSALE         2A         COLHDG('出貨業務員')
     A            ARCTNO        10A         COLHDG('購案號碼')
     A            ARTRYN         1A         COLHDG('銷貨未開發票')
     A*
     A          K ARORNO
