     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR126S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02LBU
     A*            4.FUNCTION     期後收回應收帳款明細表
     A*            5.DATE-WRITTEN  95/06/28
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A*================================================================
     A          R AR126F
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 29'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR126S'
     A                                  2  2TIME
     A                                  2 28'★期後收回應收帳款明細表★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A*======
     A                                  9 25'繳款日期：'
     A            S#DATS         8Y 0B  9 38EDTWRD('    /  /  ')
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A*
     A                                  9 49'~'
     A*
     A            S#DATE         8Y 0B  9 51EDTWRD('    /  /  ')
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A*======
     A                                 11 25'應收帳款年度：'
     A            S#YEAR         4Y 0B 11 42EDTCDE(Z)
     A                                 11 48'(空白＝全部)'
     A*======
     A                                 13 25'客戶代號：'
     A            S#CUNO         6A  B 13 38
     A                                 13 46'(空白＝全部)'
     A*======
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
     A*****************************************************************
