     A*                                     UNIQUE
     A          R RAR113F                   TEXT('發票折扣核對清單')
     A            AFORNO         6A         COLHDG('訂單號碼')
     A*
     A          K AFORNO
