     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR145S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     外銷應收帳款查詢報表
     A*            5.DATE-WRITTEN  108/08/02 2019AR00053
     A*            6.UPDATE  DATE
     A*
     A***************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR145F1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            S#COMP        35A  O  1 23
     A                                  1 70'ARR145S '
     A                                  2  2TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 27'★外銷應收帳款查詢報表★'
     A                                      DSPATR(RI)
     A            S#DEVI        10A  O  2 70
     A                                  8 25'產品別：'
     A            S#PROD         1A  B    +1VALUES('2' '3' ' ')
     A                                    +1'(2=鋼筋(X訂單) 3=+
     A                                      型鋼空白=全部)'
     A            S#ERR         70A  O 23  2DSPATR(HI)
     A                                 24  5'PF03:結束'
     A                                 24 18'PF12:回前畫面'
