     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR133S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02LBU
     A*            4.FUNCTION     客戶預收貨款核對明細表
     A*            5.DATE-WRITTEN  97/05/01
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A*================================================================
     A          R AR133F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 70'ARR133S'
     A                                  1 25'東和鋼鐵企業股份有限公司'
     A                                  2 24'★客戶預收貨款核對明細表★'
     A            S#USER        10A  O  2  2
     A            S#DEVN        10A  O  2 70
     A*
     A*                                 8 20'廠　　區:'
     A*           S#AREA         1A  B  8 32
     A* 40                                  DSPATR(PC)
     A* 40                                  DSPATR(RI)
     A*                                 8 34'(空白＝全部)'
     A*
     A                                  9 22'客戶代號:'
     A            S#CUNO         6A  B  9 34
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                  9 41'(空白＝全部)'
     A*
     A                                 11 22'訂單編號:'
     A            S#ORNO         6A  B 11 34
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 11 41'(空白＝全部)'
     A*----------------------------------------------------------------
     A            S#ERR         70A  O 23  2DSPATR(HI)
     A                                 24  5'ENTER:執行'
     A                                 24 20'PF03:結束'
     A*****************************************************************
