     A*%%***********************************************************************
     A*%%TS  RD  19920408  094404  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR106T
     A*            2.PROGRAM-TYPE  PRTF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     應收帳款承購客戶其他應收明細表
     A*            5.DATE-WRITTEN  92/02/06
     A*            6.DATE-UPDATED
     A*
     A*****************************************************************
     A          R AR106T1H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報　　表: ARR106T'
     A                                      SPACEB(001)
     A                                    54
     A                                      '東和鋼鐵企業股份有限公司'
     A                                   117
     A                                      '印表人員:'
     A            U#USID        10A      128
     A                                     2
     A                                      '客戶名稱:'
     A                                      SPACEB(001)
     A            T#CUN1        10A       13
     A                                    51
     A                                      '應收帳款承購客戶其他應收明細表'
     A                                   117
     A                                      '印表日期:'
     A                                   128
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      '發票日期: '
     A                                      SPACEB(001)
     A            T#INDT         6  0O    14
     A                                      EDTCDE(Y)
     A                                   117
     A                                      '頁　　數:'
     A                                   128
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1       140A  O     2
     A                                      SPACEB(001)
     A                                     2
     A                                      '客戶代號'
     A                                      SPACEB(001)
     A                                    17
     A                                      '客戶名稱'
     A                                    33
     A                                      '訂單編號'
     A                                    50
     A                                      '發票號碼'
     A                                    69
     A                                      '出貨金額'
     A                                    86
     A                                      '銷貨稅額'
     A                                   105
     A                                      '扣預收金額'
     A                                   124
     A                                      '應收帳款'
     A            T#LIN2       140A  O     2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR106T1D
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     2
     A                                      ' '
     A                                      SPACEB(001)
     A N50        T#CUNO         6A  O     4
     A N50        T#CUNM        10A  O    17
     A N51        T#ORNO         6A  O    35
     A            T#IVNO        10A  O    49
     A            T#AAMT        10S  O    65
     A                                      EDTCDE(1)
     A            T#ATAX         8S  O    86
     A                                      EDTCDE(1)
     A            T#BAMT        10S  O   103
     A                                      EDTCDE(1)
     A            T#CAMT        12S  O   119
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR106T1S
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    50
     A                                      '客戶小計:'
     A                                      SPACEB(001)
     A            T#AAMS        12S  O    63
     A                                      EDTCDE(1)
     A            T#ATAS        10S  O    83
     A                                      EDTCDE(1)
     A            T#BAMS        12S  O   101
     A                                      EDTCDE(1)
     A            T#CAMS        12S  O   119
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR106T1L
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*****************************************************************
     A            T#LIN3        75A  O    61
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR106T1M
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A                                    19
     A                                      '*****無符合條件之資料!!!'
     A                                      SPACEB(008)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 008
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(S02CSF/CCR503T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       200      *N     )
     A*%%***********************************************************************
