     A*%%TS  SD  19950109  110227  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARR123S
     A*            2.PROGRAM-TYPE  RPG/400
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     客戶銷售排行榜（財會用）
     A*            5.DATE-WRITTEN  95/01/03
     A*            6.DATE-MODIFY
     A*
     A*     CF:此報表與CCR020P不同處在於:
     A*         CCR020P是根據銷貨當時的資料，不包含調整。折讓。折扣
     A*
     A***************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR123F1
     A*%%TS  SD  19950109  110227  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 28'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR123S'
     A                                  2  2TIME
     A                                  2 26'★客戶銷售排行榜（財會用）★'
     A                                      DSPATR(RI)
     A            S#DEVN        10A  O  2 70
     A            S#USID        10A  O  3  2
     A                                  8 27'銷貨年月：'
     A            S#YM1          6Y 0B  8 40EDTWRD('    /  ')
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                  8 48'~~'
     A            S#YM2          6Y 0B  8 51EDTWRD('    /  ')
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 10 27'排行名次：'
     A            S#RAK1         3Y 0B 10 40EDTCDE(4)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 10 44'~~'
     A            S#RAK2         3Y 0B 10 47EDTCDE(4)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                 12 27'銷貨淨額：'
     A            S#AMT         11Y 0B 12 40EDTCDE(1)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                    +1'(單位:仟元)'
     A            S#ERR         70A  O 23  2DSPATR(HI)
     A                                 24  5'PF03:結束'
     A                                 24 18'PF12:回前畫面'
