     A                                      UNIQUE
     A          R RAR129F
     A            F#PDNO         3A         COLHDG('品名代號')
     A            F#PDNM        16O         COLHDG('中文品名')
     A            F#AMTP        11S 0       COLHDG('台北金額')
     A            F#AMTT        11S 0       COLHDG('桃園金額')
     A            F#AMTM        11S 0       COLHDG('台中金額')
     A            F#AMTK        11S 0       COLHDG('高雄金額')
     A****
     A          K F#PDNO
