     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARR143F1
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     平均收款日明細檔
     H*            5.DATE-WRITTEN  105/09/02
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A*                                     UNIQUE
     A          R RAR143F1                  TEXT('平均收款日明細檔')
     A            A1CUNO         6A         COLHDG('客戶編號')
     A            A1CUNM        10A         COLHDG('客戶簡稱')
     A            A1ORNO         6A         COLHDG('訂單號碼')
     A            A1TXCD         4A         COLHDG('單據類別')
     A            A1TXNO         8A         COLHDG('磅單編號')
     A            A1TXDT         8P 0       COLHDG('磅單日期')
     A            A1TXAM        11P 0       COLHDG('出貨金額')
     A            A1INNO        10A         COLHDG('發票號碼')
     A            A1APNO         6A         COLHDG('請款單號')
     A            A1RVNO         6A         COLHDG('繳款單號')
     A            A1RVDT         8P 0       COLHDG('繳款日期')
     A            A1RVLD         8P 0       COLHDG('繳款最後兌現日')
     A            A1DELY         5P 0       COLHDG('收款天數')
     A            A1ENTD         8S 0       COLHDG('執行日期')
     A            A1ENTM        10A         COLHDG('執行人員')
     A            A1ENTT         6S 0       COLHDG('執行時間')
     A*
     A          K A1TXCD
     A          K A1TXNO
     A          K A1INNO
     A*
