     A***************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A***************************************************************
     A*
     A                                      UNIQUE
     A          R RAR116F                   TEXT('請款單明細表')
 9308A            A6CUNO         6A         COLHDG('客戶代號')
 9308A            A6CUNM        10O         COLHDG('客戶名稱')
     A            A6INNO        10A         COLHDG('發票號碼')
     A            A6ORNO         6A         COLHDG('訂單編號')
     A            A6ORTM         3S 0       COLHDG('訂單項次')
 9308A            A6CTNO        10A         COLHDG('工程編號')
 9308A            A6CTNM        22O         COLHDG('工程名稱')
     A            A6VRNO         8A         COLHDG('磅單編號')
     A            A6VRTM         3S 0       COLHDG('磅單項次')
 9308A            A6DATE         8S 0       COLHDG('出貨日期')
     A            A6STND         1A         COLHDG('規範別')
     A            A6QULT         8A         COLHDG('鋼種')
0409AA            A6PDNM         5A         COLHDG('品名')
     A            A6SPE1         5A         COLHDG('Ｈ／Ｔ／Ｄ')
     A            A6SPE2         5A         COLHDG('Ｂ／Ｗ')
     A            A6SPE3         5A         COLHDG('Ｔ１')
     A            A6SPE4         5A         COLHDG('Ｔ２')
     A            A6SPE5         5S 3       COLHDG('長度')
     A            A6PNUM         5S 0       COLHDG('支數')
     A            A6WGHT         9S 0       COLHDG('重量')
     A            A6UPRC         5S 3       COLHDG('單價')
     A            A6AMT          9S 0       COLHDG('金額')
     A            A6PLE1        40A         COLHDG('交貨地點')
     A            A6NOTE        98A         COLHDG('備註')
     A*
     A          K A6INNO
     A          K A6VRNO
     A          K A6VRTM
