     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR136T
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.FUNCTION     銷貨發票開立方式一覽表
     A*           4.DATE-WRITTEN  98/12/18 2009OD64
     A*           5.WRITER        S00WCJ
     A*           6.UPDATE  DATE 113/01/05 2023AR00056 S00WCJ (1301A)
     A*                          113/01/22 S00WCJ (1301B)
     A*                           增加訂單日期及結案碼欄位，由於磅單
     A*                           僅可保留1.5年之資料，參考價值不高
     A*                           移除銷貨未開欄位，改為顯示訂單日期
     A*                           後續再追加顯示接單業務欄位
     A*
     A*****************************************************************
     A          R AR136T1H
     A*****************************************************************
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      ' PRT-ID  : ARR136T'
1301BA                                    35
     A                                      '東和鋼鐵企業股份有限公司'
1301BA                                    69
     A                                      '列表日期:'
     A                                    +1
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR-ID  :'
     A                                      SPACEB(001)
     A            U#USID        10A  O    +1
1301BA                                    35
     A                                      '銷貨發票開立方式一覽表'
1301BA                                    69
     A                                      '列表時間:'
     A                                    +1
     A                                      TIME
1301BA                                    69
     A                                      '頁　　次:'
     A                                      SPACEB(001)
     A                                    +1
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     2
1301BA                                      '訂單日期:'
     A                                      SPACEB(002)
     A            R#DATS         8  0     +1EDTWRD('    /  /  ')
     A                                    +1'～'
     A            R#DATE         8  0     +1EDTWRD('    /  /  ')
1301AA                                    +6'廠區:'
1301AA            R#AREA         1        +1
1301AA            R#ARNM        10        +1
1301AA                                     2
1301AA                                      '業務代號:'
1301AA                                      SPACEB(001)
1301AA            R#SALS         1        +1
1301AA                                    +1'(空白表全部) '
1301AA                                    42'客戶編號:'
1301AA            R#CUNS         6        +1
1301AA                                    +1'(空白表全部)'
1301AA                                     2
1301AA                                      '發票開立方式:'
1301AA                                      SPACEB(001)
1301AA            R#INVS         1        +1
1301AA            R#INVM        10        +1
1301AA                                    42'訂單結案:'
1301AA            R#CLOS         1        +1
1301AA                                    +1'(空白表全部)'
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
1301BA                                      ============-
1301BA                                      ===================='
     A                                      SPACEB(001)
     A                                     1
1301BA                                      '接單業務'
     A                                      SPACEB(001)
1301BA                                    +0
1301AA                                      '交貨業務'
     A                                    +0
     A                                      '發票開立方式'
     A                                    +0
     A                                      '客戶編號'
     A                                    +0
     A                                      '客戶名稱'
     A                                    +0
     A                                      '訂單編號'
     A                                    +1
     A                                      '購案號碼'
     A                                    +0
     A                                      '廠區'
     A                                    +0
1301BA                                      '訂單日期'
1301BA                                    +0
1301BA                                      '訂單結案'
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
1301BA                                      ============-
1301BA                                      ===================='
     A                                      SPACEB(001)
     A**************************************************************************
     A          R AR136T1D
     A**************************************************************************
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
1301BA  51        R#SALE         2   O     5
1301AA  51        R#SND          2   O    15
1301BA  52        R#MTHD         6   O    24
1301BA  53        R#CUNO         6   O    36
1301BA  53        R#CUNM        10   O    45
1301BA            R#ORNO         9   O    56
1301BA            R#CTNO        10   O    66
1301BA            R#VREA         1   O    79
1301BA*           R#TRYN         1   O    81
1301BA            R#DATE         8  0O    82EDTWRD('    /  /  ')
1301BA            R1CLOS         1   O    96
     A**************************************************************************
     A          R AR136T1L
     A**************************************************************************
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A                                     1
     A                                      ' '
     A**************************************************************************
     A          R AR136T1M
     A**************************************************************************
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A                                     1
     A                                      '----------------------------------+
     A                                      -----------------------------------+
1301BA                                      ------------+
     A                                      --------------------'
     A
     A**************************************************************************
     A          R AR136T1T
     A**************************************************************************
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
1301BA                                    40
     A                                      '===列印結束===='
     A**************************************************************************
     A          R AR136T1X
     A**************************************************************************
     A                                      SPACEA(001)
     A*----------------------------------------------------------------*********
     A                                     1
     A                                      '=============================-
1301BA                                      ===========-
     A                                      ==接　下　頁==============-
1301BA                                      ===========-
     A                                      ======================'
