     A****************************************************************
     A*
     A*            UPDATE  DATE  101/09/18  2012AR682  S00WCJ (0109A)
     A*
     A****************************************************************
     A                                      UNIQUE
     A          R RAR118F                   TEXT('資負同在報表')
     A            A8CUNO         6A         COLHDG('客戶代號')
     A            A8CUNM        10O         COLHDG('客戶名稱')
     A            A8ACTP         1A         COLHDG('借貸別')
0109AA            A8ACNO         9A         COLHDG('會計科目')
     A            A8USTP         2A         COLHDG('款項別')
     A            A8ORNO         6A         COLHDG('訂單編號')
     A            A8RVDT         8S 0       COLHDG('繳款日期')
     A            A8RVNO         6A         COLHDG('繳款單號')
     A            A8ITEM         2S 0       COLHDG('繳款項次')
     A            A8VNO1         7A         COLHDG('傳票號碼')
     A            A8NTNO        20A         COLHDG('票據號碼')
     A            A8DUDT         8S 0       COLHDG('到期日')
     A            A8AMT          9S 0       COLHDG('金額')
     A*
     A          K A8RVNO
     A          K A8ITEM
