     A*%%TS  SD  19920306  165153  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR109S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     客戶暫收貨款餘額明細表（營業）
     A*            5.DATE-WRITTEN  92/03/04
     A*            6.DATE-MODIFY
     A*
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR109F1
     A*%%TS  SD  19920306  165153  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 26'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR110S'
     A                                  2  2TIME
     A                                  2 27'客戶暫收貨款餘額明細表'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                 10 24'客戶代號：'
     A            S#CUNO         6A  B 10 37
     A                                 10 44'(空白表全部)'
     A                                 12 24'暫收廠區：'
     A            S#AREA         1A  B 12 37
     A                                 12 44'(空白表全部)'
     A                                 14 24'訂單編號：'
     A            S#ORNO         6A  B 14 37
     A                                 14 44'(空白表全部)'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
