     A*%%***********************************************************************
     A*%%TS  RD  19930112  131610  S02CSF      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A*****************************************************************
     A*
     A*           1.PROGRAM-ID    ARR114TB
     A*           2.PROGRAM-TYPE  PRTF
     A*           3.WRITER        S02CSF
     A*           4.FUNCTION     折讓單統計表（含銷折／銷退／預收）
     A*           5.DATE-WRITTEN  93/01/08
     A*           6.DATE-MODIFY
     A*
     A*****************************************************************
     A          R AR114T1H
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A                                      SKIPB(003)
     A*----------------------------------------------------------------*********
     A                                     2
     A                                      '報　　表:ARR114TB'
     A                                    40
     A                                      '東和鋼鐵企業股份有限公司'
     A                                    79
     A                                      '列表日期:'
     A                                    90
     A                                      DATE
     A                                      EDTCDE(Y)
     A                                     2
     A                                      ' USR - ID :'
     A                                      SPACEB(001)
     A            U#USID        10A  O    13
     A                                    36
     A                                      '折讓單彙總表（含銷折／銷退／預收-
     A                                      ）'
     A                                    79
     A                                      '列表時間:'
     A                                    90
     A                                      TIME
     A                                     2
     A                                      '廠　　區:'
     A                                      SPACEB(001)
     A            T#AREA         1A       13
     A                                    48
     A                                      '年月:'
     A            T#YYMM         6  0     55
     A                                      EDTWRD('    /  ')
     A                                    79
     A                                      '頁　　次:'
     A                                    90
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A            T#LIN1        96         2
     A                                      SPACEB(001)
     A                                    17
     A                                      '未稅金額'
     A                                      SPACEB(001)
     A                                    33
     A                                      '稅　　額'
     A                                    48
     A                                      '折讓金額'
     A                                    65
     A                                      '筆數'
     A            T#LIN2        96         2
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR114T1D
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#ACNT        10         2
     A                                      SPACEB(001)
     A            T#AMT         11  0     13
     A                                      EDTCDE(J)
     A            T#TAX          9  0     32
     A                                      EDTCDE(J)
     A            T#TOT         10  0     45
     A                                      EDTCDE(J)
     A            T#CONT         3  0     66
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR114T1A
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            T#LIN3        60        12
     A                                      SPACEB(001)
     A                                     2
     A                                      '合計：'
     A                                      SPACEB(001)
     A            T#AMTA        11  0     13
     A                                      EDTCDE(J)
     A            T#TAXA         9  0     32
     A                                      EDTCDE(J)
     A            T#TOTA        11  0     45
     A                                      EDTCDE(1)
     A            T#CONA         3  0     66
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*****************************************************************
     A          R AR114T1M
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    45
     A                                      '無符合之資料!!! '
     A                                      SPACEB(008)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 008
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(ARLIB/ARR102T)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       222      *N     )
     A*%%***********************************************************************
