     A*%%TS  SD  19940912  111645  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR113S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     發票折扣核對清單
     A*            5.DATE-WRITTEN  92/05/31
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR113F1
     A*%%TS  SD  19940912  111645  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'東和鋼鐵企業股份有限公司'
     A                                  1 70'ARR113S'
     A                                  2  2TIME
     A                                  2 28'發票折扣核對清單'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  6 21'客戶代號：'
     A            S#CUNO         6A  B  6 34
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                  6 41'（空白表全部）'
     A                                  8 21'業務員別：'
     A            S#SALE         1A  B  8 34
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                  8 41'（空白表全部）'
     A                                 10 21'發票日期：'
     A            S#IND1         8Y 0B 10 34EDTWRD('    /  /  ')
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 10 45'~~'
     A            S#IND2         8Y 0B 10 48EDTWRD('    /  /  ')
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 12 21'發票廠區：'
     A            S#AREA         1A  B 12 34VALUES(' ' 'H' 'K')
     A                                 12 37'( H:苗栗 K:高雄空白=全部)'
     A                                 14 21'報表內容：'
     A            S#COD1         1A  B 14 34VALUES('1' '2')
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 14 37'( 1:折扣 2:未折扣)'
     A                                 16 21'報表型態：'
     A            S#TYPE         1A  B 16 34VALUES('1' '2')
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                 16 37'( 1:明細表2:彙總表)'
     A                                 18 21'訂單挑選：'
     A            S#CHIC         1A  B 18 34VALUES('1' '2')
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                 18 37'( 1:挑選2:不挑選)'
     A N60                             20 21'訂單編號：'
     A N60        S#ORN1         6A  B 20 34
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A N60        S#ORN2         6A  B 20 41
     A  38                                  DSPATR(PC)
     A  38                                  DSPATR(RI)
     A N60        S#ORN3         6A  B 20 48
     A  39                                  DSPATR(PC)
     A  39                                  DSPATR(RI)
     A N60        S#ORN4         6A  B 20 55
     A  40                                  DSPATR(PC)
     A  40                                  DSPATR(RI)
     A N60        S#ORN5         6A  B 20 62
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A N60        S#ORN6         6A  B 20 69
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A N60        S#ORN7         6A  B 21 34
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A N60        S#ORN8         6A  B 21 41
     A  44                                  DSPATR(PC)
     A  44                                  DSPATR(RI)
     A N60        S#ORN9         6A  B 21 48
     A  45                                  DSPATR(PC)
     A  45                                  DSPATR(RI)
     A N60        S#OR10         6A  B 21 55
     A  46                                  DSPATR(PC)
     A  46                                  DSPATR(RI)
     A N60        S#OR11         6A  B 21 62
     A  47                                  DSPATR(PC)
     A  47                                  DSPATR(RI)
     A N60        S#OR12         6A  B 21 69
     A  48                                  DSPATR(PC)
     A  48                                  DSPATR(RI)
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 29'PF05=列印報表'
     A            S#ERR         70A  O 24  2DSPATR(HI)
