     A*%%TS  SD  19920122  092707  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR101SB
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     應收帳款承購(E-FACTORING)發票異常檢核表
     A*            5.DATE-WRITTEN  92/01/22
     A*            6.DATE-MODIFY
     A*
     A*            * FOR 主管（列印所有已承購未繳款之所有資料）
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR101F1
     A*%%TS  SD  19920122  092707  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARR101SB'
     A                                  2  2TIME
     A                                  2 27'應收帳款承購發票異常檢核表'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  9 22'異常狀況:'
     A                                  9 34'已承購未繳款逾'
     A            S#DATE         2Y 0B  9 51
     A                                  9 54'天'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
