     A                                      UNIQUE
     A          R RAR114F                   TEXT('折讓單統計表')
     A            A4NO           6A         COLHDG('折讓單號')
     A            A4ITEM         2S 0       COLHDG('折讓項次')
     A            A4ACDT         8S         COLHDG('入帳日期')
     A            A4ACNT         1A         COLHDG('折讓原因別')
     A            A4AREA         1A         COLHDG('折讓廠區')
     A            A4CUNM        10A         COLHDG('客戶名稱')
     A            A4ORNO         6A         COLHDG('訂單號碼')
     A            A4INNO        10A         COLHDG('發票號碼')
     A            A4AMT         10S 0       COLHDG('未稅')
     A            A4TAX          8S 0       COLHDG('稅額')
     A            A4TOT         10S 0       COLHDG('金額')
     A*
     A          K A4NO
     A          K A4ITEM
