     A*%%TS  SD  19911128  090932  S02CSF      REL-V4R4M0  5769-PW1
     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    ARR101S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S02CSF
     A*            4.FUNCTION     應收帳款承購(E-FACTORING)發票異常檢核表
     A*            5.DATE-WRITTEN  91/10/21
     A*            5.DATE-MODIFY   91/11/19   BY S02CSF
     A*                            91/11/25   BY S02CSF
     A*           加入已開發票未做承購
 9111A*           加入已開請款單未做承購以及空白表全部
 9112A*           合併已承購未請款，已請款未繳款之欄位
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前畫面')
     A          R AR101F1
     A*%%TS  SD  19911128  090932  S02CSF      REL-V4R4M0  5769-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 24'も　東和鋼鐵企業股份有限公司　も-
     A                                      '
     A                                  1 70'ARR101S'
     A                                  2  2TIME
     A                                  2 27'應收帳款承購發票異常檢核表'
     A            S#DEVN        10A  O  2 70
     A            S#USER        10A  O  3  2
     A                                  9 17'異常狀況:'
     A                                 10 18'A:已開發票或已開請款單未承購逾'
     A            S#DAT3         3Y 0B 10 51EDTCDE(4)
     A                                 10 54'天'
     A                                 11 18'B:已承購未請款或已請款未繳款逾'
     A            S#DAT1         3Y 0B 11 51EDTCDE(4)
     A                                 11 54'天'
     A                                 23  2'操作提示:'
     A                                 23 14'PF3=結束作業'
     A                                 23 30'PF12=回前畫面'
     A            S#ERR         70A  O 24  2DSPATR(HI)
