     A*                                     UNIQUE
     A          R RAR107F                   TEXT('承購託收票明細表')
     A            AFBKID         3A         COLHDG('承購銀行代號')
     A            AFBKNM        10A         COLHDG('承購銀行簡稱')
     A            AFCUNO         6A         COLHDG('客戶代號')
     A            AFCUNM        10A         COLHDG('客戶名稱')
     A            AFRCNO         6A         COLHDG('繳款單號')
     A            AFACDT         6S 0       COLHDG('繳款日期')
     A            AFDUDT         6S 0       COLHDG('票據到期日')
     A            AFRLNO        10A         COLHDG('票據號碼')
     A            AFRAMT        10S 0       COLHDG('票據金額')
     A            AFPLAC         1A         COLHDG('付款地')
     A            AFBANM        16A         COLHDG('付款銀行')
     A            AFPANO        10A         COLHDG('付款帳號')
     A            AFNTCD         1A         COLHDG('兌現碼')
     A*
     A          K AFBKID
     A          K AFCUNO
