     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARRDTL
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     獎勵金補助明細檔
     H*            5.DATE-WRITTEN  101/02/10  2012AR641
     H*            6.UPDATE BY     104/09/14  2015AR953  S00WCJ (0409A)
     H*                             產品代碼3碼擴5碼
     H*
     H*****************************************************************
     A                                      UNIQUE
     A          R RARRDTL                   TEXT('獎勵金補助明細檔')
     A            TLFLAG         1A         COLHDG('處理代碼')
     A            TLAREA         1A         COLHDG('廠區')
     A            TLYYMM         6S 0       COLHDG('代開年月')
     A            TLKIND         1A         COLHDG('補助類別')
     A*                                     1=價格補助2=獎勵金一
     A*                                     3=特別補助
     A            TLCUNO         6A         COLHDG('客戶代號')
0409AA            TLPDNM         5A         COLHDG('產品代號')
     A            TLMETL         8A         COLHDG('鋼種')
     A            TLQTY          9S 0       COLHDG('數量')
     A            TLPRIC         6S 3       COLHDG('單價')
     A            TLAMT          9S 0       COLHDG('金額')
     A            TLYN           1A         COLHDG('確認代開')
     A            TLGLNO        10A         COLHDG('製票號碼')
     A            TLMARK        10A         COLHDG('保留一')
     A            TLMAR1        10S 0       COLHDG('保留二')
     A            TLENTM        10A         COLHDG('建檔人員')
     A            TLENTD         8S 0       COLHDG('建檔日期')
     A            TLENTT         6S 0       COLHDG('建檔時間')
     A            TLUPDM        10A         COLHDG('異動人員')
     A            TLUPDD         8S 0       COLHDG('異動日期')
     A            TLUPDT         6S 0       COLHDG('異動時間')
     A****
     A          K TLAREA
     A          K TLYYMM
     A          K TLKIND
     A          K TLCUNO
     A          K TLPDNM
     A          K TLMETL
