     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARRDCU
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     獎勵金客戶設定檔
     H*            5.DATE-WRITTEN  101/02/10  2012AR641
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A                                      UNIQUE
     A          R RARRDCU                   TEXT('獎勵金客戶設定檔')
     A            RDFLAG         1A         COLHDG('處理代碼')
     A            RDCUNO         6A         COLHDG('客戶編號')
     A            RDPRIC         1A         COLHDG('價格補助')
     A            RDRWRD         1A         COLHDG('獎勵金一')
     A            RDSPCY         1A         COLHDG('特別補助')
     A            RDMARK        10O         COLHDG('保留欄位')
     A            RDENTM        10A         COLHDG('建檔人員')
     A            RDENTD         8S 0       COLHDG('建檔日期')
     A            RDENTT         6S 0       COLHDG('建檔時間')
     A            RDUPDM        10A         COLHDG('異動人員')
     A            RDUPDD         8S 0       COLHDG('異動日期')
     A            RDUPDT         6S 0       COLHDG('異動時間')
     A****
     A          K RDCUNO
