     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARRDMT
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     獎勵金價格補助鋼種設定檔
     H*            5.DATE-WRITTEN  101/02/10  2012AR641
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A                                      UNIQUE
     A          R RARRDMT                   TEXT('獎勵金價格補助鋼種設定檔')
     A            RMFLAG         1A         COLHDG('處理代碼')
     A            RMMETL         8A         COLHDG('鋼種')
     A            RMMARK        10O         COLHDG('保留欄位')
     A            RMENTM        10A         COLHDG('建檔人員')
     A            RMENTD         8S 0       COLHDG('建檔日期')
     A            RMENTT         6S 0       COLHDG('建檔時間')
     A            RMUPDM        10A         COLHDG('異動人員')
     A            RMUPDD         8S 0       COLHDG('異動日期')
     A            RMUPDT         6S 0       COLHDG('異動時間')
     A****
     A          K RMMETL
