     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    ARRDPR
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     獎勵金單價設定檔
     H*            5.DATE-WRITTEN  101/02/10  2012AR641
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A                                      UNIQUE
     A          R RARRDPR                   TEXT('獎勵金價格補助鋼種設定檔')
     A            PRFLAG         1A         COLHDG('處理代碼')
     A            PRNO           1A         COLHDG('補助類別')
     A*                                      1=價格補助 2=獎勵金一
     A*                                      3=特別補助
     A            PRNAME        18O         COLHDG('說明')
     A            PRPRIC         6S 3       COLHDG('單價(公斤)')
     A            PRENTM        10A         COLHDG('建檔人員')
     A            PRENTD         8S 0       COLHDG('建檔日期')
     A            PRENTT         6S 0       COLHDG('建檔時間')
     A            PRUPDM        10A         COLHDG('異動人員')
     A            PRUPDD         8S 0       COLHDG('異動日期')
     A            PRUPDT         6S 0       COLHDG('異動時間')
     A****
     A          K PRNO
