     A****************************************************************
     A*
     A*            WRITE   DATE  103/02/18  S00WCJ (0302A)
     A*
     A****************************************************************
     A          R RARRETN                   TEXT('Àç·~°h´ÚÀÉ')
     A                                      PFILE(ARRETN)
     A*
     A          K ANRTDT                    DESCEND
     A          K ANRTNO                    DESCEND
     A          K ANITEM
