     A****************************************************************
     A*
     A*            UPDATE  DATE  100/02/14 2011AR594  S00WCJ (0002A)
     A*
     A****************************************************************
     A          R RARRETN                   TEXT('Àç·~°h´ÚÀÉ')
0002AA*                                     PFILE(DALIB/ARRETN)
0002AA                                      PFILE(ARRETN)
     A*
     A          K ANCUNO
     A          K ANRTDT                    DESCEND
     A          K ANRTNO                    DESCEND
     A          K ANITEM
