     A                                      UNIQUE
     A          R RARRETN                   TEXT('營業退款檔')
     A            ANFLAG         1A         COLHDG('處理代碼')
     A            ANRTNO         6A         COLHDG('退款編號')
     A            ANITEM         2S 0       COLHDG('退款項次')
     A            ANCUNO         6A         COLHDG('客戶代號')
     A            ANCUNM        10O         COLHDG('客戶名稱')
     A            ANORNO         6A         COLHDG('訂單編號')
     A            ANAREA         1A         COLHDG('退款廠區')
     A            ANDECD         1A         COLHDG('刪除碼')
     A            ANDEDT         8S 0       COLHDG('刪除日期')
     A            ANDC           1A         COLHDG('借貸方')
     A            ANUSTP         2A         COLHDG('款項別')
     A            ANACNO         4A         COLHDG('會計科目')
     A            ANDPNO         4A         COLHDG('部門代號')
     A            ANRLNO        10A         COLHDG('相關號碼')
     A            ANDUDT         8S 0       COLHDG('到期日')
     A            ANCSNM        10O         COLHDG('對象別')
     A            ANDSC1        60O         COLHDG('摘要')
     A            ANDSC2        12O         COLHDG('輔助摘要')
     A            ANSAID         2A         COLHDG('領款人')
     A            ANRTUS        10A         COLHDG('退款人員')
     A            ANRTDT         8S 0       COLHDG('退款日期')
     A            ANRTTM         6S 0       COLHDG('退款時間')
     A            ANAAMT         9S 0       COLHDG('退款金額')
     A            ANFL01         1A         COLHDG('營業確認碼')
     A            ANCFUS        10A         COLHDG('營業確認人員')
     A            ANCFDT         8S 0       COLHDG('營業確認日期')
     A            ANFL02         1A         COLHDG('營業列印碼')
     A            ANFL03         1A         COLHDG('過入製票碼')
     A            ANTRUS        10A         COLHDG('過入人員')
     A            ANTRDT         8S 0       COLHDG('過入日期')
     A            ANGLNO        10A         COLHDG('製票號碼')
     A            ANRESV        20A         COLHDG('預留')
     A****
     A          K ANRTNO
     A          K ANITEM
