     A*%%TS  SD  19861007  140543  S02CLJ      REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19861007  140543  S02CLJ      REL-V3R7M0  5716-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            COMP          35A  O  1 23
     A                                  1 70'ARS051'
     A                                  2  2TIME
     A            DEVNM         10A  O  2 70
     A                                  3 25'もも　管理報表列印續一　もも'
     A                                  5 17'作業項目'
     A                                      DSPATR(UL)
     A                                  5 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  5 53'畫面代號'
     A                                      DSPATR(UL)
     A                                  7 21'11 :   部門別繳款明細表（業務）A-
     A                                      RR055S'
     A                                  8 21'12 :   存入保證金餘額明細表　　C-
     A                                      CR008S'
     A                                  9 21'13 :   地磅與營業銷貨重量差異  A-
     A                                      RR066S'
     A                                 10 21'14 :   客戶磅單重量差異表    A-
     A                                      RP067S'
     A                                 11 21'15 :   訂單別繳款明細表      A-
     A                                      RR068S'
     A                                 12 21'16 :   訂單別出貨及發票明細表  A-
     A                                      RR069S'
     A                                 13 21'17 :   組立加工之發票銷貨明細表A-
     A                                      RR065R'
     A                                 19 21'70 :   印表機控制螢幕          P-
     A                                      RTMENU'
     A                                 20 21'80 :   回上一螢幕              A-
     A                                      RS000'
     A                                 21 21'90 :   結束作業                S-
     A                                      IGNOFF'
     A                                 22 14'操作步驟:'
     A                                 22 27'１）輸入作業項目:'
     A            OPTION         2Y 0I 22 47DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 23 27'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 24  2
