     A*%%TS  SD  19870727  154018  S02CLJ      REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19870727  154018  S02CLJ      REL-V3R7M0  5716-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            COMP          35A  O  1 23
     A                                  1 70'ARS020'
     A                                  2  2TIME
     A                                  3 27'もも　開立發票作業　もも'
     A            DEVNM         10A  O  3 70
     A                                  5 17'作業項目'
     A                                      DSPATR(UL)
     A                                  5 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  5 53'畫面代號'
     A                                      DSPATR(UL)
     A                                  7 22'1 :   發票每月起迄號碼維護    AR-
     A                                      E021S'
     A                                  8 22'2 :   隨車發票開立作業        AR-
     A                                      P002S'
     A                                  9 22'3 :   發票維護作業            AR-
     A                                      E001S'
     A                                 10 22'4 :   人工發票開立作業      AR-
     A                                      E030R'
     A                                 11 22'5 :   人工發票開立銷貨明細沖銷AR-
     A                                      E032R'
     A                                 12 22'6 :   發票繳款金額轉出作業　  AR-
     A                                      E025S'
     A                                 13 22'7 :   發票作廢明細表　　　　  AR-
     A                                      R040S'
     A                                 14 22'8 :   隔月換發票磅單處理　　  AR-
     A                                      E010S'
     A                                 15 22'9 :   外銷磅單彙總發票開立作業AR-
     A                                      P004S'
     A                                 16 21'10 :   新版發票列印作業        A-
     A                                      RR075P'
     A                                 18 21'70 :   印表機控制螢幕          P-
     A                                      RTMENU'
     A                                 19 21'80 :   回上一螢幕              R-
     A                                      ETURN'
     A                                 20 21'90 :   結束作業                S-
     A                                      IGNOFF'
     A                                 22 14'操作步驟:'
     A                                 22 27'１）輸入作業項目:'
     A            OPTION         2Y 0I 22 47DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 23 27'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 24  2
