     A*%%TS  SD  19811106  173016  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19811106  173016  VIN         REL-V2R1M1  5738-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS030'
     A            COMP          35A  O  1 23
     A                                  2 26'もも　開立請款單作業　もも'
     A                                  4 17'作業項目'
     A                                      DSPATR(UL)
     A                                  4 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  4 53'畫面代號'
     A                                      DSPATR(UL)
     A                                  6 22'1 :   請款單維護              AR-
     A                                      E003S'
     A                                  7 22'2 :   請款單列印              AR-
     A                                      R001S'
     A                                  8 22'3 :   客戶別請、領款提示表    AR-
     A                                      R031S'
     A                                  9 22'4 :   業務員別未請款明細表    AR-
     A                                      R002S'
     A                                 10 22'5 :   客戶別請、領款查詢      AR-
     A                                      Q004S'
     A                                 11 22'6 :   請款單列印－電腦傳真    AR-
     A                                      R001SA'
     A                                 12 22'7 :   新版營業繳款輸入程式    AR-
     A                                      E037R'
     A                                 13 22'8 :   已確認營業繳款明細表    AR-
     A                                      R070P'
     A                                 14 22'9 :   未確認營業繳款明細表  AR-
     A                                      R071P'
     A                                 15 21'10 :   已過入營業繳款明細表  A-
     A                                      RR073P'
     A                                 16 21'11 :   已過財會營業繳款查詢  A-
     A                                      RE038R'
     A                                 18 21'70 :   印表機控制螢幕          P-
     A                                      RTMENU'
     A                                 19 21'80 :   回上一螢幕              R-
     A                                      ETURN'
     A                                 20 21'90 :   結束作業                S-
     A                                      IGNOFF'
     A                                 21 14'操作步驟:'
     A                                 21 27'１）輸入作業項目:'
     A            OPTION         2Y 0I 21 47DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 22 27'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 23  2
