     A*%%TS  SD  19820902  175556  JEFF        REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19820902  175556  JEFF        REL-V2R1M1  5738-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS000'
     A            COMP          35A  O  1 24
     A                                  3 25'も　應收帳款作業（營業部）　も'
     A                                  5 17'作業項目'
     A                                      DSPATR(UL)
     A                                  5 54'畫面代號'
     A                                      DSPATR(UL)
     A                                  5 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  7 22'1 :  單據輸入、更正及清單列印   -
     A                                      ARS010'
     A                                  8 22'2 :  開立發票作業               -
     A                                      ARS020'
     A                                  9 22'3 :  開立請款單作業             -
     A                                      ARS030'
     A                                 10 22'4 :  資料查詢作業               -
     A                                      ARS040'
     A                                 11 22'5 :  管理報表列印               -
     A                                      ARS050'
     A                                 12 22'6 :  預收貨款作業　             -
     A                                      ARS060'
     A                                 13 22'7 :  國內信用狀管理作業         -
     A                                      LLS100'
     A                                 14 22'8 :  三角貿易作業               -
     A                                      ARS080'
     A                                 15 22'9 :  異常處理作業               -
     A                                      ARS090'
     A                                 17 21'70 :  印表機控制螢幕            -
     A                                       PRTMENU'
     A                                 18 21'80 :  回上一螢幕                -
     A                                       RETURNP'
     A                                 19 21'90 :  結束作業                  -
     A                                       SIGNOFF'
     A                                 21 14'操作步驟:'
     A                                 21 27'１）輸入作業項目:'
     A            OPTION         2Y 0I 20 47DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 22 27'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 23  2
