     A*%%TS  SD  19820902  181024  JEFF        REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19820902  181024  JEFF        REL-V2R1M1  5738-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS060'
     A            COMP          35A  O  1 23
     A                                  3 27'もも　預收貨款作業　もも'
     A                                  5 17'作業項目'
     A                                      DSPATR(UL)
     A                                  5 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  5 53'畫面代號'
     A                                      DSPATR(UL)
     A                                  7 22'1 :   預收貨款餘額查詢          -
     A                                      ARQ003S'
     A                                  8 22'2 :   預收貨款當期異動彙總查詢  -
     A                                      CCQ007S'
     A                                  9 22'3 :   預收貨款當期異動明細查詢  -
     A                                      CCQ008S'
     A                                 10 22'4 :   預收貨款發票明細表        -
     A                                      ARR003S'
     A                                 11 22'5 :   預收貨款當期異動彙總表　  -
     A                                      CCR009S'
     A                                 12 22'6 :   預收貨款當期異動明細表　  -
     A                                      CCR010S'
     A                                 13 22'7 :   客戶別預收貨款管理表　　  -
     A                                      CCR015S'
     A                                 14 22'8 :   客戶別預收貨款報表－查帳用-
     A                                      CCR016S'
     A                                 15 22'9 :   預收貨款傳輸作業（單筆）  -
     A                                      ARP027S'
     A                                 19 21'70 :   印表機控制螢幕          P-
     A                                      RTMENU'
     A                                 20 21'80 :   回上一螢幕              A-
     A                                      RS000'
     A                                 21 21'90 :   結束作業                S-
     A                                      IGNOFF'
     A                                 22 14'操作步驟:'
     A                                 22 27'１）輸入作業項目:'
     A            OPTION         2Y 0I 22 47DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 23 27'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 24  2
