     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS090'
     A            COMP          35A  O  1 23
     A                                  2 26'も　應收帳款異常處理作業　も'
     A                                  4 17'作業項目'
     A                                      DSPATR(UL)
     A                                  4 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  4 53'程式代號'
     A                                      DSPATR(UL)
     A                                  6 22'1 :   解除發票列印碼　　　    AR-
     A                                      E031R'
     A                                  7 22'2 :   傳輸苗栗廠應收相關資料  AR-
     A                                      P020PH'
     A                                  8 22'3 :   傳輸桃園廠應收相關資料  AR-
     A                                      P020PT'
     A                                  9 22'4 :   傳輸高雄廠應收相關資料  AR-
     A                                      P020PK'
     A                                 10 22'5 :   重開上月最後一日發票    AR-
     A                                      P044P'
     A                                 11 22'6 :   重開上月最後一日外銷發票AR-
     A                                      P057P'
     A                                 12 22'7 :   折讓退回維護作業異常版  AR-
     A                                      E034R'
     A                                 13 22'8 :   已確認折讓單更改確認日期AR-
     A                                      E036R'
     A                                 14 22'9 :   發票維護作業異常版      AR-
     A                                      E035R'
     A                                 15 21'10 :   移至各廠處理作業        A-
     A                                      RP060P'
     A                                 17 21'70 :   印表機控制螢幕          P-
     A                                      RTMENU'
     A                                 18 21'80 :   回上一螢幕              R-
     A                                      ETURN'
     A                                 19 21'90 :   結束作業                S-
     A                                      IGNOFF'
     A                                 21 14'操作步驟:'
     A                                 21 27'１）輸入作業項目:'
     A            OPTION         2Y 0I 21 47DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 22 27'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 23  2
