     A*%%TS  SD  19881115  093929  S02CLJ      REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19881115  093929  S02CLJ      REL-V3R7M0  5716-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS121'
     A            COMP          35A  O  1 23
     A                                  2 21'も單據輸入、更正及清單列印（續一+
     A                                      ）'
     A                                  4 16'作業項目'
     A                                      DSPATR(UL)
     A                                  4 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  4 55'畫面代號'
     A                                      DSPATR(UL)
     A                                  6 20'12 :   發票維護作業異常處理版 -
     A                                        ARE035R'
     A                                  7 20'13 :   營業繳款過入財會作業     -
     A                                        ARP058P'
     A                                  8 20'14 :   營業繳款過入財會還原   -
     A                                        ARP059P'
     A                                 19 20'70 :   印表機控制螢幕           -
     A                                        PRTMENU'
     A                                 20 20'80 :   回上一螢幕               -
     A                                        ARS120'
     A                                 21 20'90 :   結束作業                 -
     A                                        SIGNOFF'
     A                                 22 13'操作步驟:'
     A                                 22 26'１）輸入作業項目:'
     A            OPTION         2Y 0I 22 46DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 23 26'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 24  2
     A                                  9 20'15 :   客戶暫收款維護作業       -
     A                                        ARE043R'
