     A*%%TS  SD  19881130  162035  S02CLJ      REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19881130  162035  S02CLJ      REL-V3R7M0  5716-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            COMP          35A  O  1 24
     A                                  1 70'ARS170'
     A                                  2  2TIME
     A            DEVNM         10A  O  2 70
     A                                  2 30'も管理報表列印（一）も'
     A                                  4 19'作業項目'
     A                                      DSPATR(UL)
     A                                  4 30'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  4 54'畫面代號'
     A                                      DSPATR(UL)
     A                                  5 24'1 :   客戶別應收票據明細表   ARR-
     A                                      014S'
     A                                  6 24'2 :   到期日應收票據明細表   ARR-
     A                                      017S'
     A                                  7 24'3 :   保證票據明細表         ARR-
     A                                      015S'
     A                                  8 24'4 :   票據票齡分析表         ARR-
     A                                      016S'
     A                                  9 24'5 :   當日託收銀行票據統計表 ARR-
     A                                      018S'
     A                                 10 24'6 :   經管會應收帳齡分析表   ARR-
     A                                      079P'
     A                                 11 24'7 :   銷貨帳款應收查詢作業   ARQ-
     A                                      014R'
     A                                 12 24'8 :   未開立發票明細表       ARR-
     A                                      036P'
     A                                 16 23'70 :   印表機控制螢幕         PR-
     A                                      TMENU'
     A                                 17 23'80 :   回上一螢幕             AR-
     A                                      S100'
     A                                 18 23'90 :   結束作業               SI-
     A                                      GNOFF'
     A                                 20 16'操作步驟:'
     A                                 20 29'１）輸入作業項目:'
     A            OPTION         2Y 0I 20 49DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 21 29'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 23  2
     A                                 13 24'9 :   信用狀押匯提示明細表   ARR-
     A                                      081P'
     A                                 14 23'10 :   信用狀押匯月報表       AR-
     A                                      R082P'
