     A*%%TS  SD  19811109  162939  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19811109  162939  VIN         REL-V2R1M1  5738-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS110'
     A            COMP          35A  O  1 24
     A                                  3 25'も　基本資料建檔及清冊列印　も'
     A                                  5 18'作業項目'
     A                                      DSPATR(UL)
     A                                  5 30'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  5 53'畫面代號'
     A                                      DSPATR(UL)
     A                                  7 23'1 :   往來銀行代號輸入       ARE-
     A                                      023S'
     A                                  8 23'2 :   銀行帳號輸入           ARE-
     A                                      022S'
     A                                  9 23'3 :   資金代號輸入           ARE-
     A                                      024S'
     A                                 11 23'4 :   銀行帳戶一覽表         ARR-
     A                                      022S'
     A                                 12 23'5 :   銀行代號名稱對照表     ARR-
     A                                      023S'
     A                                 13 23'6 :   資金代號名稱對照表     ARR-
     A                                      024S'
     A                                 14 23'7 :   休假日期維護　　　     ARD-
     A                                      FU01'
     A                                 16 22'70 :   印表機控制螢幕         PR-
     A                                      TMENU'
     A                                 17 22'80 :   回上一螢幕             AR-
     A                                      S100'
     A                                 18 22'90 :   結束作業               SI-
     A                                      GNOFF'
     A                                 20 15'操作步驟:'
     A                                 20 28'１）輸入作業項目:'
     A            OPTION         2Y 0I 20 48DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 21 28'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 23  2
