     A*%%TS  SD  19871014  100641  S02CLJ      REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19871014  100641  S02CLJ      REL-V3R7M0  5716-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            COMP          35A  O  1 23
     A                                  1 70'ARS150'
     A                                  2  2TIME
     A                                  2 27'もも　傳票代開作業　もも'
     A            DEVNM         10A  O  2 70
     A                                  4 18'作業項目'
     A                                      DSPATR(UL)
     A                                  4 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  4 53'畫面代號'
     A                                      DSPATR(UL)
     A                                  5 23'1 :   銷貨收入傳票代開       ARP-
     A                                      011S'
     A                                  6 23'2 :   調整單傳票代開 22整月ARP-
     A                                      012S'
     A                                  7 23'3 :   折讓退回傳票代開       ARP-
     A                                      013S'
     A                                  8 23'4 :   預收貨款傳票代開       ARP-
     A                                      014S'
     A                                  9 23'5 :   銷項稅額傳票代開       ARP-
     A                                      015S'
     A                                 10 23'6 :   應收票據兌現傳票代開   ARP-
     A                                      016S'
     A                                 11 23'7 :   應收票據退回傳票代開   ARP-
     A                                      017S'
     A                                 12 23'8 :   營業繳款收入傳票代開   ARP-
     A                                      018S'
     A                                 13 23'9 :   非營業繳款收入傳票代開 ARP-
     A                                      019S'
     A                                 14 22'10 :   票據退回代開－其他科目 AR-
     A                                      P017P'
     A                                 15 22'11 :   銷貨代開傳票還原作業   AR-
     A                                      P046P'
     A                                 16 22'12 :   調整代開傳票還原作業   AR-
     A                                      P047P'
     A                                 18 22'70 :   印表機控制螢幕         PR-
     A                                      TMENU'
     A                                 19 22'80 :   回上一螢幕             AR-
     A                                      S100'
     A                                 20 22'90 :   結束作業               SI-
     A                                      GNOFF'
     A                                 22 15'操作步驟:'
     A                                 22 28'１）輸入作業項目:'
     A            OPTION         2Y 0I 22 48DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 23 28'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 24  2
     A                                 17 22'13 :   營業繳款傳票還原作業   AR-
     A                                      P061P'
