     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    ARS202S
     A*            2.PROGRAM-TYPE  DSPF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     折讓單區間列印副程式
     A*            5.DATE-WRITTEN  108/05/08 2019AR
     A*
     A*****************************************************************
     A                                      PRINT
     A                                      INDARA
     A                                      CF03(03 '結束作業')
     A                                      CF12(12 '回前螢幕')
     A                                      CF10(10 '執行鍵')
     A          R AR01F1
     A                                      ASSUME
     A                                  1  2' '
     A          R AR01F2
     A                                      OVERLAY
     A                                      WINDOW(7 20 10 48)
     A                                      WDWBORDER((*COLOR PNK) +
     A                                      (*CHAR '+-+||+-+'))
     A                                  2  1' '
     A                                  4  3'折讓單號:'
     A            S#NOS          6   B    +1
     A  41                                  DSPATR(PC RI)
     A                                    +1'~'
     A            S#NOE          6   B    +1
     A  42                                  DSPATR(PC RI)
     A                                  7  2'操作提示:' COLOR(BLU)
     A                                    +1'F3,F12=回前頁'
     A                                      COLOR(BLU)
     A            S#ERR         42      9  2
