     A*%%TS  SD  19811201  110929  VIN         REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R AR00F1
     A*%%TS  SD  19811109  162830  VIN         REL-V2R1M1  5738-PW1
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A            DEVNM         10A  O  2 70
     A                                  2  2TIME
     A                                  1 70'ARS999'
     A            COMP          35A  O  1 24
     A                                  3 25'も　應收帳款作業（財會部）　も'
     A                                  5 16'作業項目'
     A                                      DSPATR(UL)
     A                                  5 29'作　　業　　名　　稱'
     A                                      DSPATR(UL)
     A                                  5 55'畫面代號'
     A                                      DSPATR(UL)
     A                                  7 21'1 :   台北（應收帳款作業）　    -
     A                                       ARS100'
     A                                  8 21'2 :   台中（應收帳款作業）　    -
     A                                       ARS100'
     A                                  9 21'3 :   林口（應收帳款作業）　    -
     A                                       ARS100'
     A                                 16 20'70 :   印表機控制螢幕           -
     A                                        PRTMENU'
     A                                 17 20'80 :   回上一螢幕               -
     A                                        PRTMENU'
     A                                 18 20'90 :   結束作業                 -
     A                                        SIGNOFF'
     A                                 20 13'操作步驟:'
     A                                 20 26'１）輸入作業項目:'
     A            OPTION         2Y 0I 20 46DSPATR(UL)
     A                                      RANGE(1 99)
     A                                      CHECK(ME)
     A                                 21 26'２）按�訄鶡磃釓銦C'
     A            MSG           50A  O 23  2
