     A          R RARSAID                   TEXT('業務員基本資料檔')
     A            SAACD          1A         COLHDG(' ACD使用碼')
     A            SARVID         2A         COLHDG('業務員代號')
     A            SANAME        10O         COLHDG('業務員姓名')
     A            SALOCA         1A         COLHDG('廠區別')
     A            SADEPT         4A         COLHDG('部門代號')
     A            SAWKNO         4A         COLHDG('工作編號')
     A            SABK20        20A         COLHDG('空白')
     A            SAUPDD         8S 0       COLHDG('異動日期')
     A            SAUPDT         6S 0       COLHDG('異動時間')
     A            SAUPDR        10A         COLHDG('異動者')
     A            SAUSID        10A         COLHDG('使用者代號')
     A*
     A          K SARVID
