     A          R AXREC                     TEXT('¾P³fª¬ªp²Î­pÀÉ')
                                            PFILE(ARSTTX)
     A          K AXDEPT
     A          K AXRVID
     A          K AXCUNO
     A          K AXORNO
