     A                                      UNIQUE
     A          R ARREC                     TEXT('應收帳款統計檔')
                                            PFILE(ARSTAT)
     A          K ARCUNO
     A          K ARORNO
