     A                                      UNIQUE
     A          R AXREC                     TEXT('銷貨應收狀況檔')
     A            AXCUNO         6A         COLHDG('客戶編號')
     A            AXORNO         6A         COLHDG('訂單號碼')
     A            AXSAID         2A         COLHDG('出貨業務')
     A            AXRVID         2A         COLHDG('收款業務')
     A            AXDEPT         4A         COLHDG('營業單位')
     A            AXTXCD         4A         COLHDG('單據類別')
     A            AXTXNO         8A         COLHDG('磅單編號')
     A            AXTXDT         8P 0       COLHDG('磅單日期')
     A            AXTXAM        11P 0       COLHDG('出貨金額')
     A            AXINNO        10A         COLHDG('發票號碼')
     A            AXAPNO         6A         COLHDG('請款單號')
     A            AXRVNO         6A         COLHDG('繳款單號')
     A            AXRVDT         8P 0       COLHDG('繳款日期')
     A            AXRVLD         8P 0       COLHDG('繳款最後兌現日')
     A            AXORLD         8P 0       COLHDG('合約最後兌現日')
     A            AXINRT         6P 5       COLHDG('發票兌現比率')
     A            AXDELY         5P 0       COLHDG('延誤天數')
     A            AXINAM        11P 0       COLHDG('應收金額')
     A            AXINDU         5P 0       COLHDG('應收帳齡')
     A            AXSTCD         1A         COLHDG('應收狀況')
     A            AXRESV        10O         COLHDG('保留碼')
     A*
     A          K AXTXCD
     A          K AXTXNO
     A          K AXINNO
     A*
     A* =============================================================
     A*
     A*           AXSTCD 應收狀況碼：
     A*                                '1' 未開發票
     A*                                '2' 未請款
     A*                                '3' 未繳款
     A*                                '4' 未兌現
     A*                                '*' 多筆繳款
     A*
     A*           AXRVLD 繳款最後兌現日為繳款書內最後兌現的日期
     A*           AXORLD 合約最後兌現日為繳款日期加上合約書之票期
     A*
