     A*                                     UNIQUE
     A          R RARTFITX                  TEXT('運費平均單價檔')
     A            AXSALC         1A         COLHDG('內外銷別')
     A*                                     D:表內銷
     A*                                     E:表外銷
     A            AXCOUN         2A         COLHDG('國別')
     A            AXYYMM         6S 0       COLHDG('年月別')
     A            AXFACT         1A         COLHDG('廠區別')
     A            AXNAME         3A         COLHDG('產品類別')
     A            AXSTND         1A         COLHDG('規範別')
     A            AXQULT         8A         COLHDG('鋼種')
     A            AXSPE1         5A         COLHDG(' H/T/D ')
     A            AXSPE2         5A         COLHDG(' B/W')
     A            AXSPE3         3A         COLHDG(' T1')
     A            AXSPE4         3A         COLHDG(' T2')
     A            AXPRIZ        10S 5       COLHDG('單位運費 NT/KG')
     A            AXTWGT         9S 3       COLHDG('重量（噸）')
     A          K AXSALC
     A          K AXCOUN
     A          K AXYYMM
     A          K AXFACT
     A          K AXNAME
     A          K AXSTND
     A          K AXQULT
     A          K AXSPE1
     A          K AXSPE2
