     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARTYPE
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     反傾銷實際尺寸對照檔　　　　　　
     A*            5.DATE-WRITTEN  91/11/12
     A*
     A*****************************************************************
     A*
     A                                      UNIQUE
     A          R RARTYPE                   TEXT('實際尺寸對照檔')
     A            AEHTD          3A         COLHDG('H/T/D')
     A            AEBW           3A         COLHDG('B/W')
     A            AET1           3A         COLHDG('T1')
     A            AET2           3A         COLHDG('T2')
     A            AETYP          3A         COLHDG('TYPE')
     A          K AEHTD
     A          K AEBW
