     A*****************************************************************
     A*
     A*               >>   PROGRAM INTRODUCTION   <<
     A*
     A*            1.PROGRAM-ID    ARVRDW
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S02YSH
     A*            4.FUNCTION     電子商務-成品磅單明細檔
     A*            5.DATE-WRITTEN  93/06/23
     A*            6.UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                             產品代碼3碼擴5碼
     A*
     A*****************************************************************
     A*                                     UNIQUE
     A          R RARVRDW                   TEXT('成品磅單明細檔')
     A            AVFLAG         1A         COLHDG('處理代號')
     A            AVENTD         8S 0       COLHDG('過磅日期')
     A            AVAREA         1A         COLHDG('地區別')
     A            AVVNO1         2A         COLHDG('進出別')
     A            AVVNO2         5S 0       COLHDG('磅單號碼')
     A            AVSQIT         2S         COLHDG('磅單項次')
     A            AVSALE         2A         COLHDG('出貨業務')
     A            AVORNO         9A         COLHDG('訂單編號')
     A            AVDVNO         9A         COLHDG('交單編號')
     A            AVOTNO         6A         COLHDG('出單編號')
     A            AVIPTM         3S 0       COLHDG('出貨明細項次')
     A            AVCTNO        10A         COLHDG('客戶工程編號')
     A            AVCTNM        22O         COLHDG('客戶工程名稱')
     A            AVBYOD        16A         COLHDG('客戶採購單號')
0409AA            AVNAME         5A         COLHDG('產品類別')
     A            AVSTND         1A         COLHDG('規範別')
     A            AVQULT         8A         COLHDG('鋼種')
     A            AVSPE1         5A         COLHDG(' H/T/D')
     A            AVSPE2         5A         COLHDG(' B/W')
     A            AVSPE3         3A         COLHDG(' T1 ')
     A            AVSPE4         3A         COLHDG(' T2 ')
     A            AVSPE5         6A         COLHDG('長度')
     A            AVUNIT         1A         COLHDG('長度單位')
     A            AVQCCD         1A         COLHDG('品質等級')
     A            AVUPRC         5S 3       COLHDG('訂單單價')
     A            AVPNUM         5S 0       COLHDG('捆（支）數')
     A            AVSTDW         9S 0       COLHDG('理論重')
     A            AVCUNO         6A         COLHDG('客戶編號')
     A            AVCUNM        12O         COLHDG('客戶名稱')
     A            AVDEST        40O         COLHDG('指送地點')
     A            AVCHKW        40O         COLHDG('會磅地點')
     A            AVTFCP         1A         COLHDG('貨運行')
     A            AVCRNO        10A         COLHDG('車號')
     A            AVCRNM        10O         COLHDG('車行')
     A            AVDTOT         8S 0       COLHDG('出廠日期')
     A            AVTMOT         4A         COLHDG('出廠時間')
     A            AVPASD         8S 0       COLHDG('過帳日期')
     A            AVPAST         6S 0       COLHDG('過帳時間')
     A            AVASNO         6S 0       COLHDG('委送單號')
     A            AVSEQN         6S 0       COLHDG('資料處理序號')
     A            AVFILE         6S 0       COLHDG('檔案序號')
     A            AVVNNO        10A         COLHDG('客戶統編')
L9503A            AVURFL         1A         COLHDG('單價不符碼')
     A          K AVVNNO
     A          K AVFILE
     A          K AVSEQN
