     A                                      UNIQUE
     A          R RARWF02                   TEXT('µo²¼©ú²ÓÀÉ')
                                            PFILE(ARWF02)
     A****
     A          K W2NO
     A          K W2ACNT
     A          S W2DECD                    COMP(NE 'D')
