     A                                      UNIQUE
     A          R RVREC                     TEXT('繳款明細檔')
     A            RVNO           6A         COLHDG('繳款編號')
     A            RVITEM         2S 0       COLHDG('項次')
     A            RVDATE         8S 0       COLHDG('繳款日期')
     A            RVCUNO         6A         COLHDG('客戶編號')
     A            RVNTNO        10A         COLHDG('票據號碼')
     A            RVDUDT         8S 0       COLHDG('到期日')
     A            RVRAMT        11P 0       COLHDG('收款金額')
     A            RVVNO2         7A         COLHDG('票據傳票號碼')
     A*
     A          K RVNO
     A          K RVITEM
