     A                                      UNIQUE
     A          R INREC                     TEXT('發票主檔')
     A            INNO          10A         COLHDG('發票號碼')
     A            INCUNO         6A         COLHDG('客戶編號')
     A            INORNO         6A         COLHDG('訂單號碼')
     A            ININDT         8S 0       COLHDG('發票日期')
     A            INAAMT        11P 0       COLHDG('出貨金額')
     A            INRCNO         6A         COLHDG('繳款單號')
     A****
     A          K INNO
