     A                                      UNIQUE
     A          R BREC                      TEXT('客戶預收貨款餘額暫存檔')
     A            BFLAG          1A         COLHDG('處理代碼')
     A            BORNO          6A         COLHDG('訂單編號')
     A            BCUNO          6A         COLHDG('客戶編號')
     A            BCUNM         10O         COLHDG('客戶餘額')
     A            BPBAL         11P 0       COLHDG('前期餘額')
     A            BAAMT         11P 0       COLHDG('本期增加')
     A            BBAMT         11P 0       COLHDG('本期減少')
     A            BNBAL         11P 0       COLHDG('本期餘額')
     A            BAMT1         11P 0       COLHDG('保留金額１')
     A            BAMT2         11P 0       COLHDG('保留金額２')
     A            BAMT3         11P 0       COLHDG('保留金額３')
     A            BRESV          6A         COLHDG('保留碼')
     A          K BORNO
