     A                                      UNIQUE
     A          R ACREC                     TEXT('往來帳號檔')
     A            ACTYPE         1A         COLHDG('存款別')
     A* Ａ－甲存  Ｂ－活存  Ｔ－定存  Ｃ－虛設帳號
     A*
     A            ACCURR         1A         COLHDG('幣別Ｄ')
     A* Ｄ－馬克  Ｊ－日幣  Ｎ－台幣  Ｕ－美金  Ａ－奧大利幣
     A*
     A            ACACNO         8A         COLHDG('帳號ＩＤ')
     A            ACBNAM        10O         COLHDG('帳號簡稱')
     A            ACNAME        22O         COLHDG('帳號全稱')
     A            ACAREA         1A         COLHDG('廠區別')
     A            ACBAID         7A         COLHDG('銀行代號')
     A            ACOLID        10A         COLHDG('舊帳號ＩＤ')
     A            ACRESV         4A         COLHDG('保留碼')
     A*
     A          K ACTYPE
     A          K ACCURR
     A          K ACACNO
