     A                                      UNIQUE
     A          R BAREC                     TEXT('往來銀行檔')
     A            BAID1          3A         COLHDG('總行ＩＤ')
     A            BAID2          4A         COLHDG('分行ＩＤ')
     A            BABNAM        10O         COLHDG('銀行簡稱')
     A            BANAME        22O         COLHDG('銀行全稱')
     A            BAAREA         2A         COLHDG('地區別')
     A            BARESV        23A         COLHDG('保留碼')
     A*
     A          K BAID1
     A          K BAID2
