     A                                      UNIQUE
     A          R CAREC                     TEXT('資金代號檔')
     A            CAAMCD         4A         COLHDG('資金代號')
     A            CANAME        32O         COLHDG('資金全稱')
     A            CARESV        12A         COLHDG('保留碼')
     A*
     A          K CAAMCD
