     A                                      UNIQUE
     A          R CUREC                     TEXT('客戶請領款提示檔')
     A            CUDATE         8S 0       COLHDG('日期')
     A            CUCUNO         6A         COLHDG('客戶編號')
     A            CUORNO         6A         COLHDG('訂單編號')
     A            CUCUNM        10O         COLHDG('客戶名稱')
     A            CURAMT        11P 0       COLHDG('上月應收帳款')
     A            CULAMT        11P 0       COLHDG('本月應收帳款')
     A            CURVID         2A         COLHDG('收款業務員')
     A            CUAREA         1A         COLHDG('廠區')
     A            CUFL01         1A         COLHDG('請款碼')
     A            CUFL02         1A         COLHDG('領款碼')
     A            CURESV        20A         COLHDG('保留碼')
     A*
     A          K CUDATE
     A          K CUCUNO
     A          K CUORNO
