     A                                      UNIQUE
     A          R CUREC                     TEXT('客戶請領提示檔')
                                            PFILE(CURCPR)
     A****
     A          K CUDATE
     A          K CURVID
     A          K CUCUNO
     A          K CUORNO
