     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/14  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R RDELDTL                   TEXT('發票作廢紀錄明細檔')
     A            DLFLAG         1A         COLHDG('處理代碼')
     A            DLIVNO        10A         COLHDG('發票號碼')
     A            DLWTNO         8A         COLHDG('磅單編號')
     A            DLITEM         2S 0       COLHDG('磅單項次')
     A            DLDECD         1A         COLHDG('作廢碼')
     A            DLDEDT         8S 0       COLHDG('作廢日期')
     A            DLAREA         1A         COLHDG('發票開立廠區')
     A            DLINDT         8S 0       COLHDG('舊發票日期')
0409AA            DLPDN1         5A         COLHDG('舊品名')
     A            DLQTY1        10S 0       COLHDG('舊數量')
     A            DLPRC1         5S 3       COLHDG('舊單價')
     A            DLAMT1        12S 0       COLHDG('舊金額')
0409AA            DLPDN2         5A         COLHDG('新品名')
     A            DLQTY2        10S 0       COLHDG('新數量')
     A            DLPRC2         5S 3       COLHDG('新單價')
     A            DLAMT2        12S 0       COLHDG('新金額')
     A            DLTAX2         9S 0       COLHDG('新稅額')
     A            DLAAMT        12S 0       COLHDG('新應收金額')
     A            DLQTY3        10S 0       COLHDG('差異數量')
     A            DLPRC3         5S 3       COLHDG('差異單價')
     A            DLAMT3        12S 0       COLHDG('差異金額')
     A            DLUPUS        10A         COLHDG('異動人員')
     A            DLUPDT         8S 0       COLHDG('異動日期')
     A            DLUPTM         6S 0       COLHDG('異動時間')
     A****
     A          K DLIVNO
     A          K DLWTNO
     A          K DLITEM
