     A                                      UNIQUE
     A          R RDELMSTX                  TEXT('發票作廢紀錄主檔')
     A            DXFLAG         1A         COLHDG('處理代碼')
     A            DXINNO        10A         COLHDG('發票號碼')
     A            DXINDT         8S 0       COLHDG('發票日期')
     A            DXAREA         1A         COLHDG('發票開立廠區')
     A            DXDECD         1A         COLHDG('作廢碼')
     A            DXDEDT         8S 0       COLHDG('作廢日期')
     A            DXCUN1         6A         COLHDG('原客戶編號')
     A            DXCUM1        10O         COLHDG('原客戶名稱')
     A            DXORN1         6A         COLHDG('原訂單編號')
     A            DXAAMT        12S 0       COLHDG('原出貨金額')
     A            DXATAX         9S 0       COLHDG('原出貨稅額')
     A            DXBAMT        12S 0       COLHDG('原扣預收金額')
     A            DXNBAL        12S 0       COLHDG('原未收餘額')
     A            DXCODE         1A         COLHDG('承購發票')
     A            DXDLNO         6A         COLHDG('作廢申請單號')
     A            DXRVID         2A         COLHDG('作廢申請業務員')
     A            DXDEPT         1A         COLHDG('作廢部門')
     A            DXDESP        60O         COLHDG('異常原因說明')
     A            DXCUN2         6A         COLHDG('新客戶編號')
     A            DXCUM2        10O         COLHDG('新客戶名稱')
     A            DXORN2         6A         COLHDG('新訂單編號')
     A            DXAPUS        10A         COLHDG('申請人員')
     A            DXAPDT         8S 0       COLHDG('申請日期')
     A            DXAPTM         6S 0       COLHDG('申請時間')
     A            DXUPUS        10A         COLHDG('異動人員')
     A            DXUPDT         8S 0       COLHDG('異動日期')
     A            DXUPTM         6S 0       COLHDG('異動時間')
     A            DXRESV        12A         COLHDG('保留碼')
     A****
     A          K DXINNO
