     A                                      UNIQUE
     A          R RDELMST                   TEXT('發票作廢紀錄主檔')
     A            DMFLAG         1A         COLHDG('處理代碼')
     A            DMINNO        10A         COLHDG('發票號碼')
     A            DMINDT         8S 0       COLHDG('發票日期')
     A            DMAREA         1A         COLHDG('發票開立廠區')
     A            DMDECD         1A         COLHDG('作廢碼')
     A            DMDEDT         8S 0       COLHDG('作廢日期')
     A            DMCUN1         6A         COLHDG('原客戶編號')
     A            DMCUM1        10O         COLHDG('原客戶名稱')
     A            DMORN1         6A         COLHDG('原訂單編號')
     A            DMAAMT        12S 0       COLHDG('原出貨金額')
     A            DMATAX         9S 0       COLHDG('原出貨稅額')
     A            DMBAMT        12S 0       COLHDG('原扣預收金額')
     A            DMNBAL        12S 0       COLHDG('原未收餘額')
     A            DMCODE         1A         COLHDG('承購發票')
     A            DMDLNO         6A         COLHDG('作廢申請單號')
     A            DMRVID         2A         COLHDG('作廢申請業務員')
     A            DMDEPT         1A         COLHDG('作廢部門')
     A            DMDESP        60O         COLHDG('異常原因說明')
     A            DMCUN2         6A         COLHDG('新客戶編號')
     A            DMCUM2        10O         COLHDG('新客戶名稱')
     A            DMORN2         6A         COLHDG('新訂單編號')
     A            DMAPUS        10A         COLHDG('申請人員')
     A            DMAPDT         8S 0       COLHDG('申請日期')
     A            DMAPTM         6S 0       COLHDG('申請時間')
     A            DMUPUS        10A         COLHDG('異動人員')
     A            DMUPDT         8S 0       COLHDG('異動日期')
     A            DMUPTM         6S 0       COLHDG('異動時間')
     A            DMRESV        12A         COLHDG('保留碼')
     A****
     A          K DMINNO
