     A                                      UNIQUE
     A          R RDELMST                   TEXT('發票作廢記錄主檔')
     A                                      PFILE(DELMST)
     A          K DMDLNO
     A          K DMINNO
