     A          R RDISDTL                   TEXT('進倉履約折讓紀錄明細檔')
     A                                      PFILE(DISDTL)
     A          K DSINNO
     A          K DSORNO
     A          K DSYYMM
     A          K DSCONT
     A          K DSPROD
