     A                                      UNIQUE
     A          R RDISLOG                   TEXT('折讓銷退下載ＬＯＧ檔')
     A            ISFLAG         1A         COLHDG('處理代碼')
     A            ISTYPE         1A         COLHDG('發票類別')
     A            ISDECD         1A         COLHDG('作廢碼')
     A            ISDEDT         8S 0       COLHDG('作廢日期')
     A            ISCUNO         6A         COLHDG('客戶編號')
     A            ISCUNM        10O         COLHDG('客戶名稱')
     A            ISINDT         8S 0       COLHDG('退折日期')
     A            ISNO          10A         COLHDG('發票號碼')
     A            ISMARK         1A         COLHDG('區分碼')
     A* 1 =銷貨退回 2 =銷貨折讓
     A            ISPDNM         3A         COLHDG('品名代號')
     A            ISCHIN        32O         COLHDG('中文品名')
     A            ISQTY          7P 0       COLHDG('數量')
     A            ISUPRC         8P 3       COLHDG('單價')
     A            ISCAMT        11P 0       COLHDG('折讓／銷退金額')
     A            ISCTAX        11P 0       COLHDG('折讓／銷退稅額')
     A            ISTXTP         1A         COLHDG('稅別')
     A* 1 =應稅 2 =零稅 3 =免稅
     A            ISVNNO        10A         COLHDG('客戶統編')
     A            ISRESV         6A         COLHDG('備註')
     A            ISSEQN         5S 0       COLHDG('資料處理序號')
     A            ISFILE         6S 0       COLHDG('檔案序號')
     A****
     A          K ISNO
     A          K ISTYPE
