     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/22  2015AR953  S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A                                      UNIQUE
     A          R RDISMST                   TEXT('進倉履約折讓紀錄主檔')
     A            DMCUNO         6A         COLHDG('客戶代號')
     A            DMCUNM        10O         COLHDG('客戶簡稱')
     A            DMORNO         6A         COLHDG('訂單編號')
     A            DMYYMM         6S 0       COLHDG('處理年月')
     A            DMAREA         1A         COLHDG('廠區別')
     A            DMCONT         3S 0       COLHDG('處理次數')
0409AA            DMPROD         2A         COLHDG('訂單大類')
     A            DMSALE         2A         COLHDG('業務員')
     A            DMTYPE         1A         COLHDG('發票聯式')
     A            DMQTY1         9S 0       COLHDG('發票出貨量')
     A            DMAMT1        12S 0       COLHDG('發票總金額')
     A            DMAMT2        12S 0       COLHDG('其他折讓金額')
     A            DMAMT3        12S 0       COLHDG('繳款金額')
     A            DMAMT4         4S 3       COLHDG('折讓單價/公斤')
     A            DMAMT5        12S 0       COLHDG('折讓總價')
     A            DMQTY6         9S 0       COLHDG('加價數量')
     A            DMAMT6        12S 0       COLHDG('加價總價')
     A            DMCOD1         1A         COLHDG('折讓處理方式')
     A*                                     1:直接扣抵2:退票
     A            DMCOD2         1A         COLHDG('確認碼')
     A            DMCOD3         1A         COLHDG('開立碼')
     A            DMCOD4         1A         COLHDG('折扣碼')
     A            DMADDM        10A         COLHDG('輸入人員')
     A            DMADDD         8S 0       COLHDG('輸入日期')
     A            DMADDT         6S 0       COLHDG('輸入時間')
     A            DMUPDM        10A         COLHDG('異動人員')
     A            DMUPDD         8S 0       COLHDG('異動日期')
     A            DMUPDT         6S 0       COLHDG('異動時間')
     A            DMACYM         6S 0       COLHDG('入帳年月')
     A*
     A          K DMCUNO
     A          K DMORNO
     A          K DMYYMM
     A          K DMCONT
     A          K DMAREA
