     A          R RDISMST                   TEXT('進倉履約折讓紀錄主檔')
     A                                      PFILE(DISMSW)
     A          K DMYYMM
     A          K DMCONT
     A          K DMCUNO
     A          K DMORNO
     A          K DMAREA
