     A                                      UNIQUE
     A          R GEREC
     A            GEKIND         2A         COLHDG('編碼種類')
     A            GEPRIN        10A         COLHDG('編碼原則')
     A            GEPRE          2A         COLHDG('字軌')
     A            GESTNO         8S 0       COLHDG('起始號碼')
     A            GEENNO         8S 0       COLHDG('截止號碼')
     A            GECUNO         8S 0       COLHDG('目前號碼')
     A          K GEKIND
     A          K GEPRIN
