     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    INEDINP
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     電子發票作廢上送介面傳輸檔
     A*            5.DATE-WRITTEN  107/06/22 2018AR1162
     A*            6.UPDATE  DATE
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R RINEDIN                   TEXT('電子發票作廢上送介面檔')
     A            DNFLAG         1A         COLHDG('處理代碼')
     A            DNAREA         1A         COLHDG('廠區')
     A            DNMSTE         5A         COLHDG('M訊息代碼')
     A            DNNO          10A         COLHDG('M作廢發票號碼')
     A            DNINDT         8A         COLHDG('M發票開立日期')
     A            DNBYID        10A         COLHDG('M買方統編')
     A            DNSLID        10A         COLHDG('M賣方統編')
     A            DNDEDT         8A         COLHDG('M作廢日期')
     A            DNDETM         8A         COLHDG('M作廢時間')
     A            DNCLRN        40O         COLHDG('M作廢原因')
     A            DNRTDN       120O         COLHDG('O專案作廢核准文號')
     A            DNREMK       200O         COLHDG('O備註')
     A****
     A            DNTMDT         8S 0       COLHDG('傳輸日期')
     A            DNTMTM         6S 0       COLHDG('傳輸時間')
     A            DNTMOP        10A         COLHDG('傳輸人員')
     A            DNTAWS        10A         COLHDG('傳輸工作站')
     A            DNSTCL         1A         COLHDG('執行碼')
     A*
     A            DNXPDD         8S 0       COLHDG('上送日期')
     A            DNXPDT         6S 0       COLHDG('上送時間')
     A            DNXUSR        10A         COLHDG('上送人員')
     A            DNMAR1        30A         COLHDG('備註')
     A            DNPTYN         1A         COLHDG('列印碼')
     A*
     A          K DNNO
