     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    INENBU
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     電子發票空白未用字軌檔
     A*            5.DATE-WRITTEN  107/03/28 2017AR1112
     A*            6.UPDATE  DATE
     A*
     A****************************************************************
     A*
     A*                                     UNIQUE
     A          R RINENBU                   TEXT('電子發票空白未使用字軌檔')
     A            NUMSTE         5A         COLHDG('M訊息代碼')
     A            NUHEBN        10A         COLHDG('M總公司統編')
     A            NUBRBN        10A         COLHDG('M分支機構統編')
     A            NUINTE         2A         COLHDG('M發票類別')
     A            NUYEMH         5A         COLHDG('M發票期別')
     A            NUINTK         2A         COLHDG('M發票字軌')
     A            NUINBN         8A         COLHDG('M空白發票起號')
     A            NUINEN         8A         COLHDG('M空白發票迄號')
     A****
     A            NUFACT         1A         COLHDG('廠區')
     A            NUYYMM         6S 0       COLHDG('使用年月')
     A            NUKIND         2A         COLHDG('編碼種類')
     A            NUTMDT         8S 0       COLHDG('傳輸日期')
     A            NUTMTM         6S 0       COLHDG('傳輸時間')
     A            NUTMOP        10A         COLHDG('傳輸人員')
     A            NUTAWS        10A         COLHDG('傳輸工作站')
     A            NUSTCL         1A         COLHDG('執行碼')
     A*
     A            NUXPDD         8S 0       COLHDG('上送日期')
     A            NUXPDT         6S 0       COLHDG('上送時間')
     A            NUXUSR        10A         COLHDG('上送人員')
     A            NUMAR1        30A         COLHDG('備註')
     A*
     A          K NUFACT
     A          K NUYYMM
     A          K NUKIND
