     A                                      UNIQUE
     A          R RINMLOG                   TEXT('發票主檔下載ＬＯＧ檔')
     A            IMFLAG         1A         COLHDG('處理代碼')
     A            IMTYPE         1A         COLHDG('發票類別')
     A            IMDECD         1A         COLHDG('作廢碼')
     A            IMDEDT         8S 0       COLHDG('作廢日期')
     A            IMNO          10A         COLHDG('發票號碼')
     A            IMCUNO         6A         COLHDG('客戶編號')
     A            IMCUNM        10O         COLHDG('客戶名稱')
     A            IMORNO         6A         COLHDG('訂單號碼')
     A            IMINDT         8S 0       COLHDG('發票日期')
     A            IMKIND         1A         COLHDG('發票聯式')
     A            IMRVID         2A         COLHDG('收款業務員')
     A            IMSALE         2A         COLHDG('出貨業務員')
     A            IMSATP         1A         COLHDG('銷售別')
     A            IMAREA         1A         COLHDG('開立廠區')
     A            IMTXTP         1A         COLHDG('課稅別')
     A            IMAAMT        11P 0       COLHDG('出貨金額')
     A            IMATAX        11P 0       COLHDG('銷項稅額')
     A            IMBAMT        11P 0       COLHDG('扣預收貨款')
     A            IMCAMT        11P 0       COLHDG('折讓／銷退金額')
     A            IMCTAX        11P 0       COLHDG('折讓／銷退稅額')
     A            IMNBAL        11P 0       COLHDG('未收餘額')
     A            IMAPNO         7A         COLHDG('請款單號')
     A            IMAPDT         8S 0       COLHDG('請款日期')
     A            IMVNNO        10A         COLHDG('客戶統編')
     A            IMSEQN         5S 0       COLHDG('資料處理序號')
     A            IMFILE         6S 0       COLHDG('檔案序號')
     A****
     A          K IMNO
