     A                                      UNIQUE
     A          R RINVCUT                   TEXT('發票列印檔')
     A            CUFLAG         1A         COLHDG('處理代碼')
     A            CUAREA         1A         COLHDG('廠區別')
     A            CUNO          10A         COLHDG('發票號碼')
     A            CUTYPE         1A         COLHDG('發票類別')
     A            CUKIND         1A         COLHDG('發票聯式')
     A            CUINDT         8S 0       COLHDG('發票日期')
     A            CUINEA         1A         COLHDG('開立廠區')
     A            CUORNO         6A         COLHDG('訂單號碼')
     A            CUCUNO         6A         COLHDG('客戶編號')
     A            CUCUNM        10O         COLHDG('客戶名稱')
     A            CUDECD         1A         COLHDG('作廢碼')
     A            CURVID         2A         COLHDG('業務員代號')
     A            CUPRTC         1A         COLHDG('印發票控制碼')
     A            CURESV        20A         COLHDG('保留碼')
     A            CUUPDD         8S 0       COLHDG('異動日期')
     A            CUUPDT         6S 0       COLHDG('異動時間')
     A            CUUPDR        10A         COLHDG('異動者')
     A****
     A          K CUNO
