     A*****************************************************************
     A*
     A*                >>  PROGRAM INTRODUCTION  <<
     A*
     A*            1.PROGRAM-ID    INVDTPL3
     A*            2.PROGRAM-TYPE  PF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     發票明細檔
     A*            5.DATE-WRITTEN  107/11/23  2018AR00030
     A*            6.DATE-MODIFY
     A*
     A*****************************************************************
     A*                                     UNIQUE
     A          R IVREC                     TEXT('發票明細檔')
     A                                      PFILE(INVDTL)
     A****
     A          K IVAPNO
     A          K IVNO
     A          K IVACNT
     A          K IVITEM
     A          S IVAPNO                    COMP(NE ' ')
