     A                                      UNIQUE
     A          R IVREC                     TEXT('µo²¼©ú²ÓÀÉ')
                                            PFILE(INVDTL)
     A****
     A          K IVACNT
     A          K IVAPNO
     A          K IVNO
     A          K IVITEM
     A          S IVAPNO                    COMP(NE ' ')
     A            IVACNT                    VALUES('6' '7')
