     A          R IVREC                     TEXT('發票明細檔')
                                            PFILE(INVDTL)
     A****
     A            IVFLAG                    COLHDG('處理代號')
     A            IVNO                      COLHDG('發票號碼')
     A            IVACNT                    COLHDG('類別')
     A            IVITEM                    COLHDG('項次')
     A            IVACDT                    COLHDG('入帳日期')
     A            IVORNN             I      SST(IVORNO 1 6)
     A            IVPDCD                    COLHDG('品名代號')
     A            IVQTY                     COLHDG('數量')
     A            IVUPRC                    COLHDG('單價')
     A            IVAMT                     COLHDG('金額')
     A            IVDECD                    COLHDG('作廢碼')
     A            IVDEDT                    COLHDG('作廢日期')
     A            IVAPNO                    COLHDG('憑證編號')
     A            IVACNO                    COLHDG('傳票編號')
     A            IVFL01                    COLHDG('過訂單碼')
     A            IVFL02                    COLHDG('過發票碼')
     A            IVFL03                    COLHDG('類別碼')
     A            IVTXAR                    COLHDG('異動廠區')
     A            IVTXDT                    COLHDG('異動日期')
     A            IVRESV                    COLHDG('保留碼')
     A          K IVORNN
     A          K IVNO
     A          K IVACNT
     A          K IVAPNO
