     A****************************************************************
     A*
     A*            WRITE  DATE  99/08/02  2010AC309 S00WCJ
     A*
     A****************************************************************
     A                                      UNIQUE
     A          R IVREC                     TEXT('µo²¼©ú²ÓÀÉ')
                                            PFILE(INVDTL)
     A****
     A          K IVAPNO
     A          K IVNO
     A          K IVACNT
     A          K IVITEM
     A          S IVAPNO                    COMP(NE ' ')
