     A****************************************************************
     A*
     A*            WRITE   DATE  100/01/20  2010AR572  S00WCJ
     A*
     A*****************************************************************
     A*                                     UNIQUE
     A          R IVREC                     TEXT('µo²¼©ú²ÓÀÉ')
     A                                      PFILE(INVDTL)
     A****
     A          K IVNO
     A          K IVPDCD
     A          K IVUPRC
