     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    INVDTLL5
     H*            2.PROGRAM-TYPE  LF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     發票明細檔
     H*            5.DATE-WRITTEN  107/12/25 2018AR00042
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A*                                     UNIQUE
     A          R IVREC                     TEXT('發票明細檔')
                                            PFILE(INVD99)
     A****
     A          K IVACNT
     A          K IVTRNO
     A          K IVNO
     A          K IVITEM
     A          S IVTRNO                    COMP(NE ' ')
     A            IVACNT                    VALUES('7')
