     A                                      UNIQUE
     A          R INREC                     TEXT('µo≤º•D¿…')
                                            PFILE(INVMST)
     A****
     A          K INCUNO
     A          K INAPNO
     A          K ININDT
     A          K INNO
