     A                                      UNIQUE
     A          R INREC                     TEXT('發票主檔')
     A            INFLAG         1A         COLHDG('處理代碼')
     A            INTYPE         1A         COLHDG('發票類別')
     A            INDECD         1A         COLHDG('作廢碼')
     A            INDEDT         8S 0       COLHDG('作廢日期')
     A            INNO          10A         COLHDG('發票號碼')
     A            INCUNO         6A         COLHDG('客戶編號')
     A            INCUNM        10O         COLHDG('客戶名稱')
     A            INORNO         6A         COLHDG('訂單號碼')
     A            ININDT         8S 0       COLHDG('發票日期')
     A            INKIND         1A         COLHDG('發票聯式')
     A            INRVID         2A         COLHDG('收款業務員')
     A            INSALE         2A         COLHDG('出貨業務員')
     A            INSATP         1A         COLHDG('銷售別')
     A            INAREA         1A         COLHDG('開立廠區')
     A            INTXTP         1A         COLHDG('課稅別')
     A            INAAMT        11P 0       COLHDG('出貨金額')
     A            INATAX        11P 0       COLHDG('銷項稅額')
     A            INBAMT        11P 0       COLHDG('扣預收貨款')
     A            INCAMT        11P 0       COLHDG('折讓／銷退金額')
     A            INCTAX        11P 0       COLHDG('折讓／銷退稅額')
     A            INDAMT        11P 0       COLHDG('扣預收金額沖回')
     A            INDTAX        11P 0       COLHDG('扣預收稅額沖回')
     A            INEAMT        11P 0       COLHDG('繳款金額')
     A            INFAMT        11P 0       COLHDG('退票金額')
     A            INNBAL        11P 0       COLHDG('未收餘額')
     A            INMAMT        11P 0       COLHDG('運費金額')
     A            INAPNO         7A         COLHDG('請款單號')
     A            INAPDT         8S 0       COLHDG('請款日期')
     A            INRCNO         6A         COLHDG('繳款單號')
     A            INRCDT         8S 0       COLHDG('繳款日期')
     A            INFL01         1A         COLHDG('結案碼')
     A            INTXAR         1A         COLHDG('異動廠區')
     A            INTXDT         8S 0       COLHDG('異動日期')
     A            INPRTC         1A         COLHDG('印發票控制碼')
     A            INRESV         6A         COLHDG('保留碼')
     A*                                    前三碼為外銷發票之流水號
     A*                                    同HSCINV中的C1OSEQ
     A****
     A          K INNO
