     A                                      UNIQUE
     A          R INREC                     TEXT('µo≤º•D¿…')
     A                                      PFILE(INVMST)
     A          K ININDT
     A          K INNO
