     A                                      UNIQUE
     A          R INREC                     TEXT('µo≤º•D¿…')
                                            PFILE(INVMST)
     A****
     A          K INNO
     A          K INTYPE
     A          S INDECD                    COMP(NE 'D')
