     A                                      UNIQUE
     A          R INREC                     TEXT('µo≤º•D¿…')
                                            PFILE(INVMST)
     A****
     A          K INORNO
     A          K INNO
