     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    INVTFRL1
     H*            2.PROGRAM-TYPE  LF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     發票轉出記錄檔
     H*            5.DATE-WRITTEN  107/12/25 2018AR00042
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A*                                     UNIQUE
     A          R ITREC                     TEXT('發票轉出記錄')
     A                                      PFILE(INVTFR)
     A****
     A          K ITTRNO
     A          K ITINNO
