     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    INVTRL
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     區間發票試算調整檔
     H*            5.DATE-WRITTEN  99/05/20 2010AR421
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A*                                     UNIQUE
     A          R RINVTRL                   TEXT('區間發票試算調整檔')
     A                                      PFILE(INVTRL)
     A****
     A          K ITTXNO
     A          K ITITEM
