     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    INVTLG
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     開立跨月區間發票LOG檔
     H*            5.DATE-WRITTEN  102/09/05 2013AR768
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A*                                     UNIQUE
     A          R RINVTLG                   TEXT('開立跨月區間發票LOG檔')
     A            LGAREA         1A         COLHDG('開立廠別')
     A            LGDATE         8S 0       COLHDG('發票日期')
     A            LGTXD1         8S 0       COLHDG('銷貨區間起')
     A            LGTXD2         8S 0       COLHDG('銷貨區間迄')
     A            LGCUNO         6A         COLHDG('客戶編號')
     A            LGORNO        10O         COLHDG('訂單編號')
     A            LGENTM        10A         COLHDG('建檔人員')
     A            LGENTD         8S 0       COLHDG('建檔日期')
     A            LGENTT         6S 0       COLHDG('建檔時間')
     A****
     A          K LGAREA
     A          K LGDATE
