     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    INVTRT
     H*            2.PROGRAM-TYPE  PF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     區間發票試算調整備註說明檔
     H*            5.DATE-WRITTEN  102/07/09 2013AR754
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A                                      UNIQUE
     A          R RINVTRT                   TEXT('區間發票試算調整備註說明檔')
     A            TTFLAG         1A         COLHDG('處理代碼')
     A            TTNO          10A         COLHDG('試算單碼')
     A            TTTEX1        72O         COLHDG('備註１')
     A            TTTEX2        72O         COLHDG('備註２')
     A            TTENTM        10A         COLHDG('建檔人員')
     A            TTENTD         8S 0       COLHDG('建檔日期')
     A            TTENTT         6S 0       COLHDG('建檔時間')
     A            TTUPDM        10A         COLHDG('異動人員')
     A            TTUPDD         8S 0       COLHDG('異動日期')
     A            TTUPDT         6S 0       COLHDG('異動時間')
     A****
     A          K TTNO
