     A                                      UNIQUE
     A          R RVREC                     TEXT('Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(RCVDTL)
     A****
     A          K RVDATE
     A          K RVNTNO
     A          K RVNO
     A          K RVITEM
     A          S RVDECD                    COMP(EQ ' ')
