     A****************************************************************
     A*
     A*            UPDATE  DATE  101/09/18  2012AR682  S00WCJ (0109A)
     A*
     A****************************************************************
     A                                      UNIQUE
     A          R RVREC                     TEXT('Ãº´Ú©ú²ÓÀÉ')
                                            PFILE(RCVDTL)
     A****
     A          K RVDUDT
     A          K RVNTNO
     A          K RVNO
     A          K RVITEM
     A          O RVACNO                    COMP(NE '1131')
0109AA            RVACNO                    COMP(NE '111001')
     A          O RVDECD                    COMP(NE ' ')
