     A          R RVREC                     PFILE(RCVDTL)
     A          K RVDUDT
     A          K RVNTNO
     A          K RVNO
     A          S RVDECD                    COMP(EQ ' ')
