     A                                      UNIQUE
     A          R RVREC                     TEXT('Ãº´Ú©ú²ÓÀÉ')
                                            PFILE(RCVDTL)
     A****
     A          K RVWRNO
     A          K RVNTNO
     A          K RVNO
     A          K RVITEM
     A          S RVDECD                    COMP(EQ ' ')
     A            RVWRNO                    COMP(NE ' ')
