     A          R RVREC                     TEXT('Ãº´Ú©ú²ÓÀÉ')
                                            PFILE(RCVDTL)
     A****
     A          K RVNO
     A          K RVITEM
     A          S RVDECD                    COMP(NE 'D')
     A            RVUSTP                    COMP(NE 'A2')
     A            RVNTCD                    COMP(EQ '1')
