     A          R RVREC                     TEXT('Ãº´Ú©ú²ÓÀÉ')
                                            PFILE(RCVDTL)
     A****
     A          K RVNO
     A          K RVITEM
     A          S RVDECD                    COMP(EQ ' ')
     A            RVUSTP                    COMP(EQ 'C1')
     A            RVNTCD                    COMP(EQ '1')
