     A          R SRREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARCVF)
     A*
     A          K SRRVDT
     A          K SRRVNO
     A          K SRITEM
