     A                                      UNIQUE
     A          R SRREC                     TEXT('營業繳款明細檔')
     A            SRRVNO         6A         COLHDG('繳款編號')
     A            SRFL01         1A         COLHDG('營業確認碼')
     A            SRFL02         1A         COLHDG('財會過入碼')
     A            SRFL03         1A         COLHDG('營業列印碼')
     A            SRNAMT        11P 0       COLHDG('繳款金額合計')
     A            SRXAMT        11P 0       COLHDG('沖銷發票金額合計')
     A            SRRVDT         8S 0       COLHDG('繳款日期')
     A            SRCUNO         6A         COLHDG('客戶編號')
     A            SRDPNO         4A         COLHDG('部門編號')
     A            SRRVID         2A         COLHDG('收款業務員')
     C*
     A            SRITEM         2S 0       COLHDG('項次')
     A            SRACTP         1A         COLHDG('借貸別')
     A            SRUSTP         2A         COLHDG('款項別')
     A            SRNTTP         1A         COLHDG('票據別')
     A            SRACNO         4A         COLHDG('會計科目')
     A            SRPBID        14O         COLHDG('付款銀行')
     A            SRPANO        10A         COLHDG('付款帳號')
     A            SRPLAC         1A         COLHDG('付款地')
     A            SRNTNO        10A         COLHDG('票據號碼')
     A            SRRAMT        11P 0       COLHDG('收款金額')
     A            SRRLNO        10A         COLHDG('相關號碼')
     A            SRSBID        10A         COLHDG('存入銀行')
     A            SRSANO        10A         COLHDG('存入帳號')
     A            SRDUDT         8S 0       COLHDG('到期日')
     A            SRRESV        12A         COLHDG('保留碼')
     A*
     A            SRTXDT         8S 0       COLHDG('登錄日期')
     A            SRTXUS        10A         COLHDG('登錄人員')
     A            SRCFDT         8S 0       COLHDG('確認日期')
     A            SRCFUS        10A         COLHDG('確認人員')
     A            SRTRDT         8S 0       COLHDG('過入日期')
     A            SRTRUS        10A         COLHDG('過入人員')
     A* 89/04/20擴檔,紀錄原暫收之繳款單號及兌現日期
     A            SROLRV         6A         COLHDG('原繳款單號')
     A            SROLDT         8S 0       COLHDG('原兌現日期')
     A            SRRES2        12A         COLHDG('保留碼2')
     A*
     A          K SRRVNO
     A          K SRITEM
