     A****************************************************************
     A*
     A*            UPDATE  DATE  101/09/18  2012AR682 S00WCJ (0109A)
     A*
     A****************************************************************
     A          R SRREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARCVF)
     A*
     A          K SRCUNO
     A*
     A          S SRFL02                    COMP(EQ ' ')
     A            SRACNO                    COMP(EQ '2159')
0109AA            SRACNO                    COMP(EQ '211301')
