     A          R SRREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARCVF)
     A*
     A          K SRCUNO
     A          K SRRVDT                     DESCEND
     A          K SRRVNO                     DESCEND
     A          K SRITEM
