     A          R SRREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARCVF)
     A*
     A          K SRNTTP
     A          K SRNTNO
     A          K SRRVNO
