     A*****************************************************************
     A*
     A*            *****   PROGRAM INTRODUCTION   *****
     A*
     A*            1.PROGRAM-ID    SARCVFL5
     A*            2.PROGRAM-TYPE  LF
     A*            3.AUTHOR        S00WCJ
     A*            4.FUNCTION     營業繳款明細檔
     A*            5.DATE-WRITTEN  98/10/29 2009AR370
     A*
     A*****************************************************************
     A*
     A          R SRREC                     TEXT('營業繳款明細檔')
     A                                      PFILE(SARCVF)
     A*
     A          K SRCUNO
     A          K SRRVDT                     DESCEND
     A          K SRRVNO                     DESCEND
     A          K SRITEM
     A          S SRMKTP                     COMP(EQ '1')
