     A          R SIREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARVIN)
     A*
     A          K SIINNO
