     A          R SIREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARVIN)
     A*
     A          K SIINNO
     A          O SIFL02                    COMP(EQ 'Y')
