     A                                      UNIQUE
     A          R SIREC                     TEXT('營業繳款發票沖銷檔')
     A            SIINNO        10A         COLHDG('發票號碼')
     A            SIINXA        11P 0       COLHDG('沖銷金額')
     A            SIINAM        11P 0       COLHDG('發票金額')
     A*
     A          K SIINNO
