     A***************************************************************
     A*
     A*       UPDATE  DATE  104/08/03  S00WCJ (0408A)
     A*                      增加磅單項次，以讀到精準之資料
     A*
     A**************************************************************
     A          R SOREC                     TEXT('營業繳款明細檔')
     A                                      PFILE(SARVOR)
     A*
     A          K SOORNO
     A          K SOSTNO
0408AA          K SOSTIT
