     A          R SOREC                     TEXT('Àç·~Ãº´Ú©ú²ÓÀÉ')
     A                                      PFILE(SARVOR)
     A*
     A          K SOSTNO
     A          K SOORNO
     A          S SOFL02                    COMP(EQ 'Y')
