     A****************************************************************
     A*
     A*       UPDATE  DATE  104/09/16  2015AR953 S00WCJ (0409A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R SOREC                     TEXT('營業外銷繳款磅單沖銷檔')
     A            SORVNO         6A         COLHDG('繳款編號')
     A            SOITEM         3S 0       COLHDG('繳款項次')
     A            SOORNO        10A         COLHDG('訂單號碼')
     A            SOSTNO         8A         COLHDG('磅單號碼')
     A            SOSTIT         4S 0       COLHDG('磅單項次')
     A            SONOAM        11P 0       COLHDG('磅單金額')
     A            SONOXA        11P 0       COLHDG('沖銷金額')
     A            SONOBA        11P 0       COLHDG('磅單餘額')
0409AA            SOPDNM         5A         COLHDG('品名代號')
     A            SOCODE         1A         COLHDG('全部沖銷')
     A            SOQTY          7P 0       COLHDG('數量')
     A            SOFL02         1A         COLHDG('財會過入碼')
     A            SORES1        11P 0       COLHDG('保留碼一')
     A            SORES2        11P 0       COLHDG('保留碼二')
     A            SORES3        11P 0       COLHDG('保留碼三')
     A            SORES4        20A         COLHDG('保留碼四')
     A            SORES5        20A         COLHDG('保留碼五')
     A            SORES6        20A         COLHDG('保留碼六')
     A*
     A          K SORVNO
     A          K SOITEM
