     A          R RSAVOUR                   PFILE(SRTEST)
     A            S4FLAG
     A            S4TRCD
     A            S4VREA
     A            S4VRNO
     A            S4VRTM
     A            S4STNO
     A            S4DATE
     A            S4CUST
     A            S4ORNO
     A            S4PDNM
     A            S4PDQL
     A            S4PDS1
     A            S4PDS2
     A            S4UNIT
     A            S4PCLA
     A            S4RSV
     A            S4PNUM
     A            S4TWGT
     A            S4CWGT
     A            S4NWGT
     A            S4CDE1
     A            S4CDE2
     A            S4BCDE
     A            S4TPRC
     A            S4IPRC
     A            S4ACDT
     A            S4DIST
     A            S4CUNO
     A            S4TFBT
     A            S4TFMK
     A            S4TFCP
     A            S4CDE3
     A          K S4TRCD
     A          K S4VREA
     A          K S4VRNO
     A          K S4VRTM
     A          S S4FLAG                    COMP(NE 'D')
     A            S4PCLA                    COMP(NE 'D')
