     A          R RTNDLOG                   TEXT('¾P³f¤U¸ü¢Ú¢Ý¢ÕÀÉ')
                                            PFILE(TNDLOG)
     A****
     A          K TWCODE
     A          K TWNO
     A          K TWITEM
