     A***************************************************************
     A*
     A*       WRITE   DATE  107/04/16
     A*
     A***************************************************************
     A          R TXREC                     TEXT('¾P³f©ú²ÓÀÉ')
     A                                      PFILE(TREXPT)
     A            TXFLAG
     A            TXCODE
     A            TXNO
     A            TXITEM
     A            TXACNT
     A            TXDATE
     A            TXACDT
     A            TXCUNO
     A            TXCUNM
     A            TXORNO
     A            TXIVNO
     A            TXPCNO
     A            TXVUNO
     A            TXRVID
     A            TXSALE
     A            TXSATP
     A            TXIVTP
     A            TXPDNM
     A            TXQTY
     A            TXUPRC
     A            TXAMT
     A            TXTAX
     A            TXFL01
     A            TXFL02
     A            TXTXAR
     A            TXTXDT
     A            TXRESV
     A            TXORN5             I      SST(TXORNO 1 6)
     A          K TXORN5
