     A          R TXREC                     TEXT('¾P³f©ú²ÓÀÉ')
                                            PFILE(TRNDTL)
     A****
     A          K TXIVNO
     A          S TXIVNO                    COMP(NE ' ')
     A            TXCODE                    COMP(NE 'AR06')
