     H*****************************************************************
     H*
     H*            *****   PROGRAM INTRODUCTION   *****
     H*
     H*            1.PROGRAM-ID    TRNDTLLE
     H*            2.PROGRAM-TYPE  LF
     H*            3.AUTHOR        S00WCJ
     H*            4.FUNCTION     ¾P³f©ú²ÓÀÉ
     H*            5.DATE-WRITTEN  103/06/18
     H*            6.UPDATE BY
     H*
     H*****************************************************************
     A          R TXREC                     TEXT('¾P³f©ú²ÓÀÉ')
     A                                      PFILE(TRNDTL)
     A          K TXCUNO
     A          K TXNO
     A          K TXITEM
     A          S TXCODE                    VALUES('AR06')
     A            TXACDT                    VALUES(99999999)
