     A****************************************************************
     A*
     A*       UPDATE  DATE  104/11/12  2015AR953  S00WCJ (0411A)
     A*                      產品代碼3碼擴5碼
     A*                     106/12/08  2017AR1116 S00WCJ (0612A)
     A*                      增加庫別欄位
     A*
     A****************************************************************
     A*
     A                                      UNIQUE
     A          R UPREC                     TEXT('工程明細檔')
     A            UPPJNO        10A         COLHDG('專案編號')
     A            UPAREA         1A         COLHDG('申請廠區')
     A            UPDATE         8S 0       COLHDG('申請日期')
     A            UPCUNO         6A         COLHDG('目標客戶')
     A            UPFNAM        36O         COLHDG('客戶全稱')
     A            UPMUID         8A         COLHDG('統一編號')
     A            UPSEQ          8S 0       COLHDG('流水編號')
     A            UPITEM         3S 0       COLHDG('項次')
0411AA            UPPDNM         5A         COLHDG('品名代號')
     A            UPCHIN        32O         COLHDG('中文品名')
     A            UPUPRC         8P 3       COLHDG('單價')
     A            UPQTY          8P 0       COLHDG('數量')
     A            UPAMT         11P 0       COLHDG('金額')
     A            UPTAX         11P 0       COLHDG('稅額')
0612AA            UPSTNO         4A         COLHDG('庫別')
     A*
     A          K UPSEQ
     A          K UPITEM
