     A****************************************************************
     A*
     A*       UPDATE  DATE  104/11/12 2015AR953 S00WCJ (0411A)
     A*                      產品代碼3碼擴5碼
     A*
     A****************************************************************
     A                                      UNIQUE
     A          R UNREC                     TEXT('新桃工程自用發票開立主檔')
     A            UNFLAG         1A         COLHDG('處理代碼')
     A            UNYM           6S 0       COLHDG('年月')
     A            UNAREA         1A         COLHDG('廠區')
     A            UNCUNO         6A         COLHDG('目標客戶代號')
     A            UNTRCD         2A         COLHDG('異動代號')
0411AA            UNPDNM         5A         COLHDG('品名')
     A            UNPNUM         5P 0       COLHDG('支捆數')
     A            UNQTY          7P 0       COLHDG('數量')
     A            UNAMT         11P 0       COLHDG('總金額')
     A            UNTXUS        10A         COLHDG('處理人員')
     A            UNTXDD         8S 0       COLHDG('處理日期')
     A            UNTXDT         6S 0       COLHDG('處理時間')
     A            UNRES1        20A         COLHDG('保留１')
     A            UNRES2        20A         COLHDG('保留２')
     A            UNRES3        20A         COLHDG('保留３')
     A            UNRES4        30A         COLHDG('保留４')
     A            UNRES5        30A         COLHDG('保留５')
     A****
     A          K UNYM
     A          K UNAREA
     A          K UNCUNO
     A          K UNTRCD
     A          K UNPDNM
