     A                                      UNIQUE
     A          R UEREC
     A            UEKIND         2A         COLHDG('編碼種類')
     A            UEPRIN        10A         COLHDG('編碼原則')
     A            UEPRE          2A         COLHDG('字軌')
     A            UESTNO         8S 0       COLHDG('起始號碼')
     A            UEENNO         8S 0       COLHDG('截止號碼')
     A            UECUNO         8S 0       COLHDG('目前號碼')
     A          K UEKIND
     A          K UEPRIN
