     A          R WREC1
     A            W1SALE         2A         COLHDG('業務員別')
     A            W1ORNO         9A         COLHDG('訂單編碼')
     A            W1CUNO         6A         COLHDG('客戶編號')
     A            W1CUNM        10O         COLHDG('客戶名稱')
     A            W1ACDT         8S 0       COLHDG('出貨日')
     A            W1GAMT        11P 0       COLHDG('應收款金額')
     A            W1NO          10A         COLHDG('發票號碼')
     A            W1BK12        12A         COLHDG('空白')
