     A                                      UNIQUE
     A          R WNREC                     TEXT('發票工作檔')
     A            WNNO          10A         COLHDG('發票號碼')
     A            WNCUNO         6A         COLHDG('客戶編號')
     A            WNCUNM        10O         COLHDG('客戶名稱')
     A            WNORNO         6A         COLHDG('訂單號碼')
     A            WNINDT         8S 0       COLHDG('發票日期')
     A            WNCGDT         8S 0       COLHDG('折讓日期')
     A            WNSALE         2A         COLHDG('出貨業務員')
     A            WNCAMT        11P 0       COLHDG('折讓／銷退金額')
     A            WNQTY         11P 0       COLHDG('折讓／銷退重量')
     A            WNTXAR         1A         COLHDG('異動廠區')
     A            WNRESV        20A         COLHDG('保留碼')
     A          K WNNO
